{
	"scenes": [
		{},
		{
			"texts": [
				{
					"name": "Kaito (Hologram)",
					"text": "Back then, I truly had lost the will to live."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "And yet, when my hunger grew too great, I would always find myself reaching for food."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "I was disgusted with myself for clinging to life for no reason, while the despair of losing her turned me into a dead man walking."
				},
				{
					"name": "Kaito",
					"text": "No... It's normal. We were still human, after all."
				},
				{
					"name": "Kaito",
					"text": "And Iruma and the old man gave us a faint glimmer of hope in life, despite everything."
				},
				{
					"text": "My projection nods."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "That's right. And that willful persistence..."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "That's what brought the hope we needed in the end."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"text": "My name has become famous in the world outside this room."
				},
				{
					"text": "Several months ago, Asuma addressed all the city residents through a video."
				},
				{
					"text": "He declared that a place of peace had finally been created."
				},
				{
					"text": "A place in which every inhabitant of the city could experience life of the surface."
				},
				{
					"text": "Given the moniker of 'virtual space,' it was a dream technology in more than one way, produced by direct stimulation of the brain's sensory nerves."
				},
				{
					"text": "That's how he explained it."
				},
				{
					"text": "And the migration plan was named the Kaito Project."
				},
				{
					"text": "From that day onward, I was able to watch a real-time feed of the world of the virtual space."
				},
				{
					"text": "I've wiled away my life staring into that world. The world inside Yonagi, who is no longer herself..."
				},
				{
					"text": "Whenever I get hungry, I stuff my mouth full of cornmeal, and I get up to use the restroom once every two days."
				},
				{
					"text": "While I'm up, I pick up the rations left by my door, then come back to stare at the screen again."
				},
				{
					"text": "As I whittle the days away, I hear the low side grow quieter and quieter."
				},
				{
					"text": "As the migration of the midsiders comes to an end, the migration of the lowsiders has begun."
				},
				{
					"text": "People's lives have begun to take root in the world I see through the screen."
				},
				{
					"text": "No one thinks of Yonagi as human anymore."
				},
				{
					"text": "No one is even aware of her existence."
				},
				{
					"text": "None of them realize how they're trampling on her dignity."
				},
				{
					"text": "I've sworn to die, wallowing in a despair of my own making."
				},
				{
					"text": "Here, wallowing in a despair of my own doing."
				},
				{
					"text": "That's why I watch that screen every day."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"text": "The door opens and someone steps inside."
				},
				{
					"text": "My attention remains focused on the screen."
				},
				{
					"text": "In my peripheral vision, I can see several pairs of men's shoes walking along the floor."
				},
				{
					"text": "...At least take your shoes off before you come into a man's house."
				},
				{
					"text": "It should be the least of my worries, but it's what manages to find its way into my hazy thoughts."
				},
				{
					"name": "Asuma",
					"text": "Kaito..."
				},
				{
					"text": "It sounds like a familiar voice."
				},
				{
					"name": "Asuma",
					"text": "It happened again. A new despair has come to plague me."
				},
				{
					"name": "Asuma",
					"text": "I can't help but wonder... Why is it that the greater the difficulty, the less apparent it makes itself until it's already too late?"
				},
				{
					"name": "Asuma",
					"text": "By the time I noticed, there was nothing I could do."
				},
				{
					"name": "Asuma",
					"text": "I've exhausted all measures. I want your help."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"text": "My help?"
				},
				{
					"text": "Who could possibly want my help?"
				},
				{
					"text": "I'm beyond being of use to anyone."
				},
				{
					"name": "Asuma's Lab Researcher",
					"text": "Is he even alive, sir?"
				},
				{
					"name": "Asuma",
					"text": "He is."
				},
				{
					"name": "Asuma",
					"text": "Stream it."
				},
				{
					"name": "Asuma's Lab Researcher",
					"text": "Yes sir..."
				},
				{
					"name": "Asuma",
					"text": "It was all working perfectly. There was not a single anomaly even as we successfully migrated seventy percent of the city's population."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"text": "I..."
				},
				{
					"text": "My eyes are nailed to the screen in front of me."
				},
				{
					"text": "I know these girls."
				},
				{
					"name": "Asuma",
					"text": "One day, every person connected to the virtual space started having the same dream."
				},
				{
					"name": "Asuma",
					"text": "All of them. Seeing the same dream every night."
				},
				{
					"name": "Asuma",
					"text": "A fatal error has occurred somewhere."
				},
				{
					"text": "Hatano Rin."
				},
				{
					"text": "Olivia Berry."
				},
				{
					"text": "Momonouchi Sumomo."
				},
				{
					"text": "The alter egos that formed in Yonagi's consciousness."
				},
				{
					"name": "Asuma",
					"text": "The last thing we tried was restarting the virtual space. But still, all the inhabitants have the same dream. It appears that there are three kinds of dreams they're having."
				},
				{
					"text": "The girls..."
				},
				{
					"text": "They're desperately protecting Yonagi."
				},
				{
					"text": "She..."
				},
				{
					"text": "She's still there."
				},
				{
					"text": "She's still somewhere in there."
				},
				{
					"text": "The girls know that."
				},
				{
					"text": "Yonagi.."
				},
				{
					"text": "I haven't lost her yet."
				},
				{
					"name": "Asuma",
					"text": "Yonagi keeps sending these images. No matter what we do, it just doesn't stop."
				},
				{
					"name": "Asuma",
					"text": "We cannot perform any more surgery on her. If we cut out any more of her brain, the dreamscape itself may disappear."
				},
				{
					"name": "Asuma",
					"text": "We concluded that our only choice was to call upon you."
				},
				{
					"name": "Asuma",
					"text": "In the end, this was always beyond me."
				},
				{
					"name": "Asuma",
					"text": "Help us, Kaito..."
				},
				{
					"text": "Yonagi..."
				},
				{
					"text": "She's calling to me?"
				},
				{
					"text": "Ah, it's just like when we were kids."
				},
				{
					"text": "Back when we were young and innocent."
				},
				{
					"text": "When she brimmed with desire to tell stories to the world."
				},
				{
					"text": "Yes, Yonagi..."
				},
				{
					"text": "You said you were writing these stories to help you when you were no longer yourself."
				},
				{
					"text": "Yonagi..."
				},
				{
					"text": "Yonagi..."
				},
				{
					"name": "Kaito",
					"text": "Yona...gi..."
				},
				{
					"text": "Is there anything I can do?"
				},
				{
					"text": "Are you calling me, Yonagi?"
				},
				{
					"text": "You are, aren't you?"
				},
				{
					"name": "Kaito",
					"text": "...I have conditions."
				},
				{
					"name": "Kaito",
					"text": "You will accept them if you want me to go to the lab."
				},
				{
					"text": "Still slumped on the floor, I turn my gaze up to Asuma."
				},
				{
					"name": "Asuma",
					"text": "We'll do whatever you ask."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "To give me sole authority over the research."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "To ensure that the project was kept strictly confidential."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "For entry to the institute to be barred to all while I worked."
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Kaito",
					"text": "Those were our conditions."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "He acquiesced to them all, and handed over the reins of the institute."
				},
				{
					"name": "Kaito",
					"text": "Izumo and Wooleep were all I needed."
				},
				{
					"name": "Kaito",
					"text": "Besides..."
				},
				{
					"name": "Kaito",
					"text": "I'm sure that's what Yonagi would have wanted."
				},
				{
					"text": "This time, it's my hologram nodding at me."
				},
				{
					"text": "My first step is to see Yonagi with Izumo and Wooleep."
				},
				{
					"name": "Yonagi",
					"text": "..."
				},
				{
					"text": "She's simply... there. Facing me with a completely emotionless visage."
				},
				{
					"text": "But it no longer fills me with despair."
				},
				{
					"text": "Deep behind those lifeless eyes, she's there."
				},
				{
					"text": "That conviction is my hope."
				},
				{
					"text": "I take her in my arms."
				},
				{
					"text": "She doesn't resist. She doesn't even react."
				},
				{
					"name": "Kaito",
					"text": "I think you can hear me in there."
				},
				{
					"name": "Kaito",
					"text": "You can hear me, can't you?"
				},
				{
					"name": "Kaito",
					"text": "I'm going to save you."
				},
				{
					"name": "Kaito",
					"text": "Wait just a little longer, I'll be right there."
				},
				{
					"text": "I let go of her thin, weakened frame."
				},
				{
					"text": "I gently guide her to a chair and sit her down."
				},
				{
					"text": "Her empty gaze rests on nothing in particular."
				},
				{
					"text": "I get up and take a deep breath to gather myself."
				},
				{
					"text": "I'm back home. My old lab..."
				},
				{
					"name": "Kaito",
					"text": "Okay..."
				},
				{
					"text": "I breathe out slowly, steeling my determination."
				},
				{
					"name": "Kaito",
					"text": "Time to wake up our assistant."
				},
				{
					"text": "For the first time in years, I feel full of energy and ready to work."
				},
				{
					"text": "I head to the room where I left Izumo."
				},
				{
					"text": "She's working fine, except for a short in her internal wiring and empty power reserves."
				},
				{
					"text": "Probably blown fuses from a sudden power surge."
				},
				{
					"text": "When I replace the burnt fuses and finish charging her, her blue eyes slowly light up."
				},
				{
					"name": "Kaito",
					"text": "Kept you waiting, didn't I?"
				},
				{
					"name": "Izumo",
					"text": "Kaito."
				},
				{
					"text": "I nod when she says my name."
				},
				{
					"name": "Kaito",
					"text": "Your archives seem unaffected. Let's get started."
				},
				{
					"name": "Izumo",
					"text": "Started with what?"
				},
				{
					"name": "Kaito",
					"text": "I'll explain everything. You'll be my assistant and advisor for this."
				},
				{
					"name": "Kaito",
					"text": "Let me brew us some coffee first. Ah, you don't drink that, do you?"
				},
				{
					"text": "Izumo says nothing as I talk and talk and talk."
				},
				{
					"text": "It's like a dam has broken inside me."
				},
				{
					"text": "I include everything she needs to know to help me determine what to do next."
				},
				{
					"text": "But other than that..."
				},
				{
					"text": "Everything that happened..."
				},
				{
					"text": "And everything I felt..."
				},
				{
					"text": "The hope that blossomed within me watching Yonagi's dreams on screen..."
				},
				{
					"text": "Perhaps I really wanted—no, needed someone to hear all of it."
				},
				{
					"text": "Izumo listens quietly, interjecting with small nods."
				},
				{
					"name": "Kaito",
					"text": "I know better now."
				},
				{
					"name": "Kaito",
					"text": "I know they have no intention of letting us go. We should assume that they're monitoring us somehow to make sure we don't stray from their policies."
				},
				{
					"name": "Kaito",
					"text": "But I think saving Yonagi and completely killing off her ego are two sides of the same coin."
				},
				{
					"name": "Izumo",
					"text": "What do you mean?"
				},
				{
					"name": "Kaito",
					"text": "I think part of Yonagi's remaining brain is trying to substitute for her removed frontal lobe in some capacity."
				},
				{
					"name": "Kaito",
					"text": "The brain tends to try to compensate for deficiencies like that."
				},
				{
					"text": "Izumo nods in agreement."
				},
				{
					"name": "Kaito",
					"text": "What we're going to do is to send signals reacting to the images she's projecting. My hypothesis is that she's looking for a response from me."
				},
				{
					"name": "Izumo",
					"text": "I concur with that hypothesis."
				},
				{
					"name": "Kaito",
					"text": "I need you to provide the environments and events from whatever era she's envisioning."
				},
				{
					"name": "Kaito",
					"text": "You and Wooleep will send that data along with corrections to the physics algorithms, and I'll move the stories along."
				},
				{
					"name": "Kaito",
					"text": "That's the process by which we’ll map Yonagi's brain."
				},
				{
					"name": "Kaito",
					"text": "In other words, we'll use the process of reconstructing her ego to figure out which parts of the brain make it up and through what channels."
				},
				{
					"name": "Kaito",
					"text": "The way to save her and the way to eliminate her ego are one and the same."
				},
				{
					"name": "Kaito",
					"text": "If they were to completely suppress the areas of the brain compensating for her frontal lobe, she would become the perfect operating system they want. Their virtual world would be complete."
				},
				{
					"name": "Kaito",
					"text": "It would be rid of the bugs her will is creating and projecting into the dreamscape."
				},
				{
					"name": "Izumo",
					"text": "I understand."
				},
				{
					"text": "I nod back to her."
				},
				{
					"name": "Kaito",
					"text": "Asuma's goals and mine are in total opposition, but the path to both is exactly the same."
				},
				{
					"name": "Izumo",
					"text": "Is it safe for you to disclose this so openly while we may be under surveillance?"
				},
				{
					"name": "Kaito",
					"text": "They can't stop me. They're powerless now."
				},
				{
					"text": "I take a big swig of my coffee."
				},
				{
					"name": "Kaito",
					"text": "What do you make of the situation so far?"
				},
				{
					"name": "Izumo",
					"text": "I cannot make an assessment without first observing Yonagi's state as she sleeps."
				},
				{
					"name": "Kaito",
					"text": "Very pragmatic."
				},
				{
					"text": "I finish off the last of the coffee in my cup, then I get up."
				},
				{
					"name": "Kaito",
					"text": "Well, we better get started."
				},
				{
					"text": "I lift Yonagi out of her chair and carry her to one of the rooms that has a bed."
				},
				{
					"text": "I lay her down in the capsule bed."
				},
				{
					"text": "I lovingly stroke her hair."
				},
				{
					"name": "Kaito",
					"text": "Rest easy. There's no one here to hurt you anymore."
				},
				{
					"name": "Kaito",
					"text": "No forcing you to take anything either. Just sleep whenever you want, and we'll find you."
				},
				{
					"name": "Kaito",
					"text": "And I'll be there for you when you call out to me."
				},
				{
					"text": "She doesn't respond, her aimless gaze staring out at nothing."
				},
				{
					"name": "Kaito",
					"text": "It's only Izumo and me here. Wooleep is with us too. Our family's all together again."
				},
				{
					"name": "Kaito",
					"text": "You can rest easy now."
				},
				{
					"name": "Yonagi",
					"text": "..."
				},
				{
					"name": "Kaito",
					"text": "Just being able to touch you again makes me so happy. I want it to last forever."
				},
				{
					"text": "I lose track of time as I sit beside her."
				},
				{
					"text": "At last, she closes her eyes."
				},
				{
					"name": "Kaito",
					"text": "Mhm."
				},
				{
					"name": "Izumo",
					"text": "She appears to be asleep. Her brain waves are primarily of the δ variety."
				},
				{
					"name": "Kaito",
					"text": "Yeah."
				},
				{
					"name": "Kaito",
					"text": "It's possible that being awake may actually be painful for her in her condition. Let's prepare the building so she can rest peacefully."
				},
				{
					"name": "Kaito",
					"text": "Adjust the temperature and humidity to settings that will maximize her comfort."
				},
				{
					"name": "Kaito",
					"text": "I'm sure there's some kind of scent that's supposed to help with sleep."
				},
				{
					"text": "I think back."
				},
				{
					"text": "I remember something written in one of the encyclopedias I read as a kid."
				},
				{
					"name": "Kaito",
					"text": "Cedar. Yes, the scent of cedar. Generate it with the aroma printer and circulate it through the air conditioner system."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"name": "Kaito",
					"text": "I will sleep to match Yonagi's REM cycle. Just monitor us for now."
				},
				{
					"name": "Izumo",
					"text": "Yes."
				},
				{
					"name": "Kaito",
					"text": "As for the connection..."
				},
				{
					"text": "Because her ego is superficially lost, my sensory signals should be able to reach her directly."
				},
				{
					"name": "Kaito",
					"text": "We'll connect directly. If there's need for it, use Wooleep to adjust the physics of the space. Also, keep track of our biometric data at all times."
				},
				{
					"name": "Izumo",
					"text": "I will."
				},
				{
					"text": "I gaze down at Yonagi as she sleeps."
				},
				{
					"text": "She looks just like I remember. So serene and peaceful."
				},
				{
					"name": "Izumo",
					"text": "You are not going to sleep yet?"
				},
				{
					"name": "Kaito",
					"text": "I want to look at her a little longer."
				},
				{
					"name": "Kaito",
					"text": "If you can monitor us from a distance, you can go and start preparing the cedar scent."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"text": "I find myself smiling as I gaze at her."
				},
				{
					"text": "Yonagi is before me, warm and real."
				},
				{
					"text": "Euphoria fills me from head to toe."
				},
				{
					"text": "I lay down on my side, rest my head on my arm, and stare at her."
				},
				{
					"text": "She's the very image of peace as she sleeps."
				},
				{
					"text": "Before long, I feel my eyelids grow heavy, and soon..."
				},
				{
					"name": "Kaito",
					"text": "Where am I?"
				},
				{
					"text": "I'm taking pictures with a small camera."
				},
				{
					"text": "It seems to work differently to the one Yonagi used."
				},
				{
					"text": "I crane my neck at my surroundings."
				},
				{
					"text": "Green thickets continue on endlessly beyond the cracked cement of the runway."
				},
				{
					"text": "Thick clouds roll across the sky. I can hear the sound of plants rustling in the wind."
				},
				{
					"text": "I recognize this place."
				},
				{
					"name": "Kaito",
					"text": "This must be Chiba in the year 2061, then."
				},
				{
					"text": "I see now."
				},
				{
					"text": "This is Momonouchi Sumomo's story. The one she wrote when we were kids."
				},
				{
					"text": "I remember what happens in this story."
				},
				{
					"text": "I also notice that I'm smaller now."
				},
				{
					"text": "It seems like my consciousness is being projected onto Amei Kanna's body."
				},
				{
					"text": "The story continues into the next day."
				},
				{
					"text": "I'm in the house's living room."
				},
				{
					"name": "Dad (???)",
					"text": "Where are you going?"
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"text": "Kanna's father..."
				},
				{
					"name": "Dad (???)",
					"text": "It's Saturday."
				},
				{
					"text": "...It's Asuma."
				},
				{
					"text": "He doesn't look like him, but the identity of Asuma is projected onto him."
				},
				{
					"text": "Perhaps it's because both Yonagi and I saw him as a paternal figure?"
				},
				{
					"name": "Kaito",
					"text": "...You'll haunt me even here?"
				},
				{
					"name": "Dad (???)",
					"text": "What?"
				},
				{
					"name": "Kaito",
					"text": "This is Yonagi's soul. You've got no right to be here. Get out!"
				},
				{
					"name": "Dad (???)",
					"text": "Kanna, what are you talking abou—"
				},
				{
					"name": "Kaito",
					"text": "You're not my damn father! Stop talking to me like that!"
				},
				{
					"name": "Kaito",
					"text": "Stop talking to me like nothing happened!"
				},
				{
					"text": "Kanna's father eyes me suspiciously."
				},
				{
					"name": "Dad (???)",
					"text": "Huh?"
				},
				{
					"name": "Kaito",
					"text": "Ah!"
				},
				{
					"name": "Izumo",
					"text": "The signal from Yonagi has dropped."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"text": "I still can't tell the difference between dream and reality."
				},
				{
					"text": "That was definitely Asuma."
				},
				{
					"name": "Izumo",
					"text": "Kaito."
				},
				{
					"name": "Kaito",
					"text": "What is it?"
				},
				{
					"name": "Izumo",
					"text": "The plan won't work in its current state."
				},
				{
					"name": "Kaito",
					"text": "What do you mean?"
				},
				{
					"text": "Izumo's steady gaze meets mine."
				},
				{
					"name": "Kaito",
					"text": "Did you figure something out?"
				},
				{
					"name": "Izumo",
					"text": "Yonagi received your sensory input successfully. Referencing it with existing data, it seems to be the first time another's sensory input has reached her."
				},
				{
					"name": "Izumo",
					"text": "There can be no doubt that she was calling for you."
				},
				{
					"name": "Izumo",
					"text": "But not the current you."
				},
				{
					"name": "Kaito",
					"text": "Excuse me?"
				},
				{
					"name": "Izumo",
					"text": "Yonagi is attempting to regain her emotions through the characters in her story. That is my assessment of the situation."
				},
				{
					"name": "Kaito",
					"text": "Right, yeah."
				},
				{
					"text": "I sit up and nod along."
				},
				{
					"name": "Kaito",
					"text": "I agree with you."
				},
				{
					"name": "Izumo",
					"text": "Your own ego is currently too strong."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"name": "Izumo",
					"text": "As you know, the characters that appear in Yonagi's world demonstrate characteristics that she—and you—subconsciously create and project onto them."
				},
				{
					"name": "Izumo",
					"text": "But if you react to them as your current self, the development of Yonagi's dream will always deviate from her desired path."
				},
				{
					"name": "Izumo",
					"text": "Just now, she rejected the sensory signals you sent in response to hers."
				},
				{
					"name": "Kaito",
					"text": "I see."
				},
				{
					"text": "Is the person I am now no longer the person Yonagi is looking for?"
				},
				{
					"text": "I berate myself with the irony. The man Yonagi is seeking would never hurl abuse at Asuma."
				},
				{
					"text": "To summarize Izumo's explanation, Yonagi and I are creating this world out of our shared awareness, each playing our own roles within it."
				},
				{
					"text": "The fact that he appears as a father figure must mean he's the closest thing to that Yonagi and I ever had."
				},
				{
					"text": "But right now I..."
				},
				{
					"text": "No matter how many times we try this, Asuma will appear as Kanna's father, and I won't be able to control my rage at him."
				},
				{
					"text": "Even if I try to suppress it, my feelings still get through to Yonagi."
				},
				{
					"text": "And my memory condition means that the anger I feel won't fade with time."
				},
				{
					"name": "Kaito",
					"text": "We'll have to take away my memory."
				},
				{
					"text": "Izumo stares at me in silence."
				},
				{
					"name": "Kaito",
					"text": "Let's remove my memory and try it again."
				},
				{
					"name": "Kaito",
					"text": "There should be a drug to induce artificial memory loss. Have it prepared."
				},
				{
					"name": "Izumo",
					"text": "Are you sure? Won't it affect you physically?"
				},
				{
					"name": "Kaito",
					"text": "I've never forgotten a thing in my life. It might be nice to try it for once."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"name": "Kaito",
					"text": "Let's try a few hours first. If it goes well, we can try a drug that'll induce amnesia for a longer time period."
				},
				{
					"name": "Izumo",
					"text": "Yes."
				},
				{
					"text": "When I stop by the kitchen on my way out, my dad's just taking a slice of toast out of the toaster."
				},
				{
					"name": "Dad (???)",
					"text": "Where are you going?"
				},
				{
					"name": "Kanna (Kaito)",
					"text": "The academy."
				},
				{
					"name": "Dad (???)",
					"text": "It's Saturday."
				},
				{
					"text": "That's when I realize I've messed up."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "Oh, right."
				},
				{
					"name": "Dad (???)",
					"text": "This isn't the first time you've make this kind of mistake. Get your head out of the clouds."
				},
				{
					"name": "Dad (???)",
					"text": "Besides, it's past 10 AM already. You wouldn't even make it in time."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "Hahah..."
				},
				{
					"text": "Laughing it off, I drop my bag, go to the fridge, and take out a milk carton to pour myself a glass."
				},
				{
					"text": "I spread peanut butter on a slice of toast and take a bite."
				},
				{
					"text": "Dad continues sipping his coffee, his attention focused on his newspaper."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "You're gonna stay home all day?"
				},
				{
					"name": "Dad (???)",
					"text": "Mhm."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "I'm heading out for a bit."
				},
				{
					"name": "Dad (???)",
					"text": "Mhm."
				},
				{
					"name": "Dad (???)",
					"text": "Hm, who could that be?"
				},
				{
					"text": "Dad gets up and goes to the door."
				},
				{
					"text": "I can't go to the garage over the weekend."
				},
				{
					"text": "I'll just have to go out and take pictures somewhere."
				},
				{
					"text": "Where should I go this time?"
				},
				{
					"text": "I ponder my options while chewing on my toast."
				},
				{
					"text": "I work through the slice bite by bite."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "..."
				},
				{
					"text": "Dad's not back yet."
				},
				{
					"text": "Who was at the door?"
				},
				{
					"text": "I pop the last bit of toast into my mouth and reach out for the glass of milk when..."
				},
				{
					"name": "Dad (???)",
					"text": "Kanna."
				},
				{
					"text": "Turning around, I see my dad walking into the living room with a young woman in tow."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "..."
				},
				{
					"text": "She has black hair just down to her shoulders. She's wearing black-rimmed glasses and a plain suit."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "..."
				},
				{
					"name": "Kanna (Kaito)",
					"text": "Yonagi..."
				},
				{
					"name": "Dad (???)",
					"text": "Kanna?"
				},
				{
					"name": "????",
					"text": "Mm?"
				},
				{
					"name": "Kaito",
					"text": "Yonagi... It's you, isn't it? Tell me... Let me hear your voice!"
				},
				{
					"name": "????",
					"text": "..."
				},
				{
					"name": "Dad (???)",
					"text": "Kanna, what in the world are you talking about?"
				},
				{
					"name": "Kaito",
					"text": "Kanna? What? I... No, I'm..."
				},
				{
					"name": "Kaito",
					"text": "...We're on the right track."
				},
				{
					"name": "Kaito",
					"text": "But amnesia-inducing drugs designed with a time limit mean I'll wake up mid-dream..."
				},
				{
					"name": "Kaito",
					"text": "I can't blame the manufacturer. They just didn't design these things to let people forget themselves within dreams."
				},
				{
					"name": "Izumo",
					"text": "Shall we try something stronger?"
				},
				{
					"name": "Kaito",
					"text": "Something stronger with no time limits. Is there a way to call off the amnesia with some kind of trigger?"
				},
				{
					"name": "Kaito",
					"text": "Something like hypnosis, where we could turn off the amnesia via a particular signal, would be perfect."
				},
				{
					"name": "Izumo",
					"text": "I will look into it."
				},
				{
					"text": "I nod and thank her."
				},
				{
					"name": "Kaito",
					"text": "Well, we can keep using our current approach for now. It doesn't seem to come with any side effects."
				},
				{
					"name": "Kaito",
					"text": "Keep looking while we're dreaming."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"name": "Izumo",
					"text": "It happened again?"
				},
				{
					"name": "Kaito",
					"text": "Yeah."
				},
				{
					"text": "She's been dreaming about Hatano Rin an awful lot as of late."
				},
				{
					"text": "But..."
				},
				{
					"text": "No matter how many times I try, she kicks me out before I can finish the dream."
				},
				{
					"name": "Kaito",
					"text": "I think I just don't hate Arishima's wife as much as Yonagi does."
				},
				{
					"name": "Kaito",
					"text": "The image projected onto her is Yonagi's mother, the woman who abandoned her and her father."
				},
				{
					"name": "Kaito",
					"text": "I can feel Yonagi's anger towards her. But I didn't know Yonagi's mother well enough to feel that same subconscious hatred."
				},
				{
					"name": "Kaito",
					"text": "Arishima's actions don't come naturally to me. It's hard for me to fit into the role."
				},
				{
					"name": "Izumo",
					"text": "I have a proposal."
				},
				{
					"name": "Kaito",
					"text": "I'm all ears."
				},
				{
					"text": "Izumo nods and begins."
				},
				{
					"name": "Izumo",
					"text": "Yonagi feels hatred for the character onto which she projects her mother. However, the image of a married couple is based off your relationship."
				},
				{
					"name": "Izumo",
					"text": "You cannot attune yourself to a person that could be unfaithful like Arishima is."
				},
				{
					"text": "I frown and nod in response."
				},
				{
					"name": "Izumo",
					"text": "I could enter the dream as a sub-avatar, to nudge you into the mentally predisposition to seek the outcome Yonagi wants."
				},
				{
					"name": "Kaito",
					"text": "A sub-avatar, huh? So that means..."
				},
				{
					"name": "Izumo",
					"text": "I will control all the characters other than yours and Yonagi's while gauging the reactions between you two."
				},
				{
					"name": "Izumo",
					"text": "The execution of the plan requires you to lose your memory every time. This means that you will be acting without awareness of the story's developments, leading to a high rate of error."
				},
				{
					"name": "Izumo",
					"text": "And as you in turn lose your memory of committing these errors, it is highly likely that you will commit the same ones repeatedly."
				},
				{
					"name": "Kaito",
					"text": "Makes sense. But with you as an observer keeping track of the errors, you could control how things proceed to some extent."
				},
				{
					"text": "Izumo nods in response."
				},
				{
					"name": "Kaito",
					"text": "Let's try that."
				},
				{
					"text": "As I exit the room we use for storage, I hear my wife climbing up the stairs."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "...What are you doing?"
				},
				{
					"text": "She regards me suspiciously."
				},
				{
					"text": "She's in a bad mood."
				},
				{
					"text": "I can tell straight away from the way she's looking at me."
				},
				{
					"name": "Arishima (Kaito)",
					"text": "You're back early."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "I have to go to Osaka tomorrow, so we wrapped up early today."
				},
				{
					"name": "Arishima (Kaito)",
					"text": "I see."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "You stink of alcohol. Were you drinking?"
				},
				{
					"name": "Arishima (Kaito)",
					"text": "Yeah."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "..."
				},
				{
					"text": "She looks down at what I'm holding."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "What's that? An anthology?"
				},
				{
					"name": "Arishima (Kaito)",
					"text": "Oh, yeah."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "..."
				},
				{
					"name": "Arishima (Kaito)",
					"text": "I just felt like reading it after seeing everyone at the memorial service."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "You still think you can write?"
				},
				{
					"name": "Arishima (Kaito)",
					"text": "No. I just wanted to read my old stuff."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "What, you wanna find out if you wrote a masterpiece that somehow went under the radar?"
				},
				{
					"name": "Arishima (Kaito)",
					"text": "I don't..."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "Say, do you know what kind of people are most confident in their writing skills?"
				},
				{
					"name": "Arishima (Kaito)",
					"text": "Uh, what?"
				},
				{
					"text": "I can only stare at her in astonishment."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "The people who have never written anything before."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "Those who have never faced their own writing feel so confident in themselves."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "That's one of thing I realized after reading thousands of manuscripts from over-enthusiastic amateurs over the years."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "While you're out drinking and sleeping your life away, writers write. They never stop. Did you know that?"
				},
				{
					"name": "Arishima (Kaito)",
					"text": "..."
				},
				{
					"text": "Of course I do."
				},
				{
					"text": "But at least I faced my own writing."
				},
				{
					"text": "At the very least, I didn't run from my own weakness."
				},
				{
					"text": "I accepted the fact I couldn't write and chose to become a teacher."
				},
				{
					"text": "I never cheated or did anything to undermine our married life either."
				},
				{
					"text": "I contribute to our joint account every month without fail."
				},
				{
					"text": "So why..."
				},
				{
					"text": "Why does she look at me with so much hatred?"
				},
				{
					"name": "Shouko (Izumo)",
					"text": "Just don't start getting any ideas. I deal with more than enough wannabe writers already."
				},
				{
					"name": "Shouko (Izumo)",
					"text": "And keep your obsession with Hatano Shuho in check. You're not a kid with his head in the clouds anymore."
				},
				{
					"name": "Arishima (Kaito)",
					"text": "I know. I don't have any more plans to write anything."
				},
				{
					"text": "She considers my words silently, then walks past me and goes to her room."
				},
				{
					"text": "I hear the door shut behind me."
				},
				{
					"name": "Arishima (Kaito)",
					"text": "..."
				},
				{
					"text": "I drop my gaze to the album and the anthology I'm holding."
				},
				{
					"text": "Inside the album, there's a photo of my wife when she was young."
				},
				{
					"text": "And beside the smiling young woman stands a young man, clearly nervous but excited."
				},
				{
					"text": "These two people no longer exist."
				},
				{
					"text": "There is no point in having this photo."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"name": "Izumo",
					"text": "That went well."
				},
				{
					"name": "Kaito",
					"text": "Ah, yeah."
				},
				{
					"text": "Izumo savaged me pretty badly back in there. I never imagined she was capable of such things."
				},
				{
					"text": "I have to wonder if that's how she really feels about me."
				},
				{
					"name": "Kaito",
					"text": "The things you said to me in the dream..."
				},
				{
					"name": "Izumo",
					"text": "Improvisations consistent with Yonagi's character summaries."
				},
				{
					"name": "Kaito",
					"text": "I see."
				},
				{
					"name": "Izumo",
					"text": "Neither of you know anything besides your loving marriage, so the actual dialogue she wrote was far too mild."
				},
				{
					"name": "Kaito",
					"text": "R-Right."
				},
				{
					"name": "Izumo",
					"text": "The fact that Shouko's depiction is so mild is proof that she was satisfied with her marriage with you. But it isn't enough to drive Arishima to Rin."
				},
				{
					"name": "Izumo",
					"text": "Shouko's lines do not represent my thoughts. Just in case that was your concern."
				},
				{
					"name": "Kaito",
					"text": "Izumo..."
				},
				{
					"text": "I gotta say... She's a consummate actress."
				},
				{
					"text": "The trial and error process with Izumo continues."
				},
				{
					"text": "And from it, we formulate a few hypotheses."
				},
				{
					"text": "My error rate is always highest at the start of the story. The number starts going down as the dream goes on."
				},
				{
					"text": "It's likely that the myriad of branching paths possible at the beginning of the story decrease as the story progresses."
				},
				{
					"name": "Kaito",
					"text": "Once, I spoke with Yonagi's three characters in a white, empty space while she was unconscious."
				},
				{
					"name": "Kaito",
					"text": "At the time I got the strong impression that they each symbolized something."
				},
				{
					"name": "Kaito",
					"text": "As if they were each facets of Yonagi that combine into her."
				},
				{
					"text": "Izumo nods."
				},
				{
					"name": "Kaito",
					"text": "As far as I can see, the further the stories progress, the more parts of her brain become active."
				},
				{
					"name": "Kaito",
					"text": "If each of these stories represent a part of her... some set of values, desires, ideals..."
				},
				{
					"name": "Izumo",
					"text": "It would be ideal if we could develop those three aspects of each story simultaneously. Or, failing that, to at least reduce the intervals between them."
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Kaito",
					"text": "Her ego may develop incompletely otherwise. We would then have no choice but to erase it and go return to square one."
				},
				{
					"name": "Kaito",
					"text": "I really want to avoid having to wipe Yonagi's ego. I'd rather wipe my own memory as many times as we need."
				},
				{
					"name": "Izumo",
					"text": "If a story has progressed more than forty percent at the moment her dreams fluctuate, I will preserve its status quo."
				},
				{
					"name": "Izumo",
					"text": "Then I can stimulate Yonagi's mind to reproduce that moment later."
				},
				{
					"text": "I nod as she speaks."
				},
				{
					"name": "Kaito",
					"text": "That should let us choose which dream to see."
				},
				{
					"name": "Izumo",
					"text": "In the latter half of the stories, there will be increased tolerance to any disruptions leaking in from your own personality."
				},
				{
					"name": "Izumo",
					"text": "It's possible that after we successfully advance all stories past their midpoint, we may not need to initialize your memory when switching dreams."
				},
				{
					"name": "Izumo",
					"text": "If the experiment proceeds that far, you would be able to choose the dream you wish to experience yourself. That would considerably shorten the time lag between the completion of each dream."
				},
				{
					"name": "Kaito",
					"text": "All right. Just one more thing, though."
				},
				{
					"name": "Kaito",
					"text": "If there are signs of Yonagi rejecting me, initialize my memory immediately."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"name": "Kaito",
					"text": "Looking at the data, fluctuations seem to be more likely to occur after progress hits the halfway point."
				},
				{
					"name": "Kaito",
					"text": "Perhaps her own brain is also trying to balance the distribution of her awakening personality."
				},
				{
					"name": "Kaito",
					"text": "Though I suppose it's natural for the body to try to heal itself."
				},
				{
					"text": "Izumo nods."
				},
				{
					"name": "Kaito",
					"text": "Okay, let's summarize our course of action."
				},
				{
					"name": "Izumo",
					"text": "Start keeping a record of Yonagi's dreams, switch between them until all three dreams progress past the forty percent mark, and initialize your memory when returning to the beginning of a dream."
				},
				{
					"name": "Izumo",
					"text": "The information that I can relay to you while in a state of total amnesia is everything below clearance level C."
				},
				{
					"name": "Kaito",
					"text": "Perfect."
				},
				{
					"text": "When the plan starts, I may forget about Yonagi and Izumo, or perhaps even the world we're from."
				},
				{
					"text": "Everything is in Izumo's hands during that time."
				},
				{
					"text": "I plan ahead for any foreseeable occurrence that could happen during the implementation of the plan and instruct her accordingly."
				},
				{
					"name": "Kaito",
					"text": "While I’m in my amnesiac state, full authority over the plan will be automatically transferred to you."
				},
				{
					"name": "Kaito",
					"text": "As well as the authority for you to initialize my memory while I'm amnesic, should the need arise."
				},
				{
					"name": "Izumo",
					"text": "When does my authority permission expire?"
				},
				{
					"name": "Kaito",
					"text": "Only when all three dreams come to an end, and I recover my memories."
				},
				{
					"name": "Kaito",
					"text": "Or if something happens that jeopardizes Yonagi's life."
				},
				{
					"name": "Kaito",
					"text": "Wake me up and return authority to me after sixty days pass."
				},
				{
					"text": "Izumo nods."
				},
				{
					"name": "Kaito",
					"text": "One more thing. Lies are permitted in under one percent of the statements you give me."
				},
				{
					"name": "Izumo",
					"text": "Why?"
				},
				{
					"name": "Kaito",
					"text": "I think..."
				},
				{
					"name": "Kaito",
					"text": "I'll probably stay sharp and wary even without my memory. It'll be insurance to keep me from making too many assumptions and trying something stupid."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"name": "Kaito",
					"text": "Our goal is to complete all three of Yonagi's dreams."
				},
				{
					"name": "Kaito",
					"text": "All the stories will come to an end when Yonagi's alter egos part ways with their loved one in the story."
				},
				{
					"name": "Kaito",
					"text": "I believe this covers all the bases, unless there's something I'm missing."
				},
				{
					"name": "Izumo",
					"text": "You have not chosen the trigger to undo your amnesia."
				},
				{
					"name": "Kaito",
					"text": "Right..."
				},
				{
					"text": "I ponder it for a good minute."
				},
				{
					"name": "Kaito",
					"text": "Yeah, I think I have it."
				},
				{
					"name": "Kaito",
					"text": "I should be the one to explain everything to myself."
				},
				{
					"name": "Kaito",
					"text": "Create a hologram using my backed up memory."
				},
				{
					"name": "Kaito",
					"text": "Then project my own memory into the virtual space and expose me to it."
				},
				{
					"name": "Kaito",
					"text": "I think that'll be the best way to go about it."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"name": "Kaito",
					"text": "Okay..."
				},
				{
					"name": "Kaito",
					"text": "We'll begin the next time Yonagi dreams. I'm counting on you."
				},
				{
					"name": "Izumo",
					"text": "I will do my utmost."
				},
				{
					"text": "I turn to face Yonagi."
				},
				{
					"text": "She's sitting on the bed, absently gazing at her feet."
				},
				{
					"name": "Kaito",
					"text": "Izumo."
				},
				{
					"name": "Izumo",
					"text": "Yes."
				},
				{
					"name": "Kaito",
					"text": "Wanna go for a walk?"
				},
				{
					"name": "Izumo",
					"text": "A walk?"
				},
				{
					"name": "Kaito",
					"text": "Can we let Wooleep look after her for a moment?"
				},
				{
					"name": "Izumo",
					"text": "I can monitor her remotely."
				},
				{
					"name": "Izumo",
					"text": "Wooleep can offer physical protection as well."
				},
				{
					"text": "I nod at her and turn back to Yonagi."
				},
				{
					"name": "Kaito",
					"text": "Yonagi, I'm gonna go stretch out my legs with Izumo for a minute."
				},
				{
					"name": "Yonagi",
					"text": "..."
				},
				{
					"text": "There's no response."
				},
				{
					"name": "Kaito",
					"text": "Wooleep, look after her."
				},
				{
					"name": "Shleep",
					"text": "*Chirp*"
				},
				{
					"name": "Kaito",
					"text": "*Sigh*"
				},
				{
					"text": "For the last two weeks, Izumo and I have been holed up in that room working out every detail of the plan."
				},
				{
					"text": "We haven't been outside in a while."
				},
				{
					"name": "Kaito",
					"text": "Wonder what I'll think of this city when I lose my memory."
				},
				{
					"name": "Izumo",
					"text": "I cannot hazard a guess."
				},
				{
					"name": "Kaito",
					"text": "If I really forget everything, will I be surprised to find out that there's a city underground?"
				},
				{
					"name": "Kaito",
					"text": "If I find out you're an android, I think my lived experiences mean it'll still make sense to me, despite not having my memory."
				},
				{
					"name": "Izumo",
					"text": "I see."
				},
				{
					"name": "Kaito",
					"text": "It's quiet down here, huh?"
				},
				{
					"name": "Izumo",
					"text": "It does appear so."
				},
				{
					"name": "Kaito",
					"text": "Ninety-five percent of the topsiders and midsiders have migrated to the virtual space, as well as seventy percent of lowsiders. They're sleeping between the top and middle side now."
				},
				{
					"name": "Kaito",
					"text": "They're simply sleeping a dreamless sleep."
				},
				{
					"name": "Izumo",
					"text": "Is that so."
				},
				{
					"text": "I gaze at the empty low side city."
				},
				{
					"text": "The market used to be a place of relaxation for the lowsiders after a hard day of work."
				},
				{
					"text": "I've walked these steps with Yonagi time and time again."
				},
				{
					"text": "As innocent children..."
				},
				{
					"text": "As young people burning with ambition..."
				},
				{
					"text": "As near-adults feeling out our roles in the world..."
				},
				{
					"text": "We walked through this town, together."
				},
				{
					"name": "Izumo",
					"text": "Kaito."
				},
				{
					"name": "Kaito",
					"text": "Yes?"
				},
				{
					"name": "Izumo",
					"text": "There is a high concentration of beta-amyloids present in Yonagi's brain. I believe you are aware of this."
				},
				{
					"name": "Kaito",
					"text": "I am."
				},
				{
					"text": "I know where she's going with this."
				},
				{
					"text": "Even if her ego is restored, her memory will crumble immediately."
				},
				{
					"text": "I know that very well."
				},
				{
					"name": "Izumo",
					"text": "Even if her ego is restored, she could forget you the same day it awakens."
				},
				{
					"name": "Izumo",
					"text": "Do you still want to do this?"
				},
				{
					"name": "Kaito",
					"text": "Why do you ask?"
				},
				{
					"name": "Izumo",
					"text": "Because it's very likely that all your efforts culminate in the same result."
				},
				{
					"name": "Kaito",
					"text": "Why didn't you say anything about this before?"
				},
				{
					"name": "Izumo",
					"text": "..."
				},
				{
					"name": "Kaito",
					"text": "And why did you feel like now was the time to bring it up?"
				},
				{
					"name": "Izumo",
					"text": "I don't know."
				},
				{
					"name": "Kaito",
					"text": "Maybe you didn't want to say this in front of Yonagi?"
				},
				{
					"text": "Izumo stares at me."
				},
				{
					"name": "Kaito",
					"text": "I'm sure that even in her condition, you regard her as a person. You wanted to avoid hurting her by saying this in front of her."
				},
				{
					"name": "Kaito",
					"text": "Just like Yonagi always saw you as family."
				},
				{
					"name": "Kaito",
					"text": "Even if she has no memory or sense of self, you still see Yonagi in her."
				},
				{
					"name": "Izumo",
					"text": "...I don't know."
				},
				{
					"name": "Kaito",
					"text": "If the plan works, even if Yonagi were to lose herself right after she comes back to us..."
				},
				{
					"name": "Kaito",
					"text": "You'd be able to welcome her home one more time."
				},
				{
					"name": "Kaito",
					"text": "Don't you think that alone is worth all this?"
				},
				{
					"name": "Izumo",
					"text": "I do."
				},
				{
					"text": "I turn to meet Izumo's steady gaze."
				},
				{
					"text": "She slowly turns away and scans the cityscape of the low side."
				},
				{
					"name": "Izumo",
					"text": "I want to see Yonagi one more time."
				},
				{
					"name": "Izumo",
					"text": "That is how I feel."
				},
				{
					"name": "Kaito",
					"text": "I know."
				},
				{
					"name": "Izumo",
					"text": "Your plan will work."
				},
				{
					"name": "Kaito",
					"text": "That means a lot coming from you."
				},
				{
					"name": "Izumo",
					"text": "We will complete it. And we will welcome her home."
				},
				{
					"name": "Kaito",
					"text": "I know."
				},
				{
					"text": "Izumo turns to face me and nods."
				},
				{
					"name": "Izumo",
					"text": "Yonagi is asleep."
				},
				{
					"name": "Kaito",
					"text": "I see."
				},
				{
					"name": "Izumo",
					"text": "Do we go back?"
				},
				{
					"text": "I take one last look at the city before nodding."
				},
				{
					"name": "Kaito",
					"text": "If everything goes well, let's meet here again, Izumo."
				},
				{
					"name": "Izumo",
					"text": "Understood."
				},
				{
					"name": "Izumo",
					"text": "I will be waiting."
				},
				{
					"name": "Kaito",
					"text": "This is goodbye. At least for a while."
				},
				{
					"name": "Izumo",
					"text": "Yes."
				},
				{
					"name": "Kaito",
					"text": "I know you can do this."
				},
				{
					"name": "Izumo",
					"text": "Kaito."
				},
				{
					"name": "Kaito",
					"text": "Mm?"
				},
				{
					"name": "Izumo",
					"text": "Bring Yonagi home, please."
				},
				{
					"name": "Kaito",
					"text": "I will."
				},
				{
					"name": "Kaito",
					"text": "No matter what, I will."
				},
				{
					"text": "I see Izumo respond with a nod out of the corner of my eye."
				},
				{
					"name": "Izumo",
					"text": "Godspeed."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "And now, here you stand."
				},
				{
					"name": "Kaito",
					"text": "Yeah."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "I hope the fact that we're talking right now means that everything went according to plan."
				},
				{
					"name": "Kaito",
					"text": "Probably. Yonagi left the institute of her own free will. I believe she must have recovered her ego."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "Do you have any idea where she might be now?"
				},
				{
					"name": "Kaito",
					"text": "You know I do."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "Heh, touche."
				},
				{
					"name": "Kaito",
					"text": "Mind if I get going? I doubt I have the time to sit around talking with my own hologram all day."
				},
				{
					"text": "My hologram cracks a small smile."
				},
				{
					"name": "Kaito (Hologram)",
					"text": "We are of the same mind."
				},
				{
					"name": "Kaito",
					"text": "..."
				},
				{
					"text": "It feels strange."
				},
				{
					"text": "The virtual space I entered probably had the information density set to maximum."
				},
				{
					"text": "Only one hour has transpired in real time."
				},
				{
					"text": "But I feel like I've been away from this lab for so long."
				},
				{
					"name": "Kaito",
					"text": "There's somewhere I need to stop by first."
				},
				{
					"text": "The low side market plaza."
				},
				{
					"text": "The greatest contributor to this plan's success is waiting there."
				},
				{
					"text": "And I'm sure she won't budge until I show up."
				},
				{
					"name": "Izumo",
					"text": "Is it you, Kaito?"
				},
				{
					"name": "Kaito",
					"text": "That's right."
				},
				{
					"text": "Izumo nods."
				},
				{
					"name": "Izumo",
					"text": "Welcome back."
				},
				{
					"name": "Kaito",
					"text": "Sorry for leaving you to fend for yourself for so long."
				},
				{
					"name": "Izumo",
					"text": "Shouldn't you go after Yonagi?"
				},
				{
					"name": "Kaito",
					"text": "Yeah, I have an idea of where she is. If she's back, there's only one place she could be. I'm going to see her now."
				},
				{
					"name": "Kaito",
					"text": "You can go and get the house ready."
				},
				{
					"name": "Kaito",
					"text": "I'm sure she'll be glad to come home to a good meal."
				},
				{
					"name": "Izumo",
					"text": "Understood. I will go home now."
				},
				{
					"name": "Izumo",
					"text": "Is it okay if the menu consists of porridge?"
				},
				{
					"text": "I look at Izumi with a smile."
				},
				{
					"name": "Kaito",
					"text": "There's nothing in the world we'd rather have."
				}
			]
		},
		{}
	]
}