{
	"scenes": [
		{},
		{},
		{
			"texts": [
				{
					"name": "Rin",
					"text": "...I'm sorry for making you come here. I just couldn't stay in that place any longer."
				},
				{
					"name": "Arishima",
					"text": "It's fine, don't worry about it."
				},
				{
					"text": "Overcome with emotion, she opened up to me in her dad's studio."
				},
				{
					"text": "While I processed it, she asked to leave the room, so we did."
				},
				{
					"text": "After that, she brought me to her apartment. It was a short walk, just like she said."
				},
				{
					"text": "The place she's living in is pretty huge."
				},
				{
					"text": "All the furniture feels really fancy."
				},
				{
					"text": "It's probably expensive."
				},
				{
					"text": "Rin sets up two teacups side by side on the table and sits facing me."
				},
				{
					"name": "Rin",
					"text": "There were talks with the publisher he was working with, and they decided to hide the true cause of death from the public."
				},
				{
					"name": "Rin",
					"text": "I heard about it from my father's personal assistant."
				},
				{
					"name": "Rin",
					"text": "If he was the kind of author who wrote decadent, literary pieces, maybe they would have made his suicide known."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Dazai Osamu, Akutagawa Ryunosuke, Kawabata Yasunari..."
				},
				{
					"text": "The list of literary masters that choose to take their lives isn't exactly short."
				},
				{
					"name": "Rin",
					"text": "The most popular of my father's works are probably the ones that end on an uplifting note."
				},
				{
					"text": "I nod."
				},
				{
					"text": "The corners of her mouth twist into a little sarcastic smile."
				},
				{
					"name": "Rin",
					"text": "It's funny, isn't it?"
				},
				{
					"name": "Arishima",
					"text": "How so?"
				},
				{
					"name": "Rin",
					"text": "Even in death, he keeps on lying to all his readers. Not that he's aware of it now."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "After that, the silence extends for a while."
				},
				{
					"text": "There's not even the ticking of a clock in this room to break the stillness."
				},
				{
					"text": "The hands of the wall clock glide across the surface soundlessly."
				},
				{
					"text": "I watch it go by for a while."
				},
				{
					"name": "Rin",
					"text": "Here..."
				},
				{
					"text": "As soon as Rin speaks, my head snaps back to her."
				},
				{
					"name": "Rin",
					"text": "I'd like you to have this."
				},
				{
					"text": "She places a key on the table."
				},
				{
					"name": "Arishima",
					"text": "...It's for the studio?"
				},
				{
					"text": "Rin nods."
				},
				{
					"name": "Rin",
					"text": "You don't have to take it, if you don't want to. I'll leave the choice up to you."
				},
				{
					"text": "I stare down at the key."
				},
				{
					"text": "It's a rectangular key with round dents along its length."
				},
				{
					"name": "Arishima",
					"text": "Uh, what do you want me to do?"
				},
				{
					"name": "Arishima",
					"text": "Is there something you want from me?"
				},
				{
					"text": "When I raise my gaze, our eyes meet."
				},
				{
					"name": "Arishima",
					"text": "You want me to learn what he was really like as person, so I can depict him properly and you can better understand him? Is that it?"
				},
				{
					"text": "Still with her eyes on me, she speaks slowly."
				},
				{
					"name": "Rin",
					"text": "I want you to save me."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "I don't want you to follow after my father's footsteps."
				},
				{
					"name": "Rin",
					"text": "Coming into contact with my father's real voice may help, and it may also help you find what it is you really need to write."
				},
				{
					"name": "Arishima",
					"text": "...And that would save you?"
				},
				{
					"name": "Rin",
					"text": "Maybe."
				},
				{
					"name": "Rin",
					"text": "If you choose a different path to the one he did, that may save me."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I ponder upon her words."
				},
				{
					"text": "Since she thinks her father and I are alike, she also thinks she can save me by intervening and preventing me from turning out like him."
				},
				{
					"text": "She sees someone close to her, on his way to ruin in her eyes, who could gain something from her actions."
				},
				{
					"text": "And that would be the salvation she's looking for?"
				},
				{
					"text": "While I think upon her words, she remains silent."
				},
				{
					"text": "She simply stares at me, almost completely still."
				},
				{
					"name": "Arishima",
					"text": "...You think too much of me. Your dad and I couldn't be more different."
				},
				{
					"name": "Arishima",
					"text": "Your dad's writing was so exceptional that he killed himself over it."
				},
				{
					"name": "Arishima",
					"text": "My words don't have that power."
				},
				{
					"name": "Arishima",
					"text": "You read them. You should know."
				},
				{
					"name": "Rin",
					"text": "And you think too little of yourself."
				},
				{
					"name": "Rin",
					"text": "Besides, weren't you the one who told me not to ignore what my heart tells me?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Anyone's writing has the power to hurt others."
				},
				{
					"name": "Rin",
					"text": "Maybe your spirit was killed off by your writing already."
				},
				{
					"name": "Arishima",
					"text": "Wha..."
				},
				{
					"text": "That expression..."
				},
				{
					"text": "That actually does sound like me, strangely enough."
				},
				{
					"name": "Arishima",
					"text": "Then that's even more proof that I can't go off like your dad."
				},
				{
					"name": "Rin",
					"text": "You can still crawl back from the edge. I'm sure you can."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Whether you revise the novel you already wrote or decide to write a completely new one, I don't think anything in that office will disturb your work."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I'd be lying if I said I'm not interested."
				},
				{
					"text": "He's the person I've been looking up to for years."
				},
				{
					"text": "The one person that embodied all of my ideals."
				},
				{
					"text": "All that creative material that always seemed wrapped up by a thick veil is there."
				},
				{
					"text": "The world at large doesn't even know his real cause of death."
				},
				{
					"text": "They believe in the lie that his editors and publishing house put out."
				},
				{
					"text": "Rin been chasing after her father for so long..."
				},
				{
					"text": "And she said that none of his books truly reflect his mind."
				},
				{
					"text": "But that mind, that particular scent of the author, is hanging over that studio."
				},
				{
					"text": "It's almost choking in its intensity."
				},
				{
					"text": "I..."
				},
				{
					"text": "Will I be consumed by it?"
				},
				{
					"text": "Will I be able to see his true self and stay as I am?"
				},
				{
					"name": "Rin",
					"text": "I'll give you the key, but it's up to you whether to use it or not."
				},
				{
					"text": "I lower my gaze to the key again."
				},
				{
					"name": "Arishima",
					"text": "Okay. I'll take it."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"name": "Arishima",
					"text": "But I won't go over there unannounced. That's a bit much."
				},
				{
					"name": "Rin",
					"text": "It doesn't matter. No one goes there anymore."
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Arishima",
					"text": "I'll let you know whenever I go in or out."
				},
				{
					"text": "I take out my smartphone."
				},
				{
					"name": "Rin",
					"text": "Wait a moment."
				},
				{
					"text": "She leaves her seat and comes back with after a moment with her own phone."
				},
				{
					"name": "Rin",
					"text": "I always leave it in my bag."
				},
				{
					"text": "I nod."
				},
				{
					"text": "We exchange contact information on a popular messaging app."
				},
				{
					"text": "\"Hello.\""
				},
				{
					"text": "I send the first message."
				},
				{
					"text": "And she responds with a \"Hi.\""
				},
				{
					"name": "Arishima",
					"text": "I'll drop by after this. Is there anything you don't want me to do that room?"
				},
				{
					"text": "She thinks for a moment."
				},
				{
					"name": "Rin",
					"text": "...There's lots of paper in there."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "I'll be careful not to start a fire."
				},
				{
					"name": "Rin",
					"text": "There's an ashtray in the kitchen. You can smoke there."
				},
				{
					"text": "I let out a dry chuckle."
				},
				{
					"text": "Looks like I'm destined to smoke in kitchens wherever I am."
				},
				{
					"name": "Arishima",
					"text": "I'll message you again when I'm leaving."
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "And then you'll... go home?"
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"text": "I think on that question for a moment."
				},
				{
					"name": "Rin",
					"text": "Oh, never mind. Forget I said that."
				},
				{
					"text": "When I nod, she smiles again."
				},
				{
					"text": "I walk from Rin's apartment back to Shuho's studio alone."
				},
				{
					"text": "What will I find there?"
				},
				{
					"text": "I remember the notebook Rin gave me."
				},
				{
					"text": "I've unleashed the same kind of unstoppable, visercal anger on the page before too."
				},
				{
					"text": "The notebook ends up torn, and the mechanical pencil used on it bent."
				},
				{
					"text": "But the anger doesn't go away; it never does."
				},
				{
					"text": "Of course it doesn't."
				},
				{
					"text": "Because the thing causing the anger is your own self."
				},
				{
					"text": "It's not the kind of anger you can quell by breaking things."
				},
				{
					"text": "But you just can't help yourself. The need to vent is too great."
				},
				{
					"text": "I've had that kind of moment before."
				},
				{
					"text": "When she handed me that notebook, it felt like I was getting my own notebook returned to me."
				},
				{
					"text": "It feels like she's seeing right through me. Seeing me for the small, pathetic man that I am."
				},
				{
					"text": "I look up and see the condominium complex ahead."
				},
				{
					"text": "Can I really face up to Hatano Shuho?"
				},
				{
					"text": "I step into the confined room once again."
				},
				{
					"text": "This is where he died, alone."
				},
				{
					"text": "Now that I'm aware of that fact, the air in this room somehow feels heavier than before."
				},
				{
					"text": "There's a thick layer of dust covering most of the stuff in it."
				},
				{
					"text": "I simply sit down on the floor in the middle of it and take it all in."
				},
				{
					"text": "I notice a pile of paper nearby and reach out to it."
				},
				{
					"text": "There are bundles of newspapers from years past."
				},
				{
					"text": "Writing left behind by the deceased."
				},
				{
					"text": "Things that weren't meant to be read by anyone."
				},
				{
					"text": "Is it morally okay for me to read them?"
				},
				{
					"text": "I still have my doubts."
				},
				{
					"text": "I can't bear the idea of someone digging up my notebooks after my death."
				},
				{
					"text": "Did he even think about that when he took his life?"
				},
				{
					"text": "What would I have done?"
				},
				{
					"text": "If I was going to die..."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "In a way, I suppose the fear of people going through my stuff or seeing what I wrote would keep me from ending my life."
				},
				{
					"text": "But perhaps a person with serious suicidal thoughts wouldn't worry about what others might see or say about him after the fact."
				},
				{
					"text": "It has nothing to do with honor. Not at all like a samurai's death by seppuku."
				},
				{
					"text": "I ponder my own death."
				},
				{
					"text": "As for where..."
				},
				{
					"text": "I can only think of my own room."
				},
				{
					"text": "That's the only place where I feel alone and at peace."
				},
				{
					"text": "If I was about to end my life, I would definitely erase all the data from my laptop."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Memories of last night come rushing in."
				},
				{
					"text": "I remember my wife's voice as I forced myself upon her."
				},
				{
					"text": "It had been well over a decade since I had any physical contact with her."
				},
				{
					"text": "Maybe even before these already yellowed old newspapers were published."
				},
				{
					"text": "What will happen to us now?"
				},
				{
					"text": "How will we keep living in that house?"
				},
				{
					"text": "Or perhaps I'm asking the wrong question. How will we part ways?"
				},
				{
					"text": "Whatever the outcome, the one thing I'm certain of is that there is no bright future ahead of me."
				},
				{
					"text": "Perhaps..."
				},
				{
					"text": "My best option is to stay here forever."
				},
				{
					"text": "I hug my knees to my chest and rest my forehead on them before closing my eyes."
				},
				{
					"text": "It's quiet in here."
				},
				{
					"text": "The air is loaded and heavy."
				},
				{
					"text": "The thick air swirls around me like the flowing water."
				},
				{
					"text": "It feels like being at the bottom of a riverbed."
				},
				{
					"text": "Not the kind that goes downstream to meet with the sea."
				},
				{
					"text": "But the bottom of a dark, cold, stale lake."
				},
				{
					"text": "Hah..."
				},
				{
					"text": "Isn't it perfect?"
				},
				{
					"text": "What else does a piece of trash like me deserve?"
				},
				{
					"text": "I see now. Rin must have known this whole time."
				},
				{
					"text": "She must have known that I needed this place."
				},
				{
					"text": "She must have realized."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "My breathing slowly evens out."
				},
				{
					"text": "I take deep, relaxed breaths."
				},
				{
					"text": "The terror I felt when I first stepped in here is gone."
				},
				{
					"text": "What was I even afraid of?"
				},
				{
					"text": "In here, I don't need to fear the outside world."
				},
				{
					"text": "I sleep a dreamless sleep."
				},
				{
					"text": "How long have I been here?"
				},
				{
					"text": "The sunlight doesn't touch this room."
				},
				{
					"text": "This might be a great place to focus entirely on one's work, but I can't forget about the world beyond."
				},
				{
					"text": "Not yet, at least."
				},
				{
					"text": "I take out my smartphone and look at the time."
				},
				{
					"name": "Arishima",
					"text": "Morning, huh?"
				},
				{
					"text": "It's about time for the first bus of the day to depart."
				},
				{
					"text": "I sigh."
				},
				{
					"text": "It's time to go to work again."
				},
				{
					"text": "I raise my weary body."
				},
				{
					"text": "After that, I send a message to Rin."
				},
				{
					"text": "\"I'm leaving the room.\""
				},
				{
					"text": "She reads it just a few seconds after I send it."
				},
				{
					"text": "\"Okay,\" she answers."
				},
				{
					"text": "Her reply is immediate."
				},
				{
					"text": "It's still about five in the morning."
				},
				{
					"text": "For a moment, I wonder if she was waiting to hear from me, but then I get over myself and drop the idea."
				},
				{
					"text": "Maybe the notification woke her up."
				},
				{
					"text": "I put away my phone without replying."
				},
				{
					"text": "The sun feels dazzling as I step outside."
				},
				{
					"text": "We're already in the middle of summer."
				},
				{
					"text": "The semester will be over soon."
				},
				{
					"text": "Step by step, I walk toward my everyday routine."
				},
				{
					"text": "What will my wife and I say to one another next time we meet?"
				},
				{
					"text": "Will I see contempt in her face, or just plain hatred?"
				},
				{
					"text": "Do I have to go back to that home knowing there is no hope?"
				},
				{
					"text": "I felt strangely at peace in Shuho's study."
				},
				{
					"text": "But even that's fading now."
				},
				{
					"text": "I take the key out of my pocket."
				},
				{
					"text": "I stare at it as it sits on the palm of my hand."
				},
				{
					"text": "What will my life become from now on?"
				},
				{
					"text": "My life..."
				},
				{
					"text": "Is it worth living, even?"
				},
				{
					"text": "I arrive home before the clock hits six."
				},
				{
					"text": "The roads are empty this early, and there weren't many people riding the first bus of the day."
				},
				{
					"text": "When I open the front door..."
				},
				{
					"text": "I see my wife's suitcase by the entrance."
				},
				{
					"text": "I look down at it for a moment."
				},
				{
					"text": "Hearing the living room door open, I raise my gaze and see my wife, her expression a mask of surprise."
				},
				{
					"name": "Shouko",
					"text": "Why are you here?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I'm a little baffled by the question."
				},
				{
					"text": "This is my house too."
				},
				{
					"name": "Shouko",
					"text": "...I thought you were sleeping in your room."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "The first thing I notice from her tone is that she's deeply fed up."
				},
				{
					"name": "Arishima",
					"text": "You're leaving?"
				},
				{
					"text": "She lets out a huge, exasperated sigh."
				},
				{
					"text": "It's half fatigue, half annoyance, and all hate."
				},
				{
					"name": "Shouko",
					"text": "I can't sleep in the same house as you anymore, can I?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I stand there at the entrance, looking dazedly in her direction."
				},
				{
					"text": "She swiftly puts on her shoes and extends the handle of the suitcase."
				},
				{
					"name": "Shouko",
					"text": "Bye."
				},
				{
					"text": "She passes by me, her stride strong and swift."
				},
				{
					"name": "Arishima",
					"text": "...Shouko."
				},
				{
					"text": "I call out to her from behind."
				},
				{
					"text": "She turns around and shoots me an icy glare, her expression nothing but open disgust."
				},
				{
					"name": "Arishima",
					"text": "...Just tell me one last thing."
				},
				{
					"name": "Shouko",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "That day when we met for the first time. Why did you decide to talk to me instead of Shuho?"
				},
				{
					"text": "She squints her eyes and looks at me suspiciously."
				},
				{
					"name": "Arishima",
					"text": "He's the one who won the award. We were at his party."
				},
				{
					"name": "Arishima",
					"text": "That's the first time you ever spoke to me."
				},
				{
					"text": "She stares at me without saying a word."
				},
				{
					"name": "Arishima",
					"text": "At least tell me that. That's all I want."
				},
				{
					"text": "She lets out a small sigh."
				},
				{
					"name": "Shouko",
					"text": "Could you quit trying to turn everything into a story?"
				},
				{
					"text": "Her eyes brim with contempt."
				},
				{
					"name": "Arishima",
					"text": "Story?"
				},
				{
					"name": "Shouko",
					"text": "Because I felt something in your writing. Something that could surpass Hatano in the future."
				},
				{
					"name": "Shouko",
					"text": "That's what you want me to say, right?"
				},
				{
					"name": "Shouko",
					"text": "You want to be the protagonist of that story, right?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I simply stare at her without answering."
				},
				{
					"name": "Shouko",
					"text": "I just didn't want to be part of the crowd swarming him that night."
				},
				{
					"text": "Her words carry a tinge of self-derision."
				},
				{
					"name": "Shouko",
					"text": "But you know how that feels as well as I do, right?"
				},
				{
					"name": "Shouko",
					"text": "I just couldn't stomach being one more face in the crowd, but it's not like I had anything exceptional in me to stand out."
				},
				{
					"name": "Shouko",
					"text": "Wasn't that the same for us both?"
				},
				{
					"text": "I'm unable to answer."
				},
				{
					"text": "A long silence falls between us."
				},
				{
					"name": "Shouko",
					"text": "I'm not a small supporting role in your life. I'm not here to liven up your background like a cute little wallflower."
				},
				{
					"name": "Arishima",
					"text": "...I know that."
				},
				{
					"name": "Shouko",
					"text": "You don't. You treat people like objects because you don't understand."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Shouko",
					"text": "You violated and trampled on me."
				},
				{
					"text": "Her tone is flat."
				},
				{
					"name": "Shouko",
					"text": "Don't you ever forget it."
				},
				{
					"name": "Shouko",
					"text": "Know that you have done the lowest thing a person could do."
				},
				{
					"name": "Shouko",
					"text": "I don't want to see your face or hear your voice ever again. Just being around you makes me feel dirty."
				},
				{
					"name": "Shouko",
					"text": "Just let me go already..."
				},
				{
					"text": "I can feel the pure, undiluted hatred in her words clawing at me."
				},
				{
					"name": "Arishima",
					"text": "...Sorry."
				},
				{
					"text": "I stare down at her feet as I say it."
				},
				{
					"text": "There's no love lost between us."
				},
				{
					"text": "And yet, I'm unable to face that deep hatred."
				},
				{
					"text": "...She's right."
				},
				{
					"text": "I forced myself on her that night because I'm weak, and I'm trash."
				},
				{
					"name": "Shouko",
					"text": "From now on, I don't want to talk to you directly."
				},
				{
					"text": "I don't look up."
				},
				{
					"name": "Shouko",
					"text": "I don't need your apologies. Your words don't mean anything to me anymore."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She turns away for the last time, and the front door closes behind her."
				},
				{
					"text": "I hear the faint sound of the suitcase wheels rolling away."
				},
				{
					"text": "Soon, not even that remains."
				},
				{
					"text": "\"Your words don't mean anything to me anymore.\""
				},
				{
					"text": "I know that those words will be the last I ever hear from her."
				},
				{
					"text": "At last, I raise my face."
				},
				{
					"text": "I can't help but smile at a sudden realization."
				},
				{
					"text": "That room..."
				},
				{
					"text": "Now I know why I felt so comfortable in Shuho's room."
				},
				{
					"text": "The air in this house is also heavy."
				},
				{
					"text": "This place is just like that studio."
				},
				{
					"text": "I'm used to this oppressive atmosphere."
				},
				{
					"text": "But it's over now."
				},
				{
					"text": "My life, that is."
				},
				{
					"text": "The married life we lived for 21 years."
				},
				{
					"text": "...I destroyed it."
				},
				{
					"text": "I turn on the extractor fan in the kitchen and take out a cig under it."
				},
				{
					"text": "I stare vacantly as the smoke I exhale is sucked into it."
				},
				{
					"text": "As I watch the swirling tendrils, I realize that I don't have to smoke in a corner like this anymore."
				},
				{
					"text": "There's no one to complain if I put out my cigs on the floor instead of in an ashtray."
				},
				{
					"text": "I'm the only one in this house now. There is no one else."
				},
				{
					"text": "It's almost unreal."
				},
				{
					"text": "25 years of ties."
				},
				{
					"text": "21 years of marriage."
				},
				{
					"text": "All over."
				},
				{
					"text": "What the hell did I... did we build in our 25 years together? What was it all for?"
				},
				{
					"text": "We didn't build anything. We just went through the motions."
				},
				{
					"text": "Get a job, get married, buy a house..."
				},
				{
					"text": "I kept on treasuring those empty moments, pretending like I was protecting something important in our lives."
				},
				{
					"text": "That was true for both me and my wife. Our time together was of no value to either of us."
				},
				{
					"text": "Why did we spend so many years faking being a family?"
				},
				{
					"text": "I've finally begun losing my connections to this world."
				},
				{
					"text": "Not just at the academy, but as a member of society as well."
				},
				{
					"text": "There's no world for disgusting old men like me out there."
				},
				{
					"text": "I keep looking up to the fan as it rotates."
				},
				{
					"text": "But despite everything, I know I'll still go to work when it's time."
				},
				{
					"text": "And I'll keep teaching those lessons no one needs."
				},
				{
					"text": "Am I keeping up appearances, or is it my work ethic?"
				},
				{
					"text": "I don't even know what's left in me anymore."
				},
				{
					"name": "Arishima",
					"text": "As such, a piece comprising mainly of waka poems is called an 'uta monogatari'..."
				},
				{
					"text": "In the end, I came here."
				},
				{
					"text": "I've never been absent from work."
				},
				{
					"text": "And I don't think it'll ever happen."
				},
				{
					"text": "I spent the last night in a place where a person died and broke up with the person I've lived with for a quarter of a century the morning after."
				},
				{
					"text": "And then, I came here to give a lecture I don't give a crap about."
				},
				{
					"text": "What the hell am I even doing here?"
				},
				{
					"text": "What am I trying to protect?"
				},
				{
					"text": "I don't know."
				},
				{
					"text": "Who am I here for?"
				},
				{
					"text": "Who even wants me to be here?"
				},
				{
					"text": "My mind is a complete mess, but I can still keep writing and spouting the usual emotionless lecture like clockwork."
				},
				{
					"text": "If I keep going through the motions, perhaps I'll end up not feeling anything."
				},
				{
					"text": "I give the students a task, sit down, and turn my gaze to Rin."
				},
				{
					"text": "As usual, she's looking out the window."
				},
				{
					"text": "Her expression seems ephemeral and lifeless, like a statue."
				},
				{
					"text": "I stare at her for a while."
				},
				{
					"text": "I know this is not her place."
				},
				{
					"text": "And chances are that she knows my place isn't here either."
				},
				{
					"text": "Yet our legs still carry us both here, where we sit and simply let time go by."
				},
				{
					"text": "We hold our breath together in the classroom, telling no one about how we met in her house yesterday."
				},
				{
					"text": "It's like we're hiding a huge secret."
				},
				{
					"text": "Infiltrating this normal world while we live in another, hidden one."
				},
				{
					"text": "I follow her gaze out the window."
				},
				{
					"text": "What is she looking at right now?"
				},
				{
					"text": "If possible..."
				},
				{
					"text": "I don't want to see the limp, pathetic thing I become in this classroom reflected in her eyes."
				},
				{
					"text": "After I'm done with lectures for the morning, I head straight to the smoking area."
				},
				{
					"text": "I don't feel like having lunch today."
				},
				{
					"text": "I just stare at the smoke rising from my cigarette."
				},
				{
					"name": "Watanabe",
					"text": "Hey there."
				},
				{
					"text": "Raising my head, I see Watanabe."
				},
				{
					"text": "He's looking down at me, a tense smile marking his face."
				},
				{
					"name": "Watanabe",
					"text": "Hey..."
				},
				{
					"text": "Watanabe's voice lowers to a whisper as he takes out a cig and lights it up."
				},
				{
					"name": "Watanabe",
					"text": "Feel like talking? Not a good moment?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I just shake my head."
				},
				{
					"name": "Arishima",
					"text": "I don't know."
				},
				{
					"name": "Watanabe",
					"text": "Geez, what's going on with your life, man?! It's like I'm watching a soap opera in real life."
				},
				{
					"name": "Arishima",
					"text": "Hahahah..."
				},
				{
					"text": "Watanabe still looks tense, and my laughter doesn't seem to help."
				},
				{
					"name": "Arishima",
					"text": "Like a soap opera, huh? Guess I chose a bad time for it, because I'm tired as hell."
				},
				{
					"name": "Watanabe",
					"text": "Seriously, what happened?"
				},
				{
					"name": "Arishima",
					"text": "...I'll tell you when things have calmed down."
				},
				{
					"name": "Watanabe",
					"text": "You sure you're okay?"
				},
				{
					"name": "Arishima",
					"text": "...Good question."
				},
				{
					"name": "Watanabe",
					"text": "At least lie and say you're fine, geez."
				},
				{
					"name": "Arishima",
					"text": "...I came to work. I'm still fine enough."
				},
				{
					"name": "Watanabe",
					"text": "Still being the operative word, huh?"
				},
				{
					"text": "I lower my gaze to the floor, fixing it on nothing in particular."
				},
				{
					"text": "We spend the rest of the time in silence, and before long lunch break is over."
				},
				{
					"text": "After I'm done with work for the day, my legs take me back to Shuho's studio."
				},
				{
					"text": "\"I'm heading to the studio again,\" I write to Rin."
				},
				{
					"text": "Again, she reads it almost immediately."
				},
				{
					"text": "\"Okay,\" she answers."
				},
				{
					"text": "I'm a little surprised by the swiftness of her response."
				},
				{
					"text": "Even when I was living with my wife, the house was always empty when I got home."
				},
				{
					"text": "I was often alone until it was time to go to bed."
				},
				{
					"text": "Her moving out won't change much."
				},
				{
					"text": "Except that now the silence in the house feels different."
				},
				{
					"text": "I thought the relationship between us was already cold and dead."
				},
				{
					"text": "But I've done nothing but think about our marriage today."
				},
				{
					"text": "Or maybe... I'm just pretending to think about it?"
				},
				{
					"text": "My thoughts feel scattered and blurry."
				},
				{
					"text": "My encounter with my wife."
				},
				{
					"text": "The encounter with Rin."
				},
				{
					"text": "My rekindled urge to create."
				},
				{
					"text": "Coming face-to-face with Shuho's death."
				},
				{
					"text": "My mind just keeps circling around the same thoughts."
				},
				{
					"text": "Before I know it, I'm already in front of the complex."
				},
				{
					"text": "I take a deep breath."
				},
				{
					"text": "The stagnant air fills my lungs."
				},
				{
					"text": "It's strangely comforting."
				},
				{
					"text": "I fee like I've adapted to this space."
				},
				{
					"text": "I'm at ease here."
				},
				{
					"text": "I feel like I can be myself."
				},
				{
					"text": "I walk to the center of the room and touch Shuho's desk."
				},
				{
					"text": "The power strip that gives power to the lamp is unplugged from the outlet."
				},
				{
					"text": "I pick it up, plug it in, and turn on the light."
				},
				{
					"text": "Warm light immediately breathes life into the room."
				},
				{
					"text": "I slowly pull out the chair and sit down."
				},
				{
					"text": "I place both hands on the desk."
				},
				{
					"text": "I can't help but laugh at myself. I'm acting like some earnest literature student visiting a museum with a reproduction of the desk used by a literary master."
				},
				{
					"text": "So this is where Shuho wrote his novels?"
				},
				{
					"text": "The laptop is connected and charged."
				},
				{
					"text": "After thinking it over for a moment, I turn it on."
				},
				{
					"text": "The screen lights up."
				},
				{
					"text": "Within seconds, I'm blocked by the login screen."
				},
				{
					"text": "Of course."
				},
				{
					"text": "Even I set a password for my laptop."
				},
				{
					"text": "I turn off the laptop."
				},
				{
					"text": "Looking back over my shoulder, I reach for one of the many notebooks stacked nearby."
				},
				{
					"text": "I recall the page spread that Rin showed me yesterday."
				},
				{
					"text": "Will this one be full of hateful writing, just like the last?"
				},
				{
					"text": "Squinting in the dim light, I open the book."
				},
				{
					"text": "Neat and proper handwriting fits in the quarter-inch space between the lines."
				},
				{
					"name": "Arishima",
					"text": "A diary?"
				},
				{
					"text": "\"Everything's wrong. Every single thing. Slowly but surely, my reality loses life, vitality.\""
				},
				{
					"text": "\"First it was the heat. The heat in my mind slowly died out.\""
				},
				{
					"text": "\"Just as a corpse cools down, my soul's heat disappeared, never to return.\""
				},
				{
					"text": "\"There's not even an ember left in me anymore.\""
				},
				{
					"text": "\"All I can do is watch as my heart slowly dies.\""
				},
				{
					"text": "\"The next thing that went was sound.\""
				},
				{
					"text": "\"And lastly, even the color left me. Everything is now a blanket of gray in my eyes.\""
				},
				{
					"text": "\"A lifeless shell of a world without warmth, sound, or color.\""
				},
				{
					"text": "\"The only thing I feel is an unquenchable thirst.\""
				},
				{
					"text": "What is this?"
				},
				{
					"text": "If I could see my face right now, I'm sure my eyes would be glimmering."
				},
				{
					"text": "I cover the smile forming at the corners of my mouth with my hand."
				},
				{
					"text": "A small, choked chuckle escapes my lips."
				},
				{
					"name": "Arishima",
					"text": "It's the same..."
				},
				{
					"text": "Who would have thought that here in this place..."
				},
				{
					"text": "I would find a soul I sympathize with from the bottom of my heart."
				},
				{
					"text": "I understand all that he writes here."
				},
				{
					"text": "The frustration, the lethargy."
				},
				{
					"text": "The despair and hopelessness that keep you paralyzed."
				},
				{
					"name": "Arishima",
					"text": "I get it, Shuho..."
				},
				{
					"text": "It was here all along."
				},
				{
					"text": "A person just like me."
				},
				{
					"text": "Would he have been able to truly understand me?"
				},
				{
					"text": "No..."
				},
				{
					"text": "I could have understood him as well."
				},
				{
					"text": "I turn the pages in a daze."
				},
				{
					"text": "It's the first time since junior high that I've been this entranced over words that haven't been typed and printed onto paper."
				},
				{
					"text": "Forgetting myself entirely, I keep reading his diary."
				},
				{
					"text": "I follow Shuho's daily life, sometimes laughing with him and sometimes frustrated by the shallow people around him."
				},
				{
					"text": "It feels like I'm working together with him as a fellow writer."
				},
				{
					"text": "I can feel the true Shuho coming through in this writing."
				},
				{
					"text": "Or rather, it's precisely because he's not trying to write anything that his being emerges from these pages."
				},
				{
					"text": "When I close the notebook and stare at the cover for a moment, my phone vibrates in my pocket."
				},
				{
					"text": "It's a message from Rin."
				},
				{
					"text": "\"Are you still in my father's studio?\" she asks."
				},
				{
					"text": "A short, to-the-point question."
				},
				{
					"text": "I think for a second then reply."
				},
				{
					"text": "\"Yes. I'm about to leave.\""
				},
				{
					"text": "It's marked as read within seconds."
				},
				{
					"text": "The message that indicates she's writing something appears."
				},
				{
					"text": "I wait for her reply."
				},
				{
					"text": "Immediately after the backlight dims, my phone vibrates again."
				},
				{
					"text": "\"Would you like to have dinner together?\" she writes."
				},
				{
					"text": "I stare at the message for a moment."
				},
				{
					"text": "I think for longer than the time it took her to reply."
				},
				{
					"text": "I want to tell Rin about what I learned of her dad today."
				},
				{
					"text": "That's what I'm here for."
				},
				{
					"text": "Us eating together won't harm or do wrong by anyone."
				},
				{
					"text": "The only people who would reproach us for spending time together are the small minded and self-righteous."
				},
				{
					"text": "\"Yeah, that'd be nice,\" I answer."
				},
				{
					"text": "I press send."
				},
				{
					"text": "She reads the message and sends an answer."
				},
				{
					"text": "\"Thank you.\""
				},
				{
					"text": "\"I'll be there in 15 minutes.\""
				},
				{
					"text": "I reply with an \"Ok\" then stow the phone back into my pocket."
				},
				{
					"text": "There are more of Shuho's diaries piled up."
				},
				{
					"text": "Maybe I should take the next one with me?"
				},
				{
					"text": "After thinking it over, I decide I shouldn't take anything that's in here outside."
				},
				{
					"text": "This is a sanctuary."
				},
				{
					"text": "If I don't read them here in this space, something will be lost."
				},
				{
					"text": "With a little reluctance, I leave the studio, and everything in it, behind."
				},
				{
					"text": "When I get off the elevator and step outside, I see Rin waiting for me by the entrance."
				},
				{
					"text": "It hasn't even been five minutes since she sent the last message."
				},
				{
					"text": "I hurry over to her."
				},
				{
					"text": "Noticing me, she bows in greeting."
				},
				{
					"name": "Arishima",
					"text": "Hey."
				},
				{
					"text": "A little unsure on how to greet her back, I default to a lame salute."
				},
				{
					"text": "But I guess it isn't that bad, judging from the way she smiles."
				},
				{
					"name": "Rin",
					"text": "Aren't you tired? You were there all night."
				},
				{
					"name": "Arishima",
					"text": "Yeah, I'm fine. I slept for a while."
				},
				{
					"text": "She seems surprised."
				},
				{
					"name": "Rin",
					"text": "In that room?"
				},
				{
					"text": "I nod sheepishly."
				},
				{
					"name": "Arishima",
					"text": "Sitting on the floor, actually."
				},
				{
					"name": "Rin",
					"text": "I see..."
				},
				{
					"name": "Arishima",
					"text": "So, where are we going? A diner would be fine by me."
				},
				{
					"name": "Rin",
					"text": "There are a few around here. We should probably go to one a little further afield, right?"
				},
				{
					"name": "Rin",
					"text": "There might be other students around here."
				},
				{
					"name": "Arishima",
					"text": "Yeah... Right."
				},
				{
					"text": "I didn't even think of that. I feel a little inadequate as I nod."
				},
				{
					"name": "Arishima",
					"text": "Let's do that."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"text": "We walk to the bus stop together."
				},
				{
					"text": "She takes me to a cafe."
				},
				{
					"text": "The place looks pretty snazzy, and most of the tables are filled with younger people."
				},
				{
					"text": "I'm the only middle-aged person."
				},
				{
					"text": "We sit facing each other at a small table."
				},
				{
					"text": "Rin orders spaghetti and I a beef curry."
				},
				{
					"text": "After the person taking our order leaves, Rin stares at me like she has something to say."
				},
				{
					"name": "Rin",
					"text": "Umm..."
				},
				{
					"name": "Arishima",
					"text": "Yeah?"
				},
				{
					"name": "Rin",
					"text": "Do you ever eat anything other than curry?"
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"text": "She looks at me, clearly curious."
				},
				{
					"name": "Rin",
					"text": "It's all I see you eating in the cafeteria."
				},
				{
					"name": "Arishima",
					"text": "Oh... I guess you're right."
				},
				{
					"text": "I let out a small laugh."
				},
				{
					"name": "Arishima",
					"text": "If there's curry on offer, that's what I tend to go for. Guess I like it well enough."
				},
				{
					"name": "Rin",
					"text": "Don't you get tired of having the same thing every day?"
				},
				{
					"name": "Arishima",
					"text": "Not really."
				},
				{
					"text": "Her eyes widen in surprise."
				},
				{
					"name": "Rin",
					"text": "You like curry that much? I did see you having soba one day, though."
				},
				{
					"name": "Arishima",
					"text": "I was nursing a hangover that day. I'd gone drinking with a colleague the night before."
				},
				{
					"name": "Rin",
					"text": "Heheh."
				},
				{
					"text": "A little laugh escapes her lips."
				},
				{
					"name": "Rin",
					"text": "So you hang out with other teachers, then?"
				},
				{
					"name": "Arishima",
					"text": "Only Watanabe. You know, from social studies."
				},
				{
					"name": "Rin",
					"text": "The young guy? You must get along well."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "He's the only one I would call a friend."
				},
				{
					"name": "Rin",
					"text": "The only one? I see."
				},
				{
					"text": "Those words seem to make her think for a moment."
				},
				{
					"name": "Rin",
					"text": "Am I maybe bothering you with this?"
				},
				{
					"text": "Rin asks as she reaches for her water glass on the table."
				},
				{
					"name": "Arishima",
					"text": "What?"
				},
				{
					"name": "Rin",
					"text": "It just occurred to me that your wife might have cooked dinner for you back home."
				},
				{
					"name": "Arishima",
					"text": "Oh..."
				},
				{
					"text": "That takes a dry chuckle out of me."
				},
				{
					"name": "Arishima",
					"text": "Don't worry. I always have dinner alone. It's no bother."
				},
				{
					"name": "Rin",
					"text": "Is that so?"
				},
				{
					"name": "Arishima",
					"text": "How about you?"
				},
				{
					"text": "She cocks her head in slight confusion."
				},
				{
					"name": "Arishima",
					"text": "You come here often?"
				},
				{
					"text": "She shakes her head."
				},
				{
					"name": "Rin",
					"text": "Sometimes, on the weekends. It's the first time I've come here in the evening though."
				},
				{
					"name": "Arishima",
					"text": "You eat out a lot?"
				},
				{
					"name": "Rin",
					"text": "I cook sometimes, but I buy takeout more often. Boxed lunches and stuff like that."
				},
				{
					"name": "Rin",
					"text": "What about you? Do you and your wife go out to eat a lot?"
				},
				{
					"text": "I see her face in my mind's eye again."
				},
				{
					"name": "Arishima",
					"text": "...I suppose. At least I do."
				},
				{
					"name": "Arishima",
					"text": "I often just grab something while I'm out and take it home. My microwave sees a lot of use."
				},
				{
					"text": "There's that look again, like she has something she wants to say."
				},
				{
					"name": "Arishima",
					"text": "What is it?"
				},
				{
					"name": "Rin",
					"text": "Oh, nothing..."
				},
				{
					"text": "Rin stares at her glass of water for a moment before speaking up."
				},
				{
					"name": "Rin",
					"text": "I was just wondering... why are you and your wife together at all?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Every time she says the word wife, it feels wrong."
				},
				{
					"text": "She's no longer my wife."
				},
				{
					"text": "We're separated in every sense of the word, except legally."
				},
				{
					"text": "And I'm sure the paperwork will reach me soon enough."
				},
				{
					"name": "Arishima",
					"text": "That's a good question."
				},
				{
					"name": "Rin",
					"text": "Um..."
				},
				{
					"text": "Rin's voice is almost a whisper."
				},
				{
					"text": "I snap back from my thoughts and turn to her."
				},
				{
					"text": "She's staring down at her glass of water again."
				},
				{
					"name": "Arishima",
					"text": "Yeah?"
				},
				{
					"name": "Rin",
					"text": "Do you have children?"
				},
				{
					"name": "Arishima",
					"text": "As in, children of my own?"
				},
				{
					"text": "Rin nods."
				},
				{
					"name": "Arishima",
					"text": "Why do you ask?"
				},
				{
					"name": "Rin",
					"text": "Uh, it's just that..."
				},
				{
					"text": "I half listen as she stumbles over her words for a while."
				},
				{
					"name": "Rin",
					"text": "I just thought that maybe you're staying together because you have children."
				},
				{
					"name": "Rin",
					"text": "I just wondered if that was the case."
				},
				{
					"name": "Arishima",
					"text": "Huh, guess that makes sense."
				},
				{
					"text": "When I say that, she turns her eyes up to me."
				},
				{
					"name": "Arishima",
					"text": "I wouldn't know. Don't have any kids."
				},
				{
					"name": "Rin",
					"text": "Oh, really?"
				},
				{
					"name": "Arishima",
					"text": "I do see how having a kid would be reason enough to make a couple stick together, at least until they're grown up."
				},
				{
					"name": "Arishima",
					"text": "I've never been in that position, though, so I wouldn't know."
				},
				{
					"name": "Arishima",
					"text": "Besides, some parents give more weight to their own situation than their kids'."
				},
				{
					"name": "Rin",
					"text": "...Right."
				},
				{
					"text": "The silence lingers for a moment before the waiter comes with our orders of beef curry for me and roe spaghetti for her."
				},
				{
					"name": "Rin",
					"text": "Shall we eat?"
				},
				{
					"text": "I nod and pick up my spoon."
				},
				{
					"name": "Rin",
					"text": "It looks delicious."
				},
				{
					"text": "Rin murmurs as she neatly wraps the spaghetti around her fork and brings it to her mouth."
				},
				{
					"text": "I do the same with my curry."
				},
				{
					"text": "It's a little spicier than what they serve at the campus cafeteria, but it goes down easy."
				},
				{
					"name": "Arishima",
					"text": "This is pretty good."
				},
				{
					"name": "Rin",
					"text": "I'm glad you like it."
				},
				{
					"text": "Rin smiles at me."
				},
				{
					"name": "Rin",
					"text": "Did you learn anything?"
				},
				{
					"text": "After eating for a while, she asks me a question."
				},
				{
					"name": "Rin",
					"text": "In the studio, I mean."
				},
				{
					"name": "Arishima",
					"text": "Yeah."
				},
				{
					"text": "I swallow and nod."
				},
				{
					"name": "Arishima",
					"text": "I did."
				},
				{
					"text": "Rin stares right at me."
				},
				{
					"name": "Arishima",
					"text": "I read your dad's diary."
				},
				{
					"name": "Rin",
					"text": "A diary? From when?"
				},
				{
					"name": "Arishima",
					"text": "The autumn of the year before he passed."
				},
				{
					"name": "Arishima",
					"text": "There was none of the erratic writing that you showed me before. Do you want to read it too?"
				},
				{
					"text": "She takes a moment, then shakes her head."
				},
				{
					"name": "Rin",
					"text": "I don't need to."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "It's strange."
				},
				{
					"name": "Arishima",
					"text": "Why not?"
				},
				{
					"text": "She raises her gaze to me again."
				},
				{
					"name": "Arishima",
					"text": "You said you wanted to know about him."
				},
				{
					"name": "Arishima",
					"text": "You're even reading his novels, right?"
				},
				{
					"name": "Arishima",
					"text": "So why don't you want to read what he wrote in his diary?"
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "I feel like you could get so much more out of reading his diary than the stuff he published."
				},
				{
					"text": "Rin stays silent for a moment."
				},
				{
					"name": "Rin",
					"text": "My father never wanted to get married."
				},
				{
					"name": "Arishima",
					"text": "Uh, really?"
				},
				{
					"text": "I repeat what she just said in my head."
				},
				{
					"name": "Arishima",
					"text": "What do you mean?"
				},
				{
					"text": "Rin slowly lowers her fork and places it back on the table."
				},
				{
					"name": "Rin",
					"text": "I've read some of what's in that room too."
				},
				{
					"name": "Rin",
					"text": "He always resented my mother. He regretted his marriage every day."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She looks down again, and her eyes wander about the table."
				},
				{
					"name": "Rin",
					"text": "I was the reason they even got married in the first place."
				},
				{
					"name": "Arishima",
					"text": "I see."
				},
				{
					"text": "So it was a one night stand accident."
				},
				{
					"text": "Things start to make sense."
				},
				{
					"text": "Maybe that's why she asked if I had any kids."
				},
				{
					"name": "Rin",
					"text": "Maybe I'm too much of a coward."
				},
				{
					"text": "Rin said the same thing at the library before."
				},
				{
					"text": "I suppose the dead can't talk back, no matter how much we might want them to."
				},
				{
					"name": "Rin",
					"text": "...I don't really have any particular attachment to my mother after she abandoned us both either."
				},
				{
					"name": "Rin",
					"text": "That's why... I don't want to read about him regretting my existence."
				},
				{
					"name": "Rin",
					"text": "My life never had any value from the outset... from before I was even born."
				},
				{
					"name": "Rin",
					"text": "Even if that's the truth, I didn't want to know about it."
				},
				{
					"name": "Arishima",
					"text": "I don't think that's quite right."
				},
				{
					"text": "She raises her face to look at me again."
				},
				{
					"text": "I notice her eyes starting to water."
				},
				{
					"text": "I return her gaze."
				},
				{
					"name": "Arishima",
					"text": "Even if your mom abandoned you, or if your dad regretted his marriage."
				},
				{
					"name": "Arishima",
					"text": "That has nothing to do with your value. Parents don't have the right to determine their child's worth. You're you, and no one can take that away."
				},
				{
					"name": "Arishima",
					"text": "No one's birth certificate comes with a price tag for their life's value. You're not worthless."
				},
				{
					"text": "She stares at me, stunned."
				},
				{
					"name": "Arishima",
					"text": "For example, I'm having a good time during dinner for the first time in months. And it's thanks to you."
				},
				{
					"name": "Arishima",
					"text": "Maybe... You are saving me far more than you think."
				},
				{
					"name": "Rin",
					"text": "You're having a good time right now?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "This is way more fun than eating dinner alone in an empty house."
				},
				{
					"text": "She lets out a little chuckle."
				},
				{
					"name": "Rin",
					"text": "We're not exactly having the most lighthearted conversation, you know?"
				},
				{
					"name": "Arishima",
					"text": "Bragging about who has the biggest misfortune can be entertaining when the company's good."
				},
				{
					"text": "She seems a little miffed at that last remark."
				},
				{
					"name": "Rin",
					"text": "I'm not bragging."
				},
				{
					"name": "Arishima",
					"text": "I know, it's just a figure of speech."
				},
				{
					"text": "She takes a deep breath and smiles."
				},
				{
					"text": "Sometimes, she looks way more mature than I give her credit for."
				},
				{
					"name": "Rin",
					"text": "Then tell me about your misfortune too. We're in good company, right?"
				},
				{
					"name": "Arishima",
					"text": "I'm a middle-aged teacher who has done nothing of worth in his life. You want me to add more stuff on top of that?"
				},
				{
					"name": "Arishima",
					"text": "I'm just as I seem. A walking billboard of misery."
				},
				{
					"name": "Rin",
					"text": "But you're here having dinner with one of your students."
				},
				{
					"name": "Rin",
					"text": "Doesn't that offset your misfortune a little?"
				},
				{
					"text": "For a moment, I see her bright rose eyes sparkle."
				},
				{
					"name": "Arishima",
					"text": "...Maybe."
				},
				{
					"name": "Arishima",
					"text": "I do feel like we have some strange connection. And I think I'm really lucky to have met someone like you by pure coincidence."
				},
				{
					"name": "Arishima",
					"text": "The conditions in which we grew up are kinda similar. I've never thought much of my father. Heck, I didn't even know what he looked like."
				},
				{
					"text": "Her eyes widen in surprise."
				},
				{
					"name": "Rin",
					"text": "Oh, really?"
				},
				{
					"name": "Arishima",
					"text": "I remember thinking what you're thinking now a lot when I was young."
				},
				{
					"name": "Rin",
					"text": "You did?"
				},
				{
					"name": "Arishima",
					"text": "I felt like I was denied value as a person for a long time."
				},
				{
					"name": "Rin",
					"text": "But because you once felt that way, your words speak to me today."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "Exactly. Life has a way of setting things right."
				},
				{
					"text": "Rin's smile looks genuinely bright for once."
				},
				{
					"name": "Rin",
					"text": "I thought we were talking about misfortune here, but you don't look unhappy at all. What happened to the billboard of misery thing?"
				},
				{
					"text": "I shake my head with a silly smirk on my face."
				},
				{
					"name": "Arishima",
					"text": "My wife left me this morning. I'm at rock bottom."
				},
				{
					"text": "The smile face slowly fades from Rin's face."
				},
				{
					"name": "Rin",
					"text": "Is that true?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Rin",
					"text": "But why?"
				},
				{
					"name": "Arishima",
					"text": "It's my fault, I suppose. Scratch the suppose. It's all on me."
				},
				{
					"text": "She stares at me in silence for a while."
				},
				{
					"name": "Arishima",
					"text": "We both deceived each other, and we never really lived as a couple during all these years."
				},
				{
					"name": "Arishima",
					"text": "All we did was pass the time pretending like we were husband and wife."
				},
				{
					"name": "Arishima",
					"text": "At least for that, I think we both share the blame."
				},
				{
					"text": "I can feel her gaze on me."
				},
				{
					"text": "I take a sip of water to try and quench my thirst a little."
				},
				{
					"name": "Arishima",
					"text": "But it's my fault in the end. I make no excuses."
				},
				{
					"text": "I see the line of her mouth turn into a frown."
				},
				{
					"name": "Rin",
					"text": "Are you sure you shouldn't go after her?"
				},
				{
					"name": "Arishima",
					"text": "Nah. Neither of us feel anything for the other at this point. There's only divorce paperwork to do now, nothing else."
				},
				{
					"text": "She looks down again and is silent for a moment."
				},
				{
					"name": "Rin",
					"text": "I'm sorry for dragging you out today of all days..."
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Arishima",
					"text": "No, you've helped me a lot. I needed it, especially today."
				},
				{
					"name": "Arishima",
					"text": "I'm sorry for bringing it up. I don't mean to make you uncomfortable."
				},
				{
					"name": "Rin",
					"text": "No, I'm glad you told me about it."
				},
				{
					"name": "Rin",
					"text": "I invited you out because I want to know more about you."
				},
				{
					"name": "Rin",
					"text": "But I had no idea..."
				},
				{
					"text": "She trails off and remains quiet for a bit."
				},
				{
					"name": "Rin",
					"text": "Was it because you stayed at my father's studio? She got mad because you didn't tell her you'd be out?"
				},
				{
					"text": "I shake my head again."
				},
				{
					"name": "Arishima",
					"text": "Don't worry, that has nothing to do with it."
				},
				{
					"text": "She looks at me, clearly anxious."
				},
				{
					"name": "Arishima",
					"text": "...Someday, if I ever feel like talking about, I may tell you."
				},
				{
					"name": "Arishima",
					"text": "I don't really feel like talking with anyone about it right now."
				},
				{
					"text": "She calmly nods."
				},
				{
					"name": "Rin",
					"text": "...I'll wait."
				},
				{
					"text": "After finishing the beef curry, I order some coffee from the waiter that comes pick up the dishes."
				},
				{
					"name": "Arishima",
					"text": "You want some too?"
				},
				{
					"text": "Still chewing on the last of her spaghetti, she nods."
				},
				{
					"text": "The waiter bows and leaves with a service smile on his face."
				},
				{
					"text": "Suddenly, a thought dawns upon me. What do we look like to the people around us?"
				},
				{
					"text": "If a man and a woman with such a clear age gap are eating together, is it reasonable to assume they're parent and child?"
				},
				{
					"text": "While I think, she's wiping her mouth with a napkin."
				},
				{
					"text": "And when she looks back up, our eyes meet."
				},
				{
					"name": "Rin",
					"text": "Yes?"
				},
				{
					"name": "Arishima",
					"text": "Uh, err..."
				},
				{
					"name": "Arishima",
					"text": "It's nothing."
				},
				{
					"text": "We leave the quaint cafe behind after drinking our coffee."
				},
				{
					"text": "I ended up paying the whole bill."
				},
				{
					"text": "Rin seemed confused by it."
				},
				{
					"text": "But I couldn't possibly let her pay."
				},
				{
					"text": "The moment we were presented with the bill, she panicked a little. It reminded me how innocent she can be sometimes."
				},
				{
					"text": "She'll be graduating college soon enough."
				},
				{
					"text": "And then she'll go out into the working world."
				},
				{
					"text": "I imagine she'll be asked out to lunch by countless men."
				},
				{
					"text": "I'm sure by that time she'll have learned how to gracefully deal with a bill like a \"proper\" lady."
				},
				{
					"text": "She'll develop that detachment to let a man pay the bill without feeling guilty, since that's what's expected of both parties."
				},
				{
					"text": "It strikes me that the Rin I'm seeing today is a very fleeting thing."
				},
				{
					"name": "Rin",
					"text": "Um, thank you for paying."
				},
				{
					"name": "Arishima",
					"text": "Don't worry about it. Any half decent chap would shoulder the bill."
				},
				{
					"name": "Rin",
					"text": "But I was the one who invited you."
				},
				{
					"name": "Arishima",
					"text": "I'm just grateful for the sentiment."
				},
				{
					"name": "Arishima",
					"text": "I had a really good time. You better invite me out again."
				},
				{
					"name": "Rin",
					"text": "Really? Can I?"
				},
				{
					"text": "I nod."
				},
				{
					"text": "Finally, a smile adorns her face again."
				},
				{
					"text": "We both walk together at a much slower pace than when we were on our way to the restaurant."
				},
				{
					"text": "The night sky is cloudy, with not a star in sight."
				},
				{
					"name": "Rin",
					"text": "...Professor?"
				},
				{
					"text": "I turn and look down at her."
				},
				{
					"name": "Rin",
					"text": "Um... Am I maybe being a burden?"
				},
				{
					"name": "Arishima",
					"text": "What?"
				},
				{
					"name": "Rin",
					"text": "I mean, you have so much going on, and I wasn't aware of any of it."
				},
				{
					"text": "She's stares down at her feet as she walks. She looks really crestfallen."
				},
				{
					"name": "Rin",
					"text": "If being in that room is hard for you, you don't need to force yourself."
				},
				{
					"name": "Rin",
					"text": "I realize that I may have been too open about myself..."
				},
				{
					"text": "I can't help but chuckle."
				},
				{
					"name": "Arishima",
					"text": "But it's not a burden, and neither are you. Actually..."
				},
				{
					"text": "I trail off and think for a moment."
				},
				{
					"name": "Arishima",
					"text": "That place is pretty comfortable. It's almost hard to believe."
				},
				{
					"text": "We walk for a while in silence after that."
				},
				{
					"name": "Rin",
					"text": "Comfortable?"
				},
				{
					"text": "When I turn to her, I see she's looking up at me."
				},
				{
					"name": "Arishima",
					"text": "Reading his diary... I somehow felt like he was writing directly to me. To the way I'm feeling right now."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "He wrote nothing about you or your mom. I got the impression it was an extremely personal diary, just so you know."
				},
				{
					"name": "Rin",
					"text": "Yes."
				},
				{
					"name": "Arishima",
					"text": "But... Hmm, yeah. I'm not gonna come here and tell you that there was nothing wrong with the man."
				},
				{
					"name": "Arishima",
					"text": "But I think he may be the one who understands me the best right now, funnily enough."
				},
				{
					"name": "Arishima",
					"text": "I feel that same anxiety and frustration like a haze in my head too... It felt like he was putting to paper exactly the way I feel."
				},
				{
					"name": "Arishima",
					"text": "So it's not a burden, really. I'm actually thankful to you for letting me be there."
				},
				{
					"name": "Rin",
					"text": "I see."
				},
				{
					"name": "Rin",
					"text": "That's... good."
				},
				{
					"text": "Her voice lowers to almost a whisper."
				},
				{
					"name": "Arishima",
					"text": "I'll walk you home."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"text": "We walk through the night together."
				},
				{
					"text": "I take frequent glances at the sky, but the clouds never clear up."
				},
				{
					"text": "I can see the yellowy glow of the moon around the edges of a particularly thick cloud."
				},
				{
					"text": "When we arrive at her apartment building, I look back at her."
				},
				{
					"name": "Arishima",
					"text": "So, uh, see you in class tomorrow."
				},
				{
					"name": "Rin",
					"text": "Yes."
				},
				{
					"name": "Arishima",
					"text": "I had a good time."
				},
				{
					"name": "Rin",
					"text": "Me too."
				},
				{
					"name": "Arishima",
					"text": "Well, goodnight."
				},
				{
					"name": "Rin",
					"text": "Professor?"
				},
				{
					"name": "Arishima",
					"text": "Hm?"
				},
				{
					"text": "She slowly looks up at me."
				},
				{
					"name": "Rin",
					"text": "What you're reading..."
				},
				{
					"name": "Rin",
					"text": "...was written by someone who lost sight of all paths other than taking his own life."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "There's a distance between us."
				},
				{
					"text": "Rin sets her gaze in that space."
				},
				{
					"text": "I'm looking straight at her."
				},
				{
					"text": "But she keeps her head down, not meeting my eyes."
				},
				{
					"name": "Rin",
					"text": "Please, don't ever forget that."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "The street lights are distant."
				},
				{
					"text": "The moon is obscured."
				},
				{
					"text": "And yet, I can somehow see her face perfectly. Her features are as clear as day."
				},
				{
					"text": "It's like she's glowing with a light of her own amid a sea of dark."
				},
				{
					"name": "Rin",
					"text": "You're not reading it because you're headed toward death like he was."
				},
				{
					"name": "Rin",
					"text": "You're facing death to come back to reality. Even if you need to crawl your way back on your hands and knees."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Now she's meeting my gaze straight on."
				},
				{
					"text": "I feel like I'm getting lost in the brilliance of those rose-colored eyes."
				},
				{
					"name": "Rin",
					"text": "Good night. See you tomorrow."
				},
				{
					"name": "Arishima",
					"text": "Yeah."
				},
				{
					"text": "She turns around and walks into the building without looking back."
				},
				{
					"text": "I stare after her for a while."
				},
				{
					"text": "I think upon her words as I make my way home."
				},
				{
					"text": "The memoirs of a person who lost sight of all paths but death..."
				},
				{
					"text": "Those words resound in my mind."
				},
				{
					"text": "But..."
				},
				{
					"text": "In the end, isn't death the final destination for any human who ever lives?"
				},
				{
					"text": "Old and tired themes race around inside my head."
				},
				{
					"text": "How should we live? How should we die?"
				},
				{
					"text": "It's true that Shuho chose death in the end."
				},
				{
					"text": "He actively rushed towards it."
				},
				{
					"text": "But was it really because he lost sight of the alternative?"
				},
				{
					"text": "No one can know."
				},
				{
					"text": "Before I know it, I'm back home."
				},
				{
					"text": "In the mailbox, I find a letter from a law firm."
				},
				{
					"text": "I heave a sigh."
				},
				{
					"text": "A conversation with a dead and lifeless Shuho."
				},
				{
					"text": "A meal with the young Rin."
				},
				{
					"text": "Each seem like a contract between life and death."
				},
				{
					"text": "Both encounters had the same timeless, almost magical feel. As if destiny was speaking right into my ear."
				},
				{
					"text": "It's almost like I'm living another life."
				},
				{
					"text": "But as soon as I step into the house, I'm suddenly pulled back into that pool of misery I've been swimming in for years."
				},
				{
					"text": "I wearily open the envelope."
				},
				{
					"text": "It contains a list of things to settle for the divorce."
				},
				{
					"text": "First and foremost is what to do with the house."
				},
				{
					"text": "Will one of us end up owning it, or will it be sold and the money distributed among us."
				},
				{
					"text": "...It's all bullshit."
				},
				{
					"text": "I don't feel anything for this house."
				},
				{
					"text": "I'll give it to her if that's what she wants."
				},
				{
					"text": "Then she can bring that lover of hers over and they can have their fun without worrying about what anyone might say."
				},
				{
					"text": "I'll lose what I've deposited, but that doesn't mean I'll be hurting for money."
				},
				{
					"text": "I don't really care if I'm living alone."
				},
				{
					"text": "The letter states that my replies must be in writing, via email or letter."
				},
				{
					"text": "Another sigh escapes my mouth."
				},
				{
					"text": "I want to get this over with as soon as possible."
				},
				{
					"text": "At the very least, I have the right to do whatever I want with my time."
				},
				{
					"text": "If I leave it all to the lawyers..."
				},
				{
					"text": "I'll sign whatever they need, so long as they leave me be."
				},
				{
					"text": "I decide to answer that way."
				},
				{
					"text": "The lawyer can take care of this absolute pain of a situation. I just don't want to have anything to do with it."
				},
				{
					"text": "Putting the stuff from the law firm aside, I check the other envelopes."
				},
				{
					"text": "There are some for my wife, but most of it is just junk mail."
				},
				{
					"text": "I gather them all together and throw them into the garbage."
				},
				{
					"text": "There is one question that hasn't left my head today."
				},
				{
					"text": "What am I living for anymore?"
				},
				{
					"text": "What am I trying to protect?"
				},
				{
					"text": "I actually felt alive when I was with Rin, but all it takes is stepping into this place for my spirit to slowly degrade back to its miserable state."
				},
				{
					"text": "I keep repeating the same question to myself, knowing I have no answer."
				},
				{
					"text": "So far I've just gone with the flow..."
				},
				{
					"text": "But I can't think of any other reason than apathy."
				},
				{
					"text": "Nothing would be different in the world if I wasn't in it."
				},
				{
					"text": "Forget the world; even here in this classroom, nothing would change."
				},
				{
					"text": "All I do is regurgitate grammar rules like a machine."
				},
				{
					"text": "I'm merely a spectator as my body teaches out of muscle memory."
				},
				{
					"text": "And I'm fed up."
				},
				{
					"text": "I don't want to keep spouting words that won't reach a soul."
				},
				{
					"text": "As Shuho said..."
				},
				{
					"text": "I've lost something that cannot be recovered."
				},
				{
					"text": "By simply scraping by for so many years..."
				},
				{
					"text": "I'm losing whatever it was that I should have expressed in writing all these years."
				},
				{
					"text": "I am well aware of this."
				},
				{
					"text": "Shuho is the one who showed me."
				},
				{
					"text": "I can't go back to it."
				},
				{
					"text": "Those days when I could simply continue to exist as an incompetent teacher reciting the same lines year after year..."
				},
				{
					"text": "I don't want to go back to that."
				},
				{
					"text": "That soulless version of myself..."
				},
				{
					"text": "I don't want to let Rin see me like that ever again."
				},
				{
					"text": "I can't even look Rin's way anymore."
				},
				{
					"text": "After work's done, I go straight back to the studio."
				},
				{
					"text": "Going home or to the library is no longer an option."
				},
				{
					"text": "I'm desperate to get back to the studio as soon as possible."
				},
				{
					"text": "\"I'm on my way,\" I write."
				},
				{
					"text": "I press the send button."
				},
				{
					"text": "When I arrive in front of the building, I take out my phone again."
				},
				{
					"text": "My message has been read, but Rin hasn't responded."
				},
				{
					"text": "I wait there for a while, staring at the screen."
				},
				{
					"text": "\"I'm here, can I go in?\""
				},
				{
					"text": "She reads the message, and her reply comes a moment later."
				},
				{
					"text": "\"Sorry for the late reply. Go ahead,\" she responds."
				},
				{
					"text": "After reading her answer, I step inside."
				},
				{
					"text": "I sit at Shuho's desk and continue where I left off yesterday."
				},
				{
					"text": "I'm sure Shuho would understand the turmoil I'm feeling."
				},
				{
					"text": "Yeah, just like I thought."
				},
				{
					"text": "He was thinking the same things."
				},
				{
					"text": "The words I'm looking for are right here."
				},
				{
					"text": "\"Only I'm aware of this emptiness that every day brings.\""
				},
				{
					"text": "\"No one around me realizes.\""
				},
				{
					"text": "\"The way they all ignore the context is almost frightening.\""
				},
				{
					"text": "\"If there's anything I've learned from selling books, it's that.\""
				},
				{
					"text": "\"The world is full of more blind people than I ever thought.\""
				},
				{
					"name": "Arishima",
					"text": "Hahahah."
				},
				{
					"text": "It's thrilling."
				},
				{
					"text": "This is what he was thinking about?"
				},
				{
					"text": "\"Writing books that anyone can understand is a good way to make dumb money. They fly off the shelves; I would know.\""
				},
				{
					"text": "\"And then there's the blind fools who fashion themselves as critics and lambaste your work with the smuggest of grins and not an ounce of self-awareness.\""
				},
				{
					"text": "\"The kind of amateur that thinks the length of their criticisms are directly proportional to the quality of their arguments.\""
				},
				{
					"text": "\"All they know how to do is leech off the work of other people and reap the benefits like a swarm of parasites.\""
				},
				{
					"text": "\"It's so appallingly shameless that I'm almost impressed.\""
				},
				{
					"text": "\"Why don't they realize people don't have time for their long-winded drivel?\""
				},
				{
					"text": "\"How is it possible to write such garbage and sleep well at night?\"."
				},
				{
					"text": "\"Why, they never even dare to spout their garbage to my face.\""
				},
				{
					"name": "Arishima",
					"text": "They annoy me to no end. They're the scum of the earth."
				},
				{
					"text": "I keep turning the pages."
				},
				{
					"text": "His raw thoughts and complaints continue."
				},
				{
					"text": "\"Stop it. You think I don't torture myself enough for my writing?\""
				},
				{
					"text": "\"None of you will ever know the despair of printing three million copies of garbage prose.\""
				},
				{
					"text": "\"I'm as mad at the people around me who would greenlight such trash as I am at myself for writing it.\""
				},
				{
					"text": "\"That's why I keep rewriting it.\""
				},
				{
					"name": "Arishima",
					"text": "Oh?"
				},
				{
					"text": "So that's the real reason behind the revisions that earned him the moniker of \"vintner.\""
				},
				{
					"text": "I keep turning the pages."
				},
				{
					"text": "This exceeds whatever excitement I might have felt reading any of his novels."
				},
				{
					"text": "\"I'll never forget the panic on their faces.\""
				},
				{
					"text": "\"The moment I did all those revisions and prohibited them from putting the old versions on the shelves.\""
				},
				{
					"text": "\"One after the other, they came to try and persuade me.\""
				},
				{
					"text": "\"All of them blue in the face from repeating themselves.\""
				},
				{
					"text": "\"For a while after that, all the publishers were scared.\""
				},
				{
					"name": "Arishima",
					"text": "He's like a stubborn kid."
				},
				{
					"text": "The corners of my mouth twitch into a smile."
				},
				{
					"text": "I can't bring myself to hate on that earnest impulsiveness."
				},
				{
					"text": "\"But after a while, they got used to even that.\""
				},
				{
					"text": "\"This is it. I see it now.\""
				},
				{
					"text": "\"Human beings are made to conform to being unhappy.\""
				},
				{
					"text": "\"At some point, I became hopelessly numb to my own lack of happiness\"."
				},
				{
					"text": "\"What's at the end of that road for us?\""
				},
				{
					"text": "\"The more we live, the more we become one with misery?\""
				},
				{
					"text": "\"The longer we remain in this mortal coil, the more misery seeps into our souls.\""
				},
				{
					"text": "\"Isn't that a more absolute suffering than even death?\""
				},
				{
					"text": "\"Knowing all living things are headed this way, is there any meaning?\""
				},
				{
					"text": "\"Is there a meaning to life itself?\""
				},
				{
					"text": "\"Is there anything that matters?\""
				},
				{
					"text": "\"I know the answer.\""
				},
				{
					"text": "\"No, there's not.\""
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "The writing doesn't hide his altered state of mind."
				},
				{
					"text": "He wrote that last part many times, but each iteration looks more erratic and error-filled."
				},
				{
					"text": "This is all of him."
				},
				{
					"text": "Shuho..."
				},
				{
					"text": "This is what he should have shown to the public."
				},
				{
					"text": "He should have abandoned his pride and laid down all that weakness and anger for everyone to see."
				},
				{
					"text": "Maybe if he'd admitted to himself the damage being inflicted upon him by the thoughtless criticism of those who didn't even understand his struggle."
				},
				{
					"text": "Maybe he wouldn't have lied his way to the grave."
				},
				{
					"text": "If the world had known this Shuho, maybe they wouldn't have driven him off that cliff."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "The next page was written on the following day."
				},
				{
					"text": "\"I changed the bindings of all my works.\""
				},
				{
					"text": "\"But there was one I had to keep the same.\""
				},
				{
					"text": "\"My debut work.\""
				},
				{
					"name": "Arishima",
					"text": "Sakuragicho?"
				},
				{
					"text": "\"I used to go to Yokohama a lot back in my college days.\""
				},
				{
					"text": "\"When you leave Takadanobaba in the afternoon, the sun is beginning to set by the time you reach Route 1.\""
				},
				{
					"text": "\"By the time you make it to Sakuragicho it's already night, so it feels like you stepped into a whole other country.\""
				},
				{
					"text": "\"When I gazed out at the cityscape by night, feeling tired from the travel and excited to be there, I truly felt like I wanted to be someone.\""
				},
				{
					"text": "\"To be famous enough that I couldn't walk around the city, not even with all the money in the world. That's the place where I decided I'd get everything anyone ever wants.\""
				},
				{
					"text": "\"I had no doubt in my mind that I had the talent and capabilities to make it happen.\""
				},
				{
					"text": "\"But I was wrong. How wrong I was.\""
				},
				{
					"text": "\"I wasn't shallow enough to just enjoy the throne once I sat upon it... Not by a long shot.\""
				},
				{
					"text": "\"I was wrong about everything.\""
				},
				{
					"text": "\"That was not what I truly wanted. I wasn't in another country, I just crossed into another prefecture.\""
				},
				{
					"text": "\"That's where all my mistakes began.\""
				},
				{
					"text": "\"I've always harbored the thought that maybe I could go back there and start over.\""
				},
				{
					"text": "\"That place, that view... For me, it's like a monument.\""
				},
				{
					"name": "Arishima",
					"text": "A monument? A monument to his regret?"
				},
				{
					"text": "I find myself smiling."
				},
				{
					"text": "It's just a coincidence, but it goes to show how small the world is."
				},
				{
					"text": "The Sakuragicho observatory."
				},
				{
					"text": "I've got memories from that place as well."
				},
				{
					"text": "Back when Shouko and I were still dating, that was the first place we visited together as a couple. Before that we had only met for lunch."
				},
				{
					"text": "That very same Sakuragicho."
				},
				{
					"text": "Now, I could say that place is a monument to my regret as well."
				},
				{
					"text": "We might have more in common than I ever thought."
				},
				{
					"text": "I turn the next page and see his writing has turned manic again."
				},
				{
					"text": "It seems like he had days where he enjoyed creating trouble for those around him just for the heck of it."
				},
				{
					"text": "In that sense..."
				},
				{
					"text": "Shuho wasn't ignorant of social norms; he just enjoyed breaking the mold, to what I'm sure was the dismay of his publishing company."
				},
				{
					"text": "He never hesitated to do what he wanted."
				},
				{
					"text": "It almost seems like he feared being thought of as ordinary."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "As I lose myself in reading and forget the time, my phone vibrates."
				},
				{
					"text": "It's a message from Rin."
				},
				{
					"text": "\"Sorry for messaging so much,\" she says."
				},
				{
					"text": "\"Perhaps we could meet today?\""
				},
				{
					"text": "Maybe she's still worried about me."
				},
				{
					"text": "\"I'd love to,\" I respond."
				},
				{
					"text": "I press the send button."
				},
				{
					"text": "She reads it right away."
				},
				{
					"text": "This time she answers immediately."
				},
				{
					"text": "\"If it's okay, I'd like to cook today.\""
				},
				{
					"name": "Arishima",
					"text": "She wants to cook?"
				},
				{
					"text": "In her apartment?"
				},
				{
					"text": "I wonder how to respond."
				},
				{
					"text": "\"I'll be waiting in the same spot as yesterday.\""
				},
				{
					"text": "\"I'll be there in 15 minutes.\""
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I think back on yesterday."
				},
				{
					"text": "Her saying she'll be there in fifteen minutes probably means she's already there."
				},
				{
					"text": "\"Got it,\" I respond."
				},
				{
					"text": "I send the message then stand up."
				},
				{
					"text": "Just as I predicted, she's already by the entrance not even ten minutes later."
				},
				{
					"text": "When I walk up to her, she greets me with a slight bow."
				},
				{
					"name": "Rin",
					"text": "Hello."
				},
				{
					"name": "Arishima",
					"text": "Hey."
				},
				{
					"text": "As usual, she's holding her bag with both hands."
				},
				{
					"name": "Arishima",
					"text": "So we're going grocery shopping now?"
				},
				{
					"name": "Rin",
					"text": "No, I bought all the ingredients yesterday."
				},
				{
					"text": "I look down at her as we walk side by side."
				},
				{
					"name": "Arishima",
					"text": "Yesterday?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Arishima",
					"text": "You went out again?"
				},
				{
					"name": "Rin",
					"text": "I ordered it all using the online supermarket app."
				},
				{
					"name": "Arishima",
					"text": "Huh..."
				},
				{
					"name": "Rin",
					"text": "It's convenient. They deliver everything to your door."
				},
				{
					"name": "Arishima",
					"text": "I would have gone to the store with you if you told me."
				},
				{
					"name": "Rin",
					"text": "Then you would have paid like yesterday, right?"
				},
				{
					"text": "She says before glancing up at me and giggling."
				},
				{
					"text": "I just sigh and shake my head."
				},
				{
					"name": "Arishima",
					"text": "Let me settle the bill later."
				},
				{
					"name": "Arishima",
					"text": "I can't just let you pay. I'm the one with a job."
				},
				{
					"name": "Rin",
					"text": "I thought you didn't care much for being a people person, or following social norms."
				},
				{
					"text": "Rin's tone is playful and cheery."
				},
				{
					"text": "I heave a sigh."
				},
				{
					"name": "Arishima",
					"text": "Okay, I'll let you treat me today. But next time you're gonna tell me in advance."
				},
				{
					"name": "Arishima",
					"text": "I'm not broke or anything."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"name": "Rin",
					"text": "Next time, I'll let you treat me instead."
				},
				{
					"text": "It's my second time at Rin's place."
				},
				{
					"text": "It's as neat and tidy as I remember it."
				},
				{
					"text": "Though there doesn't seem to be much in this house to make a mess out of in the first place."
				},
				{
					"name": "Rin",
					"text": "Wait just a moment. It won't take long."
				},
				{
					"name": "Arishima",
					"text": "Sure, thanks."
				},
				{
					"text": "..."
				},
				{
					"text": "Rin goes to the kitchen."
				},
				{
					"text": "I can see her at the kitchen counter from my spot in the living room."
				},
				{
					"text": "She's washing her hands."
				},
				{
					"name": "Arishima",
					"text": "Did your dad have a room in this house?"
				},
				{
					"name": "Rin",
					"text": "Kind of. He rarely ever used it."
				},
				{
					"name": "Rin",
					"text": "He pretty much lived in his studio."
				},
				{
					"name": "Arishima",
					"text": "I see."
				},
				{
					"name": "Rin",
					"text": "There's my room, his old room, and a room for the books."
				},
				{
					"name": "Arishima",
					"text": "So three rooms besides the living room."
				},
				{
					"text": "Pretty spacious place."
				},
				{
					"text": "I'd wager there's not a lot of people Rin's age living in a place like this on their own."
				},
				{
					"name": "Rin",
					"text": "It won't be long, okay? You can go look for a book if you want to read."
				},
				{
					"name": "Arishima",
					"text": "Nah, I'm fine. I can help you cook if you want."
				},
				{
					"name": "Rin",
					"text": "It's okay. It's nothing complicated."
				},
				{
					"text": "She takes out meat and vegetables from the fridge."
				},
				{
					"name": "Rin",
					"text": "Just sit back and relax. Would you like something to drink? I bought some drinks, just in case."
				},
				{
					"name": "Arishima",
					"text": "Don't worry. I'll just wait."
				},
				{
					"text": "And so, I sit down at the table and wait."
				},
				{
					"text": "I notice a book sitting on the table, on the side where Rin usually sits."
				},
				{
					"name": "Arishima",
					"text": "You were reading Akutagawa?"
				},
				{
					"text": "She half turns my way and glances at the table."
				},
				{
					"name": "Rin",
					"text": "After reading the author you recommended, I was in the mood for reading older stuff."
				},
				{
					"name": "Arishima",
					"text": "Oh, that's good."
				},
				{
					"text": "I pick up the book and flip through the pages."
				},
				{
					"name": "Arishima",
					"text": "Did you know that Akutagawa Ryunosuke went to Shiga Naoya for guidance?"
				},
				{
					"text": "She turns to me and gives me a thoughtful look."
				},
				{
					"name": "Rin",
					"text": "Really?"
				},
				{
					"text": "Keeping my eyes on the book, I nod."
				},
				{
					"name": "Arishima",
					"text": "The story goes that Akutagawa felt he hit a wall when he turned thirty after becoming famous in this twenties. He also got sick around that time."
				},
				{
					"name": "Arishima",
					"text": "The two of them were ten years apart, actually. And there was a period where Shiga stopped writing novels."
				},
				{
					"name": "Arishima",
					"text": "The so-called god of the novel had a period of three years where he didn't write a thing. The story says that Akutagawa went to him around that time."
				},
				{
					"name": "Arishima",
					"text": "Both of them were authors who showed their true value in short projects rather than long, winding ones."
				},
				{
					"text": "Rin interjects with nods as I talk."
				},
				{
					"name": "Arishima",
					"text": "And when the two of them met, Akutagawa told Shiga that he didn't see himself as a novelist, and that he couldn't write."
				},
				{
					"name": "Rin",
					"text": "He did that?"
				},
				{
					"name": "Arishima",
					"text": "Perhaps he was able to be that honest because he felt they were in the same situation. Kindred spirits and all that."
				},
				{
					"name": "Arishima",
					"text": "Funny, isn't it? I mean, if Akutagawa can't write, then who in the world can?"
				},
				{
					"name": "Rin",
					"text": "Yeah."
				},
				{
					"name": "Arishima",
					"text": "But it goes to show just how serious the roadblock was in his mind."
				},
				{
					"text": "...And Akutagawa Ryunosuke also killed himself in the end."
				},
				{
					"text": "I flip through the pages."
				},
				{
					"text": "I find a bookmark on the last page of \"Rashomon.\""
				},
				{
					"name": "Arishima",
					"text": "You read Rashomon?"
				},
				{
					"name": "Rin",
					"text": "Yes. Many times, in fact. Somehow I keep coming back to it."
				},
				{
					"name": "Arishima",
					"text": "I know the feeling."
				},
				{
					"text": "I go to the first page of the short story."
				},
				{
					"name": "Arishima",
					"text": "\"He had little choice of means, whether fair or foul, because of his helpless circumstances.\""
				},
				{
					"name": "Arishima",
					"text": "...You could say this was the plea of Akutagawa himself."
				},
				{
					"name": "Rin",
					"text": "Professor, why do you teach classical literature?"
				},
				{
					"text": "I raise my eyes from the pages and look back at her in the kitchen."
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"name": "Rin",
					"text": "You prefer modern literature, as far as I can tell."
				},
				{
					"text": "I feel a bitter smile spreading on my face."
				},
				{
					"name": "Arishima",
					"text": "Doing what you love for a living isn't always the best choice."
				},
				{
					"name": "Arishima",
					"text": "Many writers have shown us that."
				},
				{
					"name": "Arishima",
					"text": "...Including your dad."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "Rin gives a slight nod and carries on preparing the meal."
				},
				{
					"text": "I continue reading Rashomon with the clinking of utensils against pots in the background."
				},
				{
					"name": "Rin",
					"text": "I hope it's to your liking."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She lays the table with large, black porcelain plates."
				},
				{
					"text": "The comparatively small portions of food in each of them add to the luxurious air of the whole arrangement."
				},
				{
					"text": "This must have cost her an arm and a leg."
				},
				{
					"name": "Rin",
					"text": "It's a duck and watercress stew. And..."
				},
				{
					"text": "And in front of me, she places a huge wine glass."
				},
				{
					"text": "It's the kind of glass designed to let you enjoy the bouquet of the expensive red wine while you drink it."
				},
				{
					"text": "Definitely not the kind of thing you expect a student living alone to own."
				},
				{
					"name": "Arishima",
					"text": "How did you buy all this?"
				},
				{
					"name": "Rin",
					"text": "Huh?"
				},
				{
					"text": "I place a finger on the rim of the wine glass."
				},
				{
					"name": "Arishima",
					"text": "You can't just buy this on your own, right?"
				},
				{
					"name": "Rin",
					"text": "Really? I don't really drink."
				},
				{
					"name": "Arishima",
					"text": "They make you verify your age. I know you're 20, but they still tend to at least ask when it's younger people."
				},
				{
					"name": "Rin",
					"text": "I didn't know. I just bought it with my father's personal business card."
				},
				{
					"name": "Arishima",
					"text": "What? Like a company credit card?"
				},
				{
					"text": "She answers with a reticent nod."
				},
				{
					"text": "She looks like a little girl who can't comprehend the reason behind an adult's anger."
				},
				{
					"name": "Rin",
					"text": "Um, you talked about going out drinking with a coworker yesterday, so..."
				},
				{
					"name": "Rin",
					"text": "I thought that maybe you'd like this."
				},
				{
					"text": "I let out one tired sigh."
				},
				{
					"text": "So that's it."
				},
				{
					"text": "This is where the difference in upbringing comes in."
				},
				{
					"name": "Rin",
					"text": "Are you angry at me?"
				},
				{
					"name": "Arishima",
					"text": "No."
				},
				{
					"text": "I shake my head firmly."
				},
				{
					"name": "Arishima",
					"text": "I have no intention of preaching to you."
				},
				{
					"text": "This is HER apartment, I remind myself."
				},
				{
					"text": "It's strange for me to even be here in the first place."
				},
				{
					"name": "Arishima",
					"text": "It's just that..."
				},
				{
					"text": "I look over the fancy dishes lined up on the table."
				},
				{
					"text": "In a sense, these gorgeously decorated and succulent looking dishes say a lot about what her normal standard is."
				},
				{
					"name": "Arishima",
					"text": "I think spending money like this to treat people isn't gonna do you much good in the long run."
				},
				{
					"name": "Rin",
					"text": "I see."
				},
				{
					"name": "Arishima",
					"text": "It's been 20 years since I started earning my own money, and I don't think I've bought anything as expensive as this wine for myself."
				},
				{
					"name": "Arishima",
					"text": "Have you ever earned your own money?"
				},
				{
					"text": "With her gaze fixed on the table, she shakes her head."
				},
				{
					"name": "Arishima",
					"text": "Then you're not treating me here. Rather, I feel like Hatano Shuho's the one inviting me for dinner."
				},
				{
					"name": "Arishima",
					"text": "That's probably not what you want, is it?"
				},
				{
					"text": "She looks up at me, then down again, and nods."
				},
				{
					"name": "Arishima",
					"text": "I know you made this with the best intentions, so I'm sorry for making you feel bad over trying to do something nice."
				},
				{
					"name": "Arishima",
					"text": "...Also, let me pay for the costs. I wanna pay."
				},
				{
					"name": "Rin",
					"text": "...I'm so sorry."
				},
				{
					"name": "Arishima",
					"text": "Come on, look at me."
				},
				{
					"name": "Arishima",
					"text": "I really appreciate the sentiment."
				},
				{
					"name": "Arishima",
					"text": "It just doesn't have to be this fancy. Remember today and one day, when you're making your own money, you can try treating me again."
				},
				{
					"name": "Arishima",
					"text": "Hell, it doesn't even have to be me. I'm sure you'll truly understand how nice it feels to treat someone with the fruits of your efforts by then."
				},
				{
					"text": "She nods in silence."
				},
				{
					"name": "Arishima",
					"text": "How about we set the wine aside for tonight?"
				},
				{
					"name": "Rin",
					"text": "...Okay."
				},
				{
					"text": "Everything tastes great."
				},
				{
					"text": "The professional look of the food actually matches the quality, as far as I can tell."
				},
				{
					"text": "Then again, it's my first time eating duck and watercress hot pot, so maybe I'm not such a good judge."
				},
				{
					"text": "But I can say the flavor is miles more sophisticated than whatever I had with Watanabe in that cramped bar."
				},
				{
					"text": "I wonder about the recipe..."
				},
				{
					"text": "And I feel a pang of pain in my heart imagining Rin carefully choosing this dish from her repertoire and painstakingly selecting each ingredient just for me."
				},
				{
					"text": "Maybe I should have swallowed my pride and accepted her good will without complaint."
				},
				{
					"text": "I glance at her and see her still looking down, looking heartbroken as she slowly carries the food to her mouth with the chopsticks. I'm such a piece of trash."
				},
				{
					"text": "If I were a better man, I could have gotten my message across without hurting her like this."
				},
				{
					"text": "We go on eating, an awkward silence hanging heavy between us."
				},
				{
					"name": "Arishima",
					"text": "Thank you. That was delicious."
				},
				{
					"name": "Rin",
					"text": "Really?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "It was so good I almost couldn't believe it, really."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "Let me help you wash the dishes."
				},
				{
					"name": "Rin",
					"text": "No, please. If I let you do that after all this, I think I'll feel so upset I'll cry."
				},
				{
					"name": "Arishima",
					"text": "I really didn't mean to..."
				},
				{
					"name": "Rin",
					"text": "But you're right. I wouldn't be able to live in a house like this on my own merits."
				},
				{
					"name": "Rin",
					"text": "I wouldn't even be able to go to the same academy. I couldn't afford the private tuition."
				},
				{
					"name": "Arishima",
					"text": "You don't need to blame yourself like that. I'd say you have a very rough time without any of your parents around."
				},
				{
					"name": "Rin",
					"text": "I told you that I feel like there isn't really a place for me here, but now I realize that I still can't do anything without relying on it."
				},
				{
					"name": "Rin",
					"text": "It makes me feel so sad."
				},
				{
					"name": "Arishima",
					"text": "All of your classmates are pampered by their parents, even if they don't realize it. Even I was that way. It's not bad to be supported by your parents."
				},
				{
					"name": "Arishima",
					"text": "It's something we all go through. You had to grow up fast because of your circumstances, but it's not fair to be so harsh on yourself. Don't worry so much."
				},
				{
					"name": "Rin",
					"text": "I feel like you see me as a kid."
				},
				{
					"name": "Arishima",
					"text": "Me?"
				},
				{
					"text": "She upturns her eyes at me and nods."
				},
				{
					"name": "Arishima",
					"text": "Hahah..."
				},
				{
					"text": "When I'm unable to hold back the laughter, she glances up at me, an indignant look tensing her muscles."
				},
				{
					"name": "Rin",
					"text": "Why are you laughing?!"
				},
				{
					"name": "Arishima",
					"text": "Oh, sorry. It's just that, well, considering how far apart we are in age, I thought that was a given."
				},
				{
					"name": "Arishima",
					"text": "Besides, we're teacher and student too."
				},
				{
					"name": "Rin",
					"text": "That doesn't matter."
				},
				{
					"name": "Rin",
					"text": "If we're just supposed to be teacher and student, then it's strange for you to be here, don't you think?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I think I dug my own grave here, big time."
				},
				{
					"text": "She's absolutely right."
				},
				{
					"text": "It's awfully funny for Rin to be the one lecturing me in this situation."
				},
				{
					"name": "Arishima",
					"text": "Hah, guess I'm a joke of a social outcast. It's just as you say, I suppose. We're all mad here."
				},
				{
					"name": "Arishima",
					"text": "No need to take it that seriously."
				},
				{
					"name": "Rin",
					"text": "No! That's not what I'm trying to say."
				},
				{
					"name": "Rin",
					"text": "But, I..."
				},
				{
					"text": "Rin wavers for a second then swallows her words."
				},
				{
					"text": "I stand up and take my bag."
				},
				{
					"text": "She watches me anxiously."
				},
				{
					"name": "Arishima",
					"text": "Let me pay before I forget. And let's try to not dwell on what happened tonight, okay?"
				},
				{
					"name": "Arishima",
					"text": "I'll pay for the ingredients and that's that. We'll leave this behind us."
				},
				{
					"name": "Arishima",
					"text": "If you think you learned something from today and it helps you improve, nothing would make this old outcast happier."
				},
				{
					"name": "Rin",
					"text": "Yes."
				},
				{
					"text": "Rin shows me the details of the purchase on the screen of her phone."
				},
				{
					"text": "I mentally gulp upon seeing it."
				},
				{
					"text": "Back when I was a student, I could have gotten by for a whole month with this kind of money."
				},
				{
					"text": "And probably more than half of the total went on the wine alone."
				},
				{
					"text": "It leaves my wallet in a precarious state, but I manage to pay up."
				},
				{
					"text": "It's not even an amount of money I'd normally carry with me."
				},
				{
					"text": "In a sense, I guess I was lucky. It would have been really lame to not be able to pay after all that."
				},
				{
					"text": "I hand the money over as casually as possible so she doesn't realize how I'm kicking myself on the inside."
				},
				{
					"name": "Rin",
					"text": "I'm really sorry for having you pay like this."
				},
				{
					"name": "Arishima",
					"text": "It's okay. We're all square now."
				},
				{
					"name": "Arishima",
					"text": "I'm repeating myself, but I am gainfully employed, you know. Spending this amount isn't gonna affect me. Don't overthink it."
				},
				{
					"name": "Rin",
					"text": "...Thanks for the meal."
				},
				{
					"name": "Arishima",
					"text": "No, I wanna thank you. It was really delicious."
				},
				{
					"text": "I put my much lighter wallet back in my bag."
				},
				{
					"name": "Rin",
					"text": "Can I serve you some tea? Would you drink it?"
				},
				{
					"name": "Rin",
					"text": "Though I didn't buy this with my own money either..."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "I'll have some, thanks."
				},
				{
					"text": "After taking my time to enjoy the tea, I get ready to go home."
				},
				{
					"text": "Rin never seemed to regain her pep in the end."
				},
				{
					"name": "Rin",
					"text": "I'm really..."
				},
				{
					"name": "Arishima",
					"text": "No more apologies, okay? You didn't do anything wrong."
				},
				{
					"name": "Arishima",
					"text": "Actually, I'm sorry for souring the mood. I hope you can forgive me."
				},
				{
					"text": "She shakes her head."
				},
				{
					"name": "Arishima",
					"text": "...Good night."
				},
				{
					"name": "Rin",
					"text": "Yes. See you tomorrow."
				},
				{
					"name": "Arishima",
					"text": "Tomorrow?"
				},
				{
					"name": "Rin",
					"text": "At the academy."
				},
				{
					"name": "Arishima",
					"text": "Oh, yeah."
				},
				{
					"text": "I answer with a nod."
				},
				{
					"text": "Yeah."
				},
				{
					"text": "I'll see her again tomorrow."
				},
				{
					"text": "In that classroom."
				},
				{
					"name": "Arishima",
					"text": "See you tomorrow."
				},
				{
					"name": "Rin",
					"text": "*Sigh*"
				},
				{
					"text": "That was so pathetic, I almost broke into tears on the spot."
				},
				{
					"text": "It was so embarrassing."
				},
				{
					"text": "I didn't even know what to say."
				},
				{
					"text": "I couldn't reply to anything."
				},
				{
					"text": "It was so frustrating."
				},
				{
					"text": "I'm so mortified and embarrassed."
				},
				{
					"text": "The last thing I wanted to show him was a childish blunder like that."
				},
				{
					"text": "I go back to the living room and sit at the table."
				},
				{
					"text": "I'm sure the first thing he felt when he stepped into this house was Hatano Shuho's shadow."
				},
				{
					"text": "And maybe that's something he didn't want to see."
				},
				{
					"text": "It was so insensitive of me."
				},
				{
					"text": "And I was acting so confident..."
				},
				{
					"text": "Talking like I know everything..."
				},
				{
					"text": "But he still managed to uncover all of that and put the kiddie hat firmly back on my head."
				},
				{
					"text": "I feel so restless."
				},
				{
					"text": "I can't figure out what my heart is telling me."
				},
				{
					"text": "I've never felt this way before."
				},
				{
					"text": "Oh, I see."
				},
				{
					"text": "This is the first time anyone has ever gotten angry at me."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "If I had a father and a mother..."
				},
				{
					"text": "Do people living under the same roof get mad at each other like this? And they keep on living together?"
				},
				{
					"text": "Maybe I'm the one that's not normal?"
				},
				{
					"text": "I don't know."
				},
				{
					"text": "I can't figure it out, and I doubt I'll learn much from reading Hatano Shuho's books."
				},
				{
					"text": "In front of me, resting on the table..."
				},
				{
					"text": "There's the collection of stories by Akutagawa Ryunosuke."
				},
				{
					"text": "I open the little paperback."
				},
				{
					"text": "I go to the opening page of Rashomon. Rereading it has become somewhat of an habit of mine."
				},
				{
					"text": "\"Because of his helpless circumstances...\""
				},
				{
					"name": "Rin",
					"text": "'Little choice of means, whether fair or foul,' huh?"
				},
				{
					"text": "After that dinner with Rin, I find it hard to take my mind off her."
				},
				{
					"text": "I keep wondering whether I took the right attitude today."
				},
				{
					"text": "She looked so down the whole night."
				},
				{
					"text": "This is the second time she's gotten emotional in front of me."
				},
				{
					"text": "The first time was when we went into Shuho's studio."
				},
				{
					"text": "She cried that day."
				},
				{
					"text": "She asked me to save her, choking back tears as her voice lowered to a murmur."
				},
				{
					"text": "The memory is still fresh in my mind."
				},
				{
					"text": "Today..."
				},
				{
					"text": "The situation was completely different. It wasn't that serious to begin with."
				},
				{
					"text": "Children who feel rejected by their parents but are still unable to live without their support are often overcome by feelings of powerlessness."
				},
				{
					"text": "It's a tale as old as time."
				},
				{
					"text": "But is it really of the same magnitude as the absolute shock and devastation she must have felt finding her father dead in a bathtub?"
				},
				{
					"text": "Despite everything, she took what happened today in stride. In her own way."
				},
				{
					"text": "It just seems like the fact that the evening went so differently to how she envisioned it made her really embarrassed and upset."
				},
				{
					"text": "Her sadness that day was caused by Shuho, and in a sense, I'm the one who caused it today."
				},
				{
					"text": "That thought..."
				},
				{
					"text": "Makes me strangely happy."
				},
				{
					"text": "My words are touching her heart."
				},
				{
					"text": "That fact makes me happy."
				},
				{
					"text": "Back home, I find another letter from my wife's lawyer waiting for me."
				},
				{
					"text": "It's about some documents that need my signature."
				},
				{
					"text": "Some kind of declaration of consent."
				},
				{
					"text": "Something about me accepting the conditions they declare."
				},
				{
					"text": "I'm completely sick of it."
				},
				{
					"text": "My time with Rin..."
				},
				{
					"text": "And my time in Shuho's studio..."
				},
				{
					"text": "Both seem to rejuvenate my heart."
				},
				{
					"text": "I feel closer to death than ever with Shuho, and I have never felt more alive than when I'm with Rin."
				},
				{
					"text": "The sharp contrast between them only highlights them more starkly within my mind."
				},
				{
					"text": "I feel like I'm somehow being honed by the two of them, making me sharper, more sensitive to what I'm feeling and my surroundings."
				},
				{
					"text": "And this house just tries to dull that edge."
				},
				{
					"text": "Everything in this house clings to me, slows me down to a crawl."
				},
				{
					"text": "It's so awful I can barely stand it."
				},
				{
					"text": "But..."
				},
				{
					"text": "But I'm sure that when morning comes, I'll buckle down and sign this paper."
				},
				{
					"text": "Then I'll carefully put it in the return envelope and send it away."
				},
				{
					"text": "Then I'll change into a fresh set of clothes and go to work."
				},
				{
					"text": "In a shirt I washed and ironed myself."
				},
				{
					"text": "Although no one is forcing me to do it, I'll change into the clothes that make me that gainfully employed adult I told Rin about and go to work."
				},
				{
					"text": "I won't feel alive like I do when I talk with Rin in her apartment."
				},
				{
					"text": "I'll just spend another day in vain."
				},
				{
					"text": "That's what I'm going to work for."
				},
				{
					"text": "But then, why am I even doing it? What am I trying to protect?"
				},
				{
					"text": "I have no compromises to anyone but myself, so why am I going back to that miserable and colorless existence?"
				},
				{
					"text": "I'm teaching Rin's class today."
				},
				{
					"text": "When I'm here, my words can't reach her."
				},
				{
					"text": "No, that's not quite right."
				},
				{
					"text": "The words coming out of my mouth in this classroom aren't my own."
				},
				{
					"text": "Even if they literally come out of me, they won't ever reach her, not really."
				},
				{
					"text": "And I realize that I'm starting to hate it."
				},
				{
					"text": "I really don't want Rin to see this side of me."
				},
				{
					"text": "That whole thing about changing myself, that I would even be able to..."
				},
				{
					"text": "I'm beginning to think it's possible, or at least I want it to be."
				},
				{
					"name": "Watanabe",
					"text": "Phew, the week's finally over."
				},
				{
					"text": "It's lunch break."
				},
				{
					"text": "As usual, I'm smoking with Watanabe."
				},
				{
					"text": "I shift my eyes from the slowly rising smoke and turn to him."
				},
				{
					"name": "Arishima",
					"text": "No lectures this afternoon?"
				},
				{
					"name": "Watanabe",
					"text": "Nah. We've covered everything that'll be on the exams, now it's up to them to revise it."
				},
				{
					"name": "Arishima",
					"text": "I see."
				},
				{
					"name": "Watanabe",
					"text": "It's almost time, eh?"
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"name": "Watanabe",
					"text": "For summer break."
				},
				{
					"name": "Arishima",
					"text": "Oh, yeah."
				},
				{
					"text": "The end-of-term ceremony is almost upon us."
				},
				{
					"name": "Watanabe",
					"text": "You going anywhere?"
				},
				{
					"name": "Arishima",
					"text": "Nah. Don't really have any plans."
				},
				{
					"name": "Watanabe",
					"text": "What? It's a month and a half! You're just gonna laze around?"
				},
				{
					"name": "Watanabe",
					"text": "Oh, I get it. Guess you'll be fine as long as you can spend the day in a bookstore, right?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I guess that was the case until last year."
				},
				{
					"text": "I did seem to spend most of my summer break in libraries."
				},
				{
					"text": "I didn't have any work to do, and my wife wasn't home most of the time."
				},
				{
					"text": "I just read books at my own leisure, and before I even knew it, the second semester would have already started."
				},
				{
					"text": "But I wonder about this year."
				},
				{
					"text": "I'm planning to keep reading what Shuho left behind, but maybe Rin will be away for a while."
				},
				{
					"text": "I remember that she came to the wake for her dad's teacher."
				},
				{
					"text": "It's possible she has other family events to attend."
				},
				{
					"text": "If we get the chance to talk again, I'll ask about her plans for this summer."
				},
				{
					"name": "Watanabe",
					"text": "I'll get you a souvenir."
				},
				{
					"name": "Arishima",
					"text": "What?"
				},
				{
					"name": "Watanabe",
					"text": "I'm telling you I'm going on a trip. To Yakushima."
				},
				{
					"name": "Arishima",
					"text": "Oh? Who with?"
				},
				{
					"name": "Watanabe",
					"text": "Were you not listening to anything I said just now?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I exhale some smoke and nod."
				},
				{
					"name": "Watanabe",
					"text": "Why do you even bother lying?!"
				},
				{
					"text": "When I leave work for the day, I get in contact with Rin."
				},
				{
					"text": "I see the conversation from yesterday on the upper part of the screen."
				},
				{
					"text": "I think about the dinner she prepared so carefully for me, and I ruined."
				},
				{
					"text": "For there to be a next time, I'll probably have to be the one inviting her out."
				},
				{
					"text": "But maybe it's too soon after yesterday?"
				},
				{
					"text": "While I'm thinking, a reply from her comes in."
				},
				{
					"text": "It's just the usual \"okay.\""
				},
				{
					"text": "I keep floundering on whether to ask about her plans for tonight, and even write a draft, but I end up not sending anything."
				},
				{
					"text": "I step into the room again and take a deep breath."
				},
				{
					"text": "The oppressive, stagnant air fills my lungs."
				},
				{
					"text": "This place makes me feel at ease."
				},
				{
					"text": "When I'm here, I'm free from the shackles of the world outside."
				},
				{
					"text": "I don't have appearances to keep up. I don't have to pretend like I care about my work."
				},
				{
					"text": "I remember my dinner with Rin."
				},
				{
					"text": "Now that I think about it, neither she nor her mother appear anywhere in these diaries."
				},
				{
					"text": "I've read months' worth of entries at this point."
				},
				{
					"text": "And not a single page mentions Rin, even in passing."
				},
				{
					"text": "I feel my eyes getting tired and look away from the pages."
				},
				{
					"text": "I take my phone out of my pocket."
				},
				{
					"text": "it's around 8 p.m."
				},
				{
					"text": "The last two days, Rin invited me out around this hour."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I wonder if I've fractured our relationship with my criticism yesterday."
				},
				{
					"text": "I stare at the static screen for a while, then stow it back into my pocket and continue reading the diaries."
				},
				{
					"text": "But soon my eyes are glazing over and nothing sticks with me."
				},
				{
					"text": "I keep pulling out my phone and opening up my chat with Rin."
				},
				{
					"text": "She hasn't sent anything."
				},
				{
					"text": "\"I'll go home for today.\""
				},
				{
					"text": "I send her a message as I lock the door on my way out."
				},
				{
					"text": "She replies straight away."
				},
				{
					"text": "\"Good job.\""
				},
				{
					"text": "That's all."
				},
				{
					"text": "The silence at home is becoming more and more agonizing."
				},
				{
					"text": "I stare down at the lunch box I got from the convenience store."
				},
				{
					"text": "It feels so strange."
				},
				{
					"text": "This is how I've had dinner for most of my marriage."
				},
				{
					"text": "Alone in the living room, eating with a spoon in one hand and a book in the other."
				},
				{
					"text": "The day my wife left this house was the first day I shared a meal with Rin."
				},
				{
					"text": "It's only happened twice."
				},
				{
					"text": "We've only eaten together those two times."
				},
				{
					"text": "Yet losing that is making me feel so, well, lost."
				},
				{
					"text": "It's making me feel more lonely than my wife's departure did."
				},
				{
					"text": "I've been alone for the last 20 years, yet it's like I'm only starting to feel it now."
				},
				{
					"text": "I keep wondering how Rin's day is going."
				},
				{
					"text": "Do her thoughts keep turning to yesterday like mine do?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I start hating myself, as usual."
				},
				{
					"text": "These worries I'm having are more like what someone Rin's age might have."
				},
				{
					"text": "I look around the living room."
				},
				{
					"text": "Digging in my heels and trying to argue would be a pain."
				},
				{
					"text": "Besides, I can't deny that I'm in the wrong."
				},
				{
					"text": "This place will probably not be my home for much longer."
				},
				{
					"text": "I no longer have any appearances to keep up."
				},
				{
					"text": "If I prefer spending time with Rin to eating alone, all I have to do is invite her out."
				},
				{
					"text": "So what if I'm the teacher and she the student?"
				},
				{
					"text": "That's just one aspect of the positions we happen to be in right now. A label that doesn't have anything to do with us as individuals."
				},
				{
					"text": "I'm sure Rin must be thinking the same way. She wanted to spend time with me, after all."
				},
				{
					"text": "It's Friday."
				},
				{
					"text": "Tomorrow, I can spend the whole day at Shuho's studio."
				},
				{
					"text": "And then I'll invite Rin out to dinner."
				},
				{
					"text": "As soon as I leave home, I drop her a message letting her know I'm heading to the studio."
				},
				{
					"text": "But I receive no response from her."
				},
				{
					"text": "When I reach the apartment complex, I slow down my pace."
				},
				{
					"text": "I decide not to go in until she gives me permission."
				},
				{
					"text": "I feel like it's important to keep at least that boundary."
				},
				{
					"text": "I check my phone."
				},
				{
					"text": "She hasn't even read the message yet."
				},
				{
					"text": "I lean on a wall by the entrance and wait for a while."
				},
				{
					"text": "\"I'm here.\""
				},
				{
					"text": "Twenty minutes have passed since I sent that last message."
				},
				{
					"text": "She still hasn't read it."
				},
				{
					"text": "Residents of the building come and go in front of me."
				},
				{
					"text": "I'm going to draw attention to myself if I keep hanging around here."
				},
				{
					"text": "It's not like I'm doing anything wrong, but I decide to go somewhere else while I await her response."
				},
				{
					"text": "After a short walk, I find a diner."
				},
				{
					"text": "There are a few families waiting to be seated by the entrance, but I get to go in first since there's a table for two free."
				},
				{
					"text": "I get myself some coffee from the free refill machine and take a look around the place before sitting down."
				},
				{
					"text": "It's all families enjoying the weekend as far as the eye can see."
				},
				{
					"text": "I wonder what it means to be a dad."
				},
				{
					"text": "The thought just pops into my head."
				},
				{
					"text": "I feel like all the men sitting here with their families must have the answer to that question."
				},
				{
					"text": "They all look younger than me."
				},
				{
					"text": "About the same age as Watanabe, I'd say."
				},
				{
					"text": "But they undoubtedly have that air of fatherhood about them."
				},
				{
					"text": "I wonder at what point a father gets that fatherly look."
				},
				{
					"text": "It's not like men go through the physical ordeal that women undergo to give birth."
				},
				{
					"text": "If you spend every day with your child, does that naturally make you a father, in time?"
				},
				{
					"text": "I look at the families enjoying themselves and realize that I'll probably never have a weekend like this in my life, considering my future prospects."
				},
				{
					"text": "I turn my attention to my phone and press the power button to light up the screen."
				},
				{
					"text": "There are no new messages."
				},
				{
					"text": "She hasn't even read them."
				},
				{
					"text": "This is the first time I've gone so long without an answer from her."
				},
				{
					"text": "What is Rin doing right now?"
				},
				{
					"text": "The smoke from the mini grill billows up into my face."
				},
				{
					"text": "Is it ready?"
				},
				{
					"text": "I cut the sausage in half and spear each piece with a toothpick, just like they showed me."
				},
				{
					"text": "I carefully serve them up on one of the small plastic plates I was told to use."
				},
				{
					"text": "I raise my face from the plate and look ahead."
				},
				{
					"text": "I'm behind a food counter in the supermarket."
				},
				{
					"text": "Everyone's walking by slowly, looking at the food on offer."
				},
				{
					"text": "I take a deep breath."
				},
				{
					"name": "Rin",
					"text": "Welcome..."
				},
				{
					"name": "Rin",
					"text": "Would you like a sample?"
				},
				{
					"text": "My timid words disappear into the bustle of the store."
				},
				{
					"name": "Rin",
					"text": "Welcome..."
				},
				{
					"text": "No one stops to look."
				},
				{
					"text": "I feel so hopeless."
				},
				{
					"text": "The sausages I cooked are going cold."
				},
				{
					"name": "Manager",
					"text": "You need to be louder."
				},
				{
					"text": "I look back and see the nice man who showed me the ropes of the job this morning."
				},
				{
					"text": "I got so spooked I almost missed what he said entirely."
				},
				{
					"name": "Rin",
					"text": "I'm sorry..."
				},
				{
					"name": "Manager",
					"text": "You'll get used to it. Everyone's shy at first."
				},
				{
					"name": "Manager",
					"text": "You don't remember the clerks when you're the customer, do you? Don't worry, no one's judging you here. They just come to buy food."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "After saying that, the man walks onto the sales floor shouting \"welcome\" really loudly."
				},
				{
					"text": "He's shouting, but no one reacts to him."
				},
				{
					"text": "I see. Right now I'm just part of the furniture."
				},
				{
					"text": "My voice is like the background music of the supermarket."
				},
				{
					"text": "I take another deep breath."
				},
				{
					"name": "Rin",
					"text": "Welcome! This is a special sampling campaign! Feel free to help yourself!"
				},
				{
					"name": "Rin",
					"text": "Welcome! They're fresh and hot! Come and get yours!"
				},
				{
					"name": "Old lady",
					"text": "Oh, can I try some?"
				},
				{
					"text": "I don't even see the old lady who's walked up in front of me until she's already there."
				},
				{
					"text": "I find it curious that she asks if she can have some when she's already grabbed a sausage."
				},
				{
					"name": "Rin",
					"text": "Yes! Go ahead!"
				},
				{
					"name": "Old lady",
					"text": "Thank you, sweetie. Don't mind if I do."
				},
				{
					"text": "She pops a sausage in her mouth, throws the plastic plate in the trash, and leaves."
				},
				{
					"name": "Rin",
					"text": "Welcome! We're holding a sampling campaign! Feel free to try some!"
				},
				{
					"text": "When I raise my voice..."
				},
				{
					"name": "Rin",
					"text": "Ah, go ahead!"
				},
				{
					"text": "A balding old man approaches and takes a sample."
				},
				{
					"text": "He's wearing a jacket with an unusual amount of pockets."
				},
				{
					"text": "I wonder if he uses all of those."
				},
				{
					"text": "While I wonder about his jacket, he takes a sausage and eats it."
				},
				{
					"name": "Bald old guy",
					"text": "This is pretty good."
				},
				{
					"name": "Rin",
					"text": "Thank you!"
				},
				{
					"text": "I made a sale!"
				},
				{
					"text": "The man who just sampled the sausages purchased some."
				},
				{
					"text": "I'm actually doing my job now."
				},
				{
					"text": "I watch him walk away, then keep going renewed resolve."
				},
				{
					"name": "Rin",
					"text": "Welcome!"
				},
				{
					"text": "I open the next bag of sausages while I shout, cut them up, and begin cooking them up on the mini grill."
				},
				{
					"text": "By the time the sun sets, I still haven't received a reply from Rin."
				},
				{
					"text": "I finished reading the book I thankfully thought to bring with me."
				},
				{
					"text": "It's a little past 6 p.m."
				},
				{
					"text": "I put down my collection of Akutagawa's short stories and take a look around the diner again."
				},
				{
					"text": "The customers are different, but what hasn't changed is the happy and cheerful bustle of families having a good time together. I feel completely removed from it all."
				},
				{
					"text": "If I lose Shuho's studio..."
				},
				{
					"text": "Will the rest of the world become this unfamiliar and uncomfortable for me?"
				},
				{
					"text": "How on earth did I manage to live until today?"
				},
				{
					"text": "How did I keep myself sane?"
				},
				{
					"text": "Perhaps just having a family, even if was the faint illusion of one..."
				},
				{
					"text": "Perhaps that's what kept me stable all these years."
				},
				{
					"text": "But all of that is gone now."
				},
				{
					"text": "Without contact with Rin and access to that room, it's like I'm not connected to anything in the whole world."
				},
				{
					"text": "I let out a small, inaudible sigh as I leave my seat."
				},
				{
					"text": "Even when the sun goes down, it's still hot and humid outside."
				},
				{
					"text": "Feeling a little silly for not having dinner while I was at the diner, I sigh. As I walk, I feel my phone vibrate in my pocket."
				},
				{
					"text": "I stop, take it out, and stare at the screen."
				},
				{
					"text": "It's a message from Rin."
				},
				{
					"text": "\"Are you free tonight?\""
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I simply stare at the message for a moment."
				},
				{
					"text": "My heart starts beating a little faster."
				},
				{
					"text": "It's kind of sad and funny that such a simple message can make me react like this."
				},
				{
					"text": "I feel so pathetic for clinging to Rin like this."
				},
				{
					"text": "But the excitement is so great I can't contain it."
				},
				{
					"text": "\"I do, let's have dinner together,\" I write."
				},
				{
					"text": "And I press the send button."
				},
				{
					"text": "The message is marked as read as soon as I send it."
				},
				{
					"text": "It takes another moment for her to respond."
				},
				{
					"text": "\"I'll be waiting at the usual spot.\""
				},
				{
					"text": "And below her message, there's an image of a little bird dressed up as a Daruma doll."
				},
				{
					"text": "A Java sparrow?"
				},
				{
					"text": "Did Rin send this?"
				},
				{
					"text": "Does it mean she's in a good mood?"
				},
				{
					"text": "I stow the phone back in my pocket and rush to the usual spot."
				},
				{
					"text": "I go at a light jog, and find her standing like always, holding a shopping bag with both hands."
				},
				{
					"text": "She's holding a supermarket bag instead of her usual bag."
				},
				{
					"text": "When she sees me, she looks surprised."
				},
				{
					"name": "Rin",
					"text": "Huh? You weren't in the studio?"
				},
				{
					"name": "Arishima",
					"text": "Ah, err, that was the plan."
				},
				{
					"text": "She tilts her head to the side in confusion."
				},
				{
					"name": "Arishima",
					"text": "I wanted to wait until you gave me the okay to go in."
				},
				{
					"text": "Her eyes open wide as the realization dawns upon her."
				},
				{
					"name": "Rin",
					"text": "But I gave you the key! You could have just gone in anyway!"
				},
				{
					"name": "Arishima",
					"text": "I figure it's really your studio now, so I wouldn't want to trespass."
				},
				{
					"name": "Rin",
					"text": "So you stayed outside all day?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Rin",
					"text": "I see. I'm so sorry. I thought you were in there already."
				},
				{
					"name": "Arishima",
					"text": "It's fine. It wasn't a bad weekend."
				},
				{
					"name": "Rin",
					"text": "You're too uptight sometimes."
				},
				{
					"text": "She lets out one of those cute giggles."
				},
				{
					"name": "Rin",
					"text": "Where did you go?"
				},
				{
					"name": "Arishima",
					"text": "Some diner around here."
				},
				{
					"text": "I glance down at the bag she's carrying."
				},
				{
					"name": "Arishima",
					"text": "And you? Went shopping?"
				},
				{
					"text": "She gives me a small nod."
				},
				{
					"text": "Then she flashes me a meaningful smile."
				},
				{
					"name": "Rin",
					"text": "Professor, can I cook for you again today?"
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"text": "She looks up at me, the smile on her face only growing bigger."
				},
				{
					"name": "Rin",
					"text": "It won't be anything as fancy as yesterday, though."
				},
				{
					"name": "Rin",
					"text": "I'd love to try again, if that's okay."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I take another look at the bag she's holding."
				},
				{
					"text": "It's a plastic bag with the logo of a major retailer, and it's full of what I assume is ingredients."
				},
				{
					"name": "Arishima",
					"text": "You want to cook again?"
				},
				{
					"text": "She gives one firm nod and lifts the bag a little."
				},
				{
					"name": "Rin",
					"text": "I bought it all with my own money. I want to treat you properly."
				},
				{
					"name": "Arishima",
					"text": "Your money?"
				},
				{
					"text": "She nods enthusiastically."
				},
				{
					"name": "Rin",
					"text": "That's fine, right?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I'm sitting at Rin's table again."
				},
				{
					"text": "She's in the kitchen, sorting the ingredients as she takes them out of the bag."
				},
				{
					"name": "Arishima",
					"text": "By your own money, you mean..."
				},
				{
					"text": "She turns my way and gives me a bright smile."
				},
				{
					"name": "Rin",
					"text": "I've been working part-time."
				},
				{
					"name": "Arishima",
					"text": "Part-time?"
				},
				{
					"text": "I repeat her words back like a parrot."
				},
				{
					"name": "Rin",
					"text": "There aren't many jobs where you can just show up whenever you like and get paid immediately."
				},
				{
					"name": "Arishima",
					"text": "Why so sudden?"
				},
				{
					"text": "She raises her face and turns her eyes to me."
				},
				{
					"name": "Rin",
					"text": "Didn't you tell me to?!"
				},
				{
					"name": "Arishima",
					"text": "Yeah, but I wasn't expecting you do it the next day!"
				},
				{
					"name": "Rin",
					"text": "Is it that strange?"
				},
				{
					"name": "Arishima",
					"text": "Nah, just surprising. A welcome surprise."
				},
				{
					"name": "Rin",
					"text": "I'm glad."
				},
				{
					"name": "Rin",
					"text": "I feel like it was worth it just to see the surprise on your face."
				},
				{
					"text": "Rin teases me as she takes out carrots, onions, and potatoes."
				},
				{
					"name": "Arishima",
					"text": "What kind of job?"
				},
				{
					"name": "Rin",
					"text": "Hawking food samples."
				},
				{
					"name": "Arishima",
					"text": "You? Really?"
				},
				{
					"text": "She frowns at me."
				},
				{
					"name": "Rin",
					"text": "What about it?"
				},
				{
					"name": "Arishima",
					"text": "Nothing, it's just that..."
				},
				{
					"text": "Her, yelling at people to try food samples?"
				},
				{
					"text": "It's a little hard to imagine."
				},
				{
					"name": "Arishima",
					"text": "It's just kind of hard to imagine you working in a supermarket."
				},
				{
					"name": "Arishima",
					"text": "You know, since it's such a bustling place and all. That's not really your scene, is it?"
				},
				{
					"name": "Rin",
					"text": "I decided to try working there exactly because of that! Didn't you say assuming things about people is bad?"
				},
				{
					"text": "She sounds displeased."
				},
				{
					"text": "I'm so thoroughly schooled that I can't help but laugh."
				},
				{
					"name": "Arishima",
					"text": "Yeah, you're right, prejudice is bad. There's nothing wrong with that kind of work. What were you giving out samples of?"
				},
				{
					"name": "Rin",
					"text": "Sausages."
				},
				{
					"text": "She takes a package of sausages from the bag and holds it up for me to see."
				},
				{
					"name": "Arishima",
					"text": "You bought those?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "Guess I fell for my own sales pitch."
				},
				{
					"name": "Arishima",
					"text": "Did you have fun?"
				},
				{
					"text": "She gives a vague nod."
				},
				{
					"name": "Rin",
					"text": "It was really stressful at first, but I did enjoy it a bit by the end."
				},
				{
					"name": "Rin",
					"text": "They got mad at me for a lot of little things."
				},
				{
					"name": "Rin",
					"text": "And I was told I was too quiet so many times."
				},
				{
					"text": "I can't help but chuckle."
				},
				{
					"name": "Rin",
					"text": "But I think I understand what you were trying to say now."
				},
				{
					"name": "Arishima",
					"text": "How so?"
				},
				{
					"name": "Rin",
					"text": "Shopping with money you earned yourself really is more fun."
				},
				{
					"name": "Rin",
					"text": "I couldn't buy much, though."
				},
				{
					"name": "Arishima",
					"text": "Are you sure you wanna spend your first paycheck on making food for me?"
				},
				{
					"name": "Rin",
					"text": "Of course. I earned it because I wanted to give you a treat."
				},
				{
					"text": "She beams at me."
				},
				{
					"name": "Arishima",
					"text": "I'm honored."
				},
				{
					"name": "Rin",
					"text": "That wine was really expensive, wasn't it? I'm sorry for making you pay for it."
				},
				{
					"name": "Rin",
					"text": "Earning money is so hard..."
				},
				{
					"name": "Arishima",
					"text": "Hahah..."
				},
				{
					"text": "As I laugh out loud, Rin blushes fiercely."
				},
				{
					"name": "Rin",
					"text": "Hey, what's with you today?! Are you making fun of me?!"
				},
				{
					"name": "Arishima",
					"text": "No way. I would never."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "She glares at me like a cat about to pounce."
				},
				{
					"name": "Arishima",
					"text": "You're just too sweet."
				},
				{
					"text": "That does nothing to loosen her sulky expression."
				},
				{
					"name": "Arishima",
					"text": "I'm really happy that you took my words to heart and are trying to improve yourself."
				},
				{
					"name": "Arishima",
					"text": "It makes me feel like I still have some kind of bond connecting me with something."
				},
				{
					"text": "Her expression changes to one of surprise as she stares at me."
				},
				{
					"name": "Arishima",
					"text": "I'll accept your kindness today."
				},
				{
					"name": "Arishima",
					"text": "Thank you, really."
				},
				{
					"text": "After staring at me for a moment, a smile slowly crosses her face."
				},
				{
					"text": "Looks like that did the trick."
				},
				{
					"name": "Rin",
					"text": "Yes."
				},
				{
					"text": "I watch her at work in the kitchen for a while."
				},
				{
					"text": "As I do, I feel my nervous heart slowly regain its normal beat."
				},
				{
					"text": "She keeps on cooking in silence."
				},
				{
					"text": "Watching her go to and fro makes a kind of affection that I've never felt before swell in my heart."
				},
				{
					"name": "Arishima",
					"text": "Want me to take a guess?"
				},
				{
					"name": "Rin",
					"text": "Huh?"
				},
				{
					"name": "Arishima",
					"text": "About what you're cooking."
				},
				{
					"text": "She looks at me, clearly surprised."
				},
				{
					"name": "Arishima",
					"text": "Curry."
				},
				{
					"text": "Her eyes widen for a moment."
				},
				{
					"text": "And then she laughs."
				},
				{
					"name": "Rin",
					"text": "Well guessed!"
				},
				{
					"name": "Arishima",
					"text": "I figured."
				},
				{
					"name": "Rin",
					"text": "You said you're always up for curry, right? Plus it's easy to make, and the ingredients are cheap."
				},
				{
					"name": "Arishima",
					"text": "Don't think I'll ever have enough of curry. It's good because you can eat it with one hand. I always read a book with the other."
				},
				{
					"name": "Arishima",
					"text": "Jinbocho style."
				},
				{
					"name": "Rin",
					"text": "That's news to me."
				},
				{
					"text": "Rin giggles as she stirs the big pot."
				},
				{
					"name": "Arishima",
					"text": "I can help if you want. I really don't mind."
				},
				{
					"name": "Rin",
					"text": "Even elementary students can manage curry. Just sit back and relax."
				},
				{
					"name": "Arishima",
					"text": "Gotcha."
				},
				{
					"text": "She giggles, and I get comfortable in my seat."
				},
				{
					"name": "Rin",
					"text": "I hope you like it."
				},
				{
					"text": "She presents me with a plate of curry with rice, and a huge bowl of salad."
				},
				{
					"text": "She also sets down a plate with a bunch of fried sausages in the middle of the table."
				},
				{
					"name": "Arishima",
					"text": "It looks delicious."
				},
				{
					"text": "For some reason, she laughs."
				},
				{
					"name": "Rin",
					"text": "Is that supposed to be praise?"
				},
				{
					"name": "Arishima",
					"text": "I'm pretty sure it was."
				},
				{
					"name": "Rin",
					"text": "Well, it's hard to mess up curry, isn't it?"
				},
				{
					"name": "Arishima",
					"text": "You'd be surprised. I've had my share of bad curry over the years."
				},
				{
					"name": "Arishima",
					"text": "It's quite possible to make bad curry, as unlikely as it sounds."
				},
				{
					"name": "Rin",
					"text": "So?"
				},
				{
					"name": "Arishima",
					"text": "Yours looks really delicious."
				},
				{
					"name": "Arishima",
					"text": "Perhaps the best looking curry I've ever seen."
				},
				{
					"name": "Rin",
					"text": "Ahahah!"
				},
				{
					"text": "She laughs out loud."
				},
				{
					"name": "Rin",
					"text": "You just weren't thinking too hard about what you said, huh?"
				},
				{
					"text": "She quirks an amused little smile."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Helpless, I simply nod."
				},
				{
					"name": "Rin",
					"text": "Thank you very much."
				},
				{
					"name": "Arishima",
					"text": "Uh..."
				},
				{
					"name": "Rin",
					"text": "Let's eat."
				},
				{
					"name": "Rin",
					"text": "I hope it's at least more delicious than that bad curry you mentioned just now."
				},
				{
					"name": "Arishima",
					"text": "We'll see about that."
				},
				{
					"name": "Rin",
					"text": "Yes."
				},
				{
					"text": "I take a spoonful and bring it to my mouth."
				},
				{
					"name": "Arishima",
					"text": "Mmh..."
				},
				{
					"name": "Rin",
					"text": "How is it?"
				},
				{
					"name": "Arishima",
					"text": "It's really damn good."
				},
				{
					"name": "Rin",
					"text": "I just used normal cheap curry powder, though."
				},
				{
					"name": "Arishima",
					"text": "No, it's really good. I'm not lying."
				},
				{
					"text": "I really am not.... this time."
				},
				{
					"name": "Arishima",
					"text": "It's way better than the stew from last time."
				},
				{
					"text": "With her eyes still on me, she blushes a little."
				},
				{
					"name": "Rin",
					"text": "I'm glad."
				},
				{
					"name": "Arishima",
					"text": "I've been eating out for years. It's been so long since I tasted real home cooking."
				},
				{
					"name": "Rin",
					"text": "Years?"
				},
				{
					"name": "Arishima",
					"text": "It warms my cockles, I mean it. It's really good."
				},
				{
					"name": "Rin",
					"text": "I'm happy to hear that."
				},
				{
					"text": "I take another bite and don't stop."
				},
				{
					"text": "She slowly eats away at her plate too."
				},
				{
					"text": "I glance at the sausages lined up in the middle of the table."
				},
				{
					"name": "Arishima",
					"text": "And the sausages are a nice bonus."
				},
				{
					"name": "Rin",
					"text": "Yeah. I feel like I've cooked enough sausages for a lifetime."
				},
				{
					"name": "Arishima",
					"text": "I sure wasn't expecting them along with curry."
				},
				{
					"name": "Rin",
					"text": "I haven't eaten a single one yet! I kinda wanted to try them after cooking so many."
				},
				{
					"name": "Arishima",
					"text": "Makes sense."
				},
				{
					"text": "I stab one with my fork and take it to my mouth."
				},
				{
					"text": "She does the same and slowly savors it."
				},
				{
					"name": "Arishima",
					"text": "So, how is it?"
				},
				{
					"name": "Rin",
					"text": "Surprisingly..."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "...plain."
				},
				{
					"name": "Arishima",
					"text": "Pfft..."
				},
				{
					"name": "Rin",
					"text": "Heheh."
				},
				{
					"text": "We both laugh together for a while."
				},
				{
					"text": "After we're finished, I wash the dishes."
				},
				{
					"name": "Arishima",
					"text": "You made me dinner with your first ever paycheck. Let me do this much."
				},
				{
					"name": "Rin",
					"text": "Oh, you really don't need to..."
				},
				{
					"text": "Rin watches distractedly as I wash the dishes."
				},
				{
					"text": "As I finish, I notice a package of instant coffee on the kitchen table."
				},
				{
					"name": "Arishima",
					"text": "Oh, coffee. Mind if I make some?"
				},
				{
					"name": "Rin",
					"text": "Yes, go ahead. I bought it for you, actually."
				},
				{
					"name": "Arishima",
					"text": "Really?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "Thank you."
				},
				{
					"text": "I see the mug I used last time and Rin's mug on the draining board."
				},
				{
					"text": "I line up the cups and set the drip bags in them."
				},
				{
					"text": "After adding a little bit of cold water to cool it, I pour the hot water between them."
				},
				{
					"name": "Rin",
					"text": "Why do you add cold water?"
				},
				{
					"name": "Arishima",
					"text": "I read that if the water's too hot, it ruins the scent."
				},
				{
					"name": "Rin",
					"text": "Whoa, really?"
				},
				{
					"name": "Arishima",
					"text": "I don't really mind when I'm making it just for myself, though."
				},
				{
					"text": "I tell her with a sad smile."
				},
				{
					"name": "Arishima",
					"text": "Well, anyway, I hope you enjoy my special instant coffee. I'm very particular about it."
				},
				{
					"text": "She giggles at that."
				},
				{
					"name": "Rin",
					"text": "I'll keep that in mind."
				},
				{
					"text": "We sit facing each other at the table again."
				},
				{
					"name": "Rin",
					"text": "You... came to read my father's diary today, right?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "That was the plan."
				},
				{
					"name": "Rin",
					"text": "...Is it really that interesting?"
				},
				{
					"name": "Rin",
					"text": "I mean, you've been reading it every day."
				},
				{
					"name": "Arishima",
					"text": "It's strange. We've never met, but he feels really familiar somehow."
				},
				{
					"name": "Arishima",
					"text": "If I'd known we were so alike, I would have dropped my stupid stubbornness and talked to him when we were in college."
				},
				{
					"name": "Rin",
					"text": "Stubbornness? You were like that?"
				},
				{
					"name": "Arishima",
					"text": "Back then I wanted to get my debut novel published too. Shuho's the one who made that dream come true right in front of me."
				},
				{
					"name": "Arishima",
					"text": "...I didn't want to be one more in the crowd just looking up at him."
				},
				{
					"name": "Arishima",
					"text": "I was probably thinking that I was the only one among us who was seriously thinking of getting my stuff published and making a debut."
				},
				{
					"text": "Suddenly, that little self-deprecating demon speaks into my ear."
				},
				{
					"name": "Arishima",
					"text": "I suppose I was thinking that I should at least win some rookie award before talking to him. So we could be on equal footing and all that."
				},
				{
					"name": "Rin",
					"text": "So that's why you didn't know him very well in college. I thought it strange, since you attended the same seminar."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "That was more than twenty years ago."
				},
				{
					"name": "Arishima",
					"text": "And in the end... I never managed to stand on equal terms with him."
				},
				{
					"name": "Arishima",
					"text": "Actually, I don't think anyone can ever stand on his level anymore."
				},
				{
					"name": "Arishima",
					"text": "I was only able to face him after his death. I'm just sympathizing with the statue of the man that was."
				},
				{
					"name": "Arishima",
					"text": "And I think it could have only happened on these terms."
				},
				{
					"name": "Arishima",
					"text": "Ironic, isn't it?"
				},
				{
					"name": "Rin",
					"text": "I..."
				},
				{
					"text": "I raise my head as she murmurs."
				},
				{
					"name": "Rin",
					"text": "...don't think my father ever stood so high up."
				},
				{
					"name": "Rin",
					"text": "His works did sell really well. That's why I'm living in such an expensive place."
				},
				{
					"name": "Rin",
					"text": "And today I understood how grateful I should be for that."
				},
				{
					"text": "Rin squints through the smoke rising from her mug."
				},
				{
					"name": "Rin",
					"text": "But all I ever learned from him..."
				},
				{
					"name": "Rin",
					"text": "Was that he regretted me ever being born. Nothing besides that."
				},
				{
					"name": "Rin",
					"text": "I don't think someone like that should be on the lofty pedestal you're placing him on."
				},
				{
					"text": "I stay silent for a while."
				},
				{
					"name": "Arishima",
					"text": "Being a successful and acclaimed writer..."
				},
				{
					"name": "Arishima",
					"text": "...has little to do with how virtuous one is as a person."
				},
				{
					"text": "She turns her eyes up to me and nods."
				},
				{
					"name": "Arishima",
					"text": "I know where you're coming from, but Hatano Shuho was..."
				},
				{
					"name": "Rin",
					"text": "Professor."
				},
				{
					"text": "After gently cutting me off, she shakes her head."
				},
				{
					"name": "Rin",
					"text": "You can't understand how I feel."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "I'm sorry. I was the one who took you there."
				},
				{
					"name": "Rin",
					"text": "But I never imagined you would develop this admiration for him."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "You want me to say he was an overrated writer? That in the end, he was just a bad person?"
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "I'm not blaming you for rightfully feeling the way you do. Don't get me wrong."
				},
				{
					"name": "Arishima",
					"text": "I just don't think repeating the same criticisms and blanket writing him out as a completely horrible person will help you move on either."
				},
				{
					"name": "Arishima",
					"text": "I don't think that will help you at all."
				},
				{
					"text": "She's still staring down at the mug in front of her."
				},
				{
					"text": "I heave a tired sigh."
				},
				{
					"text": "Today, she went to work with the express intent of earning money to treat me to dinner with."
				},
				{
					"text": "Why does it always end on a sour note because of my big mouth?"
				},
				{
					"name": "Arishima",
					"text": "I'm sorry, I didn't mean to spoil the nice evening. I just really think you need to overcome that."
				},
				{
					"text": "She raises her face and looks at me."
				},
				{
					"name": "Arishima",
					"text": "Even if he was a failure as a parent, and even if he was a guy who got a woman he didn't love pregnant."
				},
				{
					"name": "Arishima",
					"text": "Even if his works don't speak to you on any level."
				},
				{
					"name": "Arishima",
					"text": "The fact that his writing has saved many people is still true."
				},
				{
					"name": "Arishima",
					"text": "And I believe the things he achieved as a writer are things only a great person in that field could do."
				},
				{
					"name": "Arishima",
					"text": "You need to separate the image of Shuho that he left you with from the image of the author that people who didn't know him have."
				},
				{
					"name": "Arishima",
					"text": "If you can't reconcile that, you'll keep on feeling angry and sad."
				},
				{
					"name": "Rin",
					"text": "I know that! I'm well aware of it!"
				},
				{
					"name": "Rin",
					"text": "I know, but..."
				},
				{
					"text": "Rin trails off at the end, but I know what she meant to say."
				},
				{
					"text": "\"You don't understand.\""
				},
				{
					"text": "\"I know what I've lived. It's my truth.\""
				},
				{
					"name": "Arishima",
					"text": "You can do it."
				},
				{
					"text": "She looks up at me again."
				},
				{
					"name": "Arishima",
					"text": "You still have time. It'll be fine."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "You took my preachy talk from yesterday on board and showed me just how much you grew in a matter of days."
				},
				{
					"name": "Arishima",
					"text": "You're sweet, honest, and young."
				},
				{
					"name": "Arishima",
					"text": "I'm sure you'll grow into a wonderful woman."
				},
				{
					"name": "Arishima",
					"text": "So it's fine. I know you can overcome this."
				},
				{
					"text": "Still looking at me, she giggles."
				},
				{
					"text": "Unsure what to make of it, I only stare."
				},
				{
					"name": "Rin",
					"text": "You know so much, but you don't understand a woman's heart."
				},
				{
					"name": "Arishima",
					"text": "Uhh..."
				},
				{
					"name": "Rin",
					"text": "I think I'm very stubborn myself."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Suddenly, she exudes a lot more confidence. She doesn't look like a girl being reprimanded anymore, but a woman."
				},
				{
					"name": "Rin",
					"text": "That's why I invited you today."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Do you know what I'm trying to say?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I think upon her words for a long moment."
				},
				{
					"name": "Rin",
					"text": "I don't want you to treat me like a little girl."
				},
				{
					"name": "Rin",
					"text": "And I don't want to play second fiddle to anyone else in your heart."
				},
				{
					"text": "She has a confident, bewitching smile on her face."
				},
				{
					"text": "My eyes are drawn to it like moths to a flame."
				},
				{
					"name": "Rin",
					"text": "I can't bear you seeing everything I do under the shadow of my father."
				},
				{
					"name": "Rin",
					"text": "That's why I made you dinner today with my own hard earned money. It has nothing to do with that man."
				},
				{
					"name": "Rin",
					"text": "I just couldn't accept you seeing me as a helpless, dependent girl. That's pretty stubborn, isn't it?"
				},
				{
					"text": "It's not a rhetorical question."
				},
				{
					"text": "Her sharp, almost icy stare seems to pierce through me."
				},
				{
					"name": "Arishima",
					"text": "...I see."
				},
				{
					"text": "She tilts her head to the side, waiting for me to keep going."
				},
				{
					"name": "Arishima",
					"text": "Okay. I'll remember that. I won't treat you like a kid anymore."
				},
				{
					"name": "Arishima",
					"text": "You're not my student when we're here. I'll try to put that out of my mind."
				},
				{
					"text": "Pleased, Rin's smile slowly widens."
				},
				{
					"name": "Arishima",
					"text": "Thank you for the dinner. It was delicious."
				},
				{
					"name": "Rin",
					"text": "I'm glad you enjoyed it."
				},
				{
					"name": "Arishima",
					"text": "So, next week."
				},
				{
					"text": "She raises her eyebrows and looks at me curiously."
				},
				{
					"name": "Arishima",
					"text": "Can I spend the night there?"
				},
				{
					"name": "Rin",
					"text": "There? You mean at the studio?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "It's almost summer break, so..."
				},
				{
					"text": "I stop myself."
				},
				{
					"text": "What am I gonna do during the break?"
				},
				{
					"text": "Edit the manuscript I wrote?"
				},
				{
					"text": "Write something new altogether?"
				},
				{
					"name": "Rin",
					"text": "I don't really mind."
				},
				{
					"text": "Her eyes wander for a moment, but then they settle on me."
				},
				{
					"name": "Rin",
					"text": "Just please, don't use the bathroom."
				},
				{
					"name": "Rin",
					"text": "Don't even go in there."
				},
				{
					"name": "Rin",
					"text": "It's like stepping into death itself. At least that's how I felt."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "If you can promise me that, then you can stay."
				},
				{
					"name": "Arishima",
					"text": "Okay."
				},
				{
					"text": "I give her a firm nod."
				},
				{
					"name": "Arishima",
					"text": "I promise."
				},
				{
					"name": "Rin",
					"text": "All right."
				},
				{
					"name": "Arishima",
					"text": "Thanks."
				},
				{
					"text": "After putting on my shoes, I turn to her."
				},
				{
					"name": "Arishima",
					"text": "Well, I guess this is it."
				},
				{
					"name": "Rin",
					"text": "Can I..."
				},
				{
					"name": "Arishima",
					"text": "Hm?"
				},
				{
					"name": "Rin",
					"text": "Can I cook dinner for you again?"
				},
				{
					"text": "I look down at her, at a loss for words."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "She looks down, obviously bashful. I respond with a firm nod."
				},
				{
					"name": "Arishima",
					"text": "I'd love that."
				},
				{
					"text": "She looks up again, beaming at me."
				},
				{
					"name": "Arishima",
					"text": "But next time let's go shopping together. I'll pay."
				},
				{
					"name": "Rin",
					"text": "Yes. Then let's go tomorrow. Together."
				},
				{
					"text": "I nod again."
				},
				{
					"name": "Rin",
					"text": "Have a good night."
				},
				{
					"name": "Arishima",
					"text": "Yeah, you too."
				},
				{
					"text": "I remember the first time we spoke..."
				},
				{
					"text": "Back then, I thought that I shouldn't get closer than necessary to one of my students."
				},
				{
					"text": "But now she's been making dinner for me in her own apartment."
				},
				{
					"text": "Perhaps I changed without even realizing it myself."
				},
				{
					"text": "Yes. I must have changed."
				},
				{
					"text": "Just like the fathers I saw today at the diner turned into family men at some point."
				},
				{
					"text": "I'm changing so gradually that I'm not even aware of it."
				},
				{
					"text": "I started writing a novel again, divorced my wife, and I'm reading the diaries of a dead man."
				},
				{
					"text": "It's such a huge change."
				},
				{
					"text": "And it all began with my encounter with Rin."
				},
				{
					"text": "That rainy day we shared an umbrella under the cold downpour."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "It was the day of the funeral for the old seminar professor."
				},
				{
					"text": "Death was present on the day we met, too."
				},
				{
					"text": "We met in the wake of a death, and came together again over the death of another person; Hatano Shuho."
				},
				{
					"text": "If this was a novel..."
				},
				{
					"text": "Naturally, the final destination of the character would be death."
				},
				{
					"text": "That way, the story would feature death in all three acts."
				},
				{
					"text": "I laugh to myself."
				},
				{
					"text": "I see now."
				},
				{
					"text": "If I were headed towards death..."
				},
				{
					"text": "Then my life would almost be..."
				},
				{
					"text": "...like a story."
				}
			]
		},
		{}
	]
}