{
	"scenes": [
		{},
		{
			"texts": [
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Over the course of the night, I made love to Rin many times."
				},
				{
					"text": "Even while taking a shower together we sought each other, and after moving to bed, we greedily wanted more."
				},
				{
					"text": "At the end of it all, I fall into a deep sleep, completely spent."
				},
				{
					"text": "I wake up to find Rin reading the manuscript next to me."
				},
				{
					"text": "I get up and leave the bedroom."
				},
				{
					"text": "Recovering the shirt I haphazardly threw to the floor of the dressing room yesterday, I retrieve a cig from its pocket."
				},
				{
					"text": "It's a little crumpled from getting wet and drying out again, but it'll do. I pop it in my mouth, go to the kitchen, and light it up below the ventilation fan."
				},
				{
					"text": "Part of the paper is discolored."
				},
				{
					"text": "And the filter feels really squishy. Must have been the water."
				},
				{
					"text": "As I look up at the smoke getting sucked out by the fan, I remember Rin as she was last night."
				},
				{
					"text": "I can still hear her calling out my name."
				},
				{
					"text": "The way she straddled me with her legs open wide and looked down at me with a satisfied smile on her face."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "The memory is so vivid I can feel my pants getting tight already."
				},
				{
					"text": "I close my eyes and try to keep her away from my thoughts, to little success."
				},
				{
					"text": "I finish smoking and turn off the fan."
				},
				{
					"text": "Returning to the bedroom, I stare at her from the doorway."
				},
				{
					"text": "She's silently reading the manuscript."
				},
				{
					"text": "She has only a few pages left."
				},
				{
					"text": "Did she not sleep?"
				},
				{
					"name": "Arishima",
					"text": "I've got half a mind to brew some coffee."
				},
				{
					"text": "She raises her face from the papers."
				},
				{
					"name": "Rin",
					"text": "There's some drip coffee left from last time."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "I'll use that. You want some?"
				},
				{
					"text": "She slowly shakes her head."
				},
				{
					"name": "Rin",
					"text": "I'll make some for myself when I'm done reading. Go ahead."
				},
				{
					"name": "Arishima",
					"text": "All right."
				},
				{
					"text": "She smiles at me before turning her attention back to the manuscript."
				},
				{
					"text": "I sit at the table and stare vacantly at the ceiling and walls while I drink my coffee."
				},
				{
					"text": "I stay there a while after finishing until Rin shows up holding the manuscript."
				},
				{
					"text": "All she's wearing is a T-shirt as she pads around barefoot."
				},
				{
					"text": "Memories from last night flash through my mind and I quickly look away from her."
				},
				{
					"text": "I'm not sure if she noticed or not, but she directs a suggestive smile at me and sits across the table."
				},
				{
					"name": "Rin",
					"text": "I think I would like you to do me some, after all."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Coffee."
				},
				{
					"name": "Arishima",
					"text": "Sure."
				},
				{
					"text": "No way that ambiguous wording wasn't on purpose."
				},
				{
					"name": "Rin",
					"text": "Give me some?"
				},
				{
					"name": "Arishima",
					"text": "Of course."
				},
				{
					"text": "I get up and brew her some more coffee."
				},
				{
					"text": "I glance back at her as she looks out the window."
				},
				{
					"text": "On the table rests my empty mug and the manuscript."
				},
				{
					"name": "Arishima",
					"text": "Here you go."
				},
				{
					"text": "I set the mug in front of her."
				},
				{
					"name": "Rin",
					"text": "Thanks."
				},
				{
					"text": "She looks up at me and smiles."
				},
				{
					"text": "I sit down opposite her and watch as she sips her coffee."
				},
				{
					"text": "She's wearing that funny daruma bird T-shirt that I bought for her in Sakuragicho."
				},
				{
					"text": "She puts the mug down on the table and sighs."
				},
				{
					"name": "Rin",
					"text": "I read it."
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "Clasping the mug with both hands, she looks up at me."
				},
				{
					"name": "Rin",
					"text": "It was really good."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Loose-jawed from the surprise, I simply stare at her."
				},
				{
					"name": "Rin",
					"text": "I think this writing is really good. I don't think it'd make for a good book as it is right now, though."
				},
				{
					"text": "I nod, still unable to say anything."
				},
				{
					"name": "Rin",
					"text": "Reading it, I fell in love all over again."
				},
				{
					"text": "She says, the sweetest of smiles adorning her face."
				},
				{
					"text": "In my shock, I'm unable to do much besides let my gaze swim and my mouth flap like a fish's."
				},
				{
					"name": "Rin",
					"text": "Ahahah! What is it? Cat got your tongue?"
				},
				{
					"name": "Arishima",
					"text": "No, err, I just..."
				},
				{
					"text": "She giggles, her eyes still set on me."
				},
				{
					"text": "I feel so uncomfortable."
				},
				{
					"text": "And yet, at the same time, so happy and at peace."
				},
				{
					"text": "Even though I know I'm just dancing on the palm of her hand right now."
				},
				{
					"name": "Arishima",
					"text": "I didn't expect praise like that from you."
				},
				{
					"name": "Rin",
					"text": "You're such a bad liar. There's no way you could have written that unaware."
				},
				{
					"name": "Rin",
					"text": "I bet you knew I'd read it and fall hopelessly in love with you. There's no doubt in my mind."
				},
				{
					"name": "Rin",
					"text": "Am I wrong?"
				},
				{
					"name": "Arishima",
					"text": "Err, I..."
				},
				{
					"name": "Rin",
					"text": "Could it be that this was your intention all along?"
				},
				{
					"name": "Arishima",
					"text": "Not at all."
				},
				{
					"name": "Rin",
					"text": "That's a little hard to believe, judging from the night we had."
				},
				{
					"name": "Arishima",
					"text": "I think I would've taken a shower first if that's what I was planning to do."
				},
				{
					"name": "Arishima",
					"text": "And I would have actually bought some protection while I was at the convenience store."
				},
				{
					"name": "Rin",
					"text": "Ahahah!"
				},
				{
					"text": "Visibly amused, she laughs out loud."
				},
				{
					"name": "Rin",
					"text": "Good response!"
				},
				{
					"text": "I nod."
				},
				{
					"text": "And she nods back cheerfully."
				},
				{
					"text": "She puts the mug to her lips and keeps sipping."
				},
				{
					"name": "Rin",
					"text": "Thank you."
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"text": "She murmurs, looking down at the table."
				},
				{
					"text": "I notice that her tone of voice has changed."
				},
				{
					"name": "Rin",
					"text": "I could really feel just how much love you have for me."
				},
				{
					"name": "Rin",
					"text": "Your writing made me feel the peace of mind one usually only feels after being loved for years."
				},
				{
					"name": "Rin",
					"text": "Reading it made me feel glad to be alive."
				},
				{
					"name": "Rin",
					"text": "And it's thanks to you."
				},
				{
					"text": "She lovingly looks into my eyes as she speaks."
				},
				{
					"name": "Rin",
					"text": "It made me feel like maybe, if there's someone out there who loves me so much, being alive a little longer wouldn't be so bad."
				},
				{
					"text": "Unable to find the words, I simply keep nodding in response."
				},
				{
					"name": "Rin",
					"text": "I felt your love in a deeper way than all the times you made love to me. Though I enjoyed that in its own right as well."
				},
				{
					"text": "She lets out a devilish giggle."
				},
				{
					"name": "Arishima",
					"text": "...I'll get in shape so I can satisfy you."
				},
				{
					"text": "She nods, a sly grin spreading across her face."
				},
				{
					"name": "Rin",
					"text": "I'll be waiting with bated breath."
				},
				{
					"text": "After that, she takes another sip of coffee."
				},
				{
					"name": "Rin",
					"text": "Have you decided what to do next?"
				},
				{
					"name": "Arishima",
					"text": "What do you mean?"
				},
				{
					"name": "Rin",
					"text": "What to write."
				},
				{
					"name": "Arishima",
					"text": "Nah."
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Arishima",
					"text": "I haven't thought about it at all. To be honest, I feel like I've let everything I had bottled up inside out."
				},
				{
					"name": "Arishima",
					"text": "When I was writing, I couldn't think about anything but the words before me, and you."
				},
				{
					"text": "She smiles."
				},
				{
					"name": "Arishima",
					"text": "I haven't decided what to write, or if I'm even gonna write again at all."
				},
				{
					"name": "Rin",
					"text": "I think you should write."
				},
				{
					"name": "Rin",
					"text": "I'm sure you should."
				},
				{
					"text": "She sounds so matter of fact about it."
				},
				{
					"name": "Rin",
					"text": "If you could put your feelings to paper like that just to show them to me, I'm sure you can write anything."
				},
				{
					"name": "Rin",
					"text": "If you found a message that made you feel strongly enough, I'm sure you could write something that would appeal to the general public instead of just me."
				},
				{
					"name": "Arishima",
					"text": "But I don't have a message that would interest the general public like you say."
				},
				{
					"name": "Rin",
					"text": "That's a lie if I've ever heard one. Right here in these pages, you wrote about so many things in life you're dissatisfied with."
				},
				{
					"text": "She points to the manuscript."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "I want to read even more of your writing."
				},
				{
					"name": "Rin",
					"text": "And that's why you've gotta write. How else can I read more?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I could stare at that smile all day."
				},
				{
					"name": "Arishima",
					"text": "Okay, but..."
				},
				{
					"text": "She cocks her head and looks at me curiously."
				},
				{
					"name": "Arishima",
					"text": "But next time we've gotta read each other's writing."
				},
				{
					"text": "She opens her eyes wide in surprise."
				},
				{
					"name": "Rin",
					"text": "You want me to write something too?"
				},
				{
					"name": "Arishima",
					"text": "I'd like that. Otherwise I can't read your writing either."
				},
				{
					"name": "Rin",
					"text": "No way."
				},
				{
					"name": "Arishima",
					"text": "Hahahah!"
				},
				{
					"name": "Rin",
					"text": "What's so funny?!"
				},
				{
					"name": "Arishima",
					"text": "Nothing, I just kind of think..."
				},
				{
					"text": "I stare into her eyes."
				},
				{
					"text": "She meets my gaze with her own."
				},
				{
					"name": "Arishima",
					"text": "I think you can write. I think you should. I'm sure you could write some good stuff."
				},
				{
					"name": "Rin",
					"text": "Because I'm the daughter of a famous writer?"
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Arishima",
					"text": "Because you're that kind of person. Your blood has nothing to do with it."
				},
				{
					"text": "She giggles and gives me a small nod."
				},
				{
					"name": "Arishima",
					"text": "I think you should. And more than that, I want to read it."
				},
				{
					"name": "Rin",
					"text": "But..."
				},
				{
					"name": "Arishima",
					"text": "If you write, I'll write. Sounds like a fair exchange to me."
				},
				{
					"name": "Rin",
					"text": "You really think I can do it?"
				},
				{
					"name": "Arishima",
					"text": "I know you can."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "Rin seems to be in deep thought."
				},
				{
					"text": "Then she quirks the corners of her mouth and gives me a mischievous smile."
				},
				{
					"name": "Rin",
					"text": "So, say I do manage to write something... I'd like a reward for my effort."
				},
				{
					"name": "Arishima",
					"text": "Really now?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Arishima",
					"text": "Well, if I can make it happen, then sure."
				},
				{
					"name": "Rin",
					"text": "You've gotta submit your next work for a rookie award."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I stare at her in disbelief."
				},
				{
					"name": "Rin",
					"text": "If you promise to do that, I feel like I could give it my best shot."
				},
				{
					"name": "Arishima",
					"text": "Rin, I..."
				},
				{
					"name": "Rin",
					"text": "Oh, come on! It's a fine goal, no? Let's do it during the summer break."
				},
				{
					"name": "Rin",
					"text": "If I can finish writing one piece, you'll submit yours for a rookie award."
				},
				{
					"name": "Rin",
					"text": "It'll be our summer battle."
				},
				{
					"name": "Rin",
					"text": "I bet it'll make for one memorable summer, right?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "We're on, then!"
				},
				{
					"text": "She gives me a playful smile."
				},
				{
					"name": "Arishima",
					"text": "You got me good, huh?"
				},
				{
					"name": "Rin",
					"text": "Oh, and one more thing."
				},
				{
					"text": "She gives me another one of those smug, sly looks."
				},
				{
					"name": "Arishima",
					"text": "What?"
				},
				{
					"name": "Rin",
					"text": "Put something on. You're gonna get me all hot and bothered remembering last night."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Are you doing it on purpose?"
				},
				{
					"text": "She says, dexterously raising one eyebrow at me."
				},
				{
					"name": "Arishima",
					"text": "Oh..."
				},
				{
					"text": "I clear my throat."
				},
				{
					"text": "At the ripe old age of 45, I find myself clearing my throat after being caught with my pants down, literally."
				},
				{
					"text": "I use the washing machine in Rin's house to clean my clothes. One single button press and it does all the work. Truly, we have come far as a species."
				},
				{
					"text": "After changing into my now clean clothes, I head to Shuho's studio to pick up my bag."
				},
				{
					"text": "It's still pretty early."
				},
				{
					"text": "I had lunch with Rin while I waited for my laundry to be done."
				},
				{
					"text": "Rin said that she would make dinner tonight."
				},
				{
					"text": "I think she's out shopping while I go get my stuff."
				},
				{
					"text": "Now that I think about it, it'll probably be the first real meal I've had in a good while."
				},
				{
					"text": "I feel strange."
				},
				{
					"text": "My feet are so light they barely feel attached to me."
				},
				{
					"text": "I have so much to think about."
				},
				{
					"text": "I skipped work without explanation."
				},
				{
					"text": "I'm now in a relationship with a student."
				},
				{
					"text": "And the woman I'm in the process of divorcing saw me locking arms with her."
				},
				{
					"text": "If I'm not careful, I might have a lot of explaining to do."
				},
				{
					"text": "The worries pile up and make me want to sigh, yet my heart feels radiant."
				},
				{
					"text": "Maybe the part of my brain that regulates anxiety is truly broken."
				},
				{
					"text": "Like a junkie in the middle of his high."
				},
				{
					"text": "But there is something that backs up this peppy spring in my step."
				},
				{
					"text": "Rin herself. And while it's true that she's in my life for now..."
				},
				{
					"text": "Despite my obvious lack of morals, I'm a grown man."
				},
				{
					"text": "I know that her fiery passion won't last forever."
				},
				{
					"text": "But that's fine."
				},
				{
					"text": "It doesn't deter the happiness I'm feeling."
				},
				{
					"text": "As long as she lives on somewhere, and she's happy in the future, I will be too."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "When I take my first step inside the studio I freeze, stunned."
				},
				{
					"text": "Was the air in this place always so stagnant?"
				},
				{
					"text": "Did I really find this space comfortable?"
				},
				{
					"text": "I shudder."
				},
				{
					"text": "My stench after spending all that time here unwashed hangs like grime clinging to a wall."
				},
				{
					"text": "Intermingled with it is the scent of death."
				},
				{
					"text": "No one can stay in this place."
				},
				{
					"text": "That's what my instincts tell me."
				},
				{
					"text": "I feel the stomach-churning fear of a person who unknowingly crosses a flimsy log bridge with a blindfold on, only to look back and realize how lucky he was."
				},
				{
					"text": "One wrong step, and I would have been dead."
				},
				{
					"text": "Subconsciously, I recognize the danger I was in."
				},
				{
					"text": "This heavy atmosphere crushes the spirit."
				},
				{
					"text": "No amount of ventilation could save this place."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I collect my laptop from the desk and throw the bag over my shoulder."
				},
				{
					"text": "Back at the entrance, I take one last look at the room."
				},
				{
					"text": "Hatano Shuho wasn't the perfect man I thought him to be."
				},
				{
					"text": "But the power of his writing was the real deal."
				},
				{
					"text": "His memories have the power to pull the reader into the same state of mind that he was in."
				},
				{
					"text": "That's a power I don't have."
				},
				{
					"text": "And I don't think I want it anymore."
				},
				{
					"text": "I don't want to make Rin feel even an ounce of the suffering I did."
				},
				{
					"text": "I want to deliver her a story of salvation, even if it's make-believe."
				},
				{
					"text": "Even if it's not to remain with her for long, a story that could, just for a moment, light up her heart."
				},
				{
					"text": "I don't mind being a shallow minstrel."
				},
				{
					"text": "Shuho's diaries, his creative materials and reference books."
				},
				{
					"text": "I slowly look it all over, committing to memory this room that I won't ever see again."
				},
				{
					"name": "Arishima",
					"text": "...I wish we could have shared drinks when you were still around."
				},
				{
					"text": "I mutter that to the silent room, and turn off the lights."
				},
				{
					"text": "On my way to the front door, my gaze wanders towards the bathroom."
				},
				{
					"text": "Through the polished glass, I can clearly see the darkness that lies within."
				},
				{
					"text": "The life-engulfing darkness lies there, like a bottomless pit, spreading out into the beyond."
				},
				{
					"text": "I won't come here again."
				},
				{
					"text": "I'll give the key back to Rin."
				},
				{
					"text": "I put my shoes back on, leave Shuho's studio, and lock the door behind me."
				},
				{
					"text": "When I make it back to Rin's apartment building, my phone vibrates."
				},
				{
					"text": "I expect it to be a message from Rin, but I'm wrong."
				},
				{
					"text": "It's an email in my inbox."
				},
				{
					"text": "I'm unable to contain my laughter when I read it."
				},
				{
					"name": "Rin",
					"text": "Welcome back."
				},
				{
					"text": "When I open the door, Rin comes over to greet me."
				},
				{
					"name": "Arishima",
					"text": "Nice to be back."
				},
				{
					"name": "Rin",
					"text": "You barely packed anything."
				},
				{
					"text": "Surveying my luggage, Rin giggles to herself."
				},
				{
					"name": "Arishima",
					"text": "I was only planning to stay the weekend."
				},
				{
					"name": "Rin",
					"text": "Well, we're in summer break now."
				},
				{
					"name": "Arishima",
					"text": "Oh, really? It slipped my mind."
				},
				{
					"text": "At the time I was absent from work and Watanabe called, there should have been three days left until the end-of-semester ceremony."
				},
				{
					"text": "I did feel like I stayed in that room for longer than three days."
				},
				{
					"name": "Rin",
					"text": "It's been about a week since summer break started. You were holed up in the studio for ten days."
				},
				{
					"name": "Arishima",
					"text": "Whoa, really?"
				},
				{
					"text": "I'm speechless."
				},
				{
					"text": "She looks up at me curiously."
				},
				{
					"name": "Arishima",
					"text": "When I went back just now..."
				},
				{
					"name": "Arishima",
					"text": "I was surprised at how oppressive the air was."
				},
				{
					"name": "Arishima",
					"text": "I can't believe I was in there for ten whole days."
				},
				{
					"text": "Rin nods, a smile of relief forming on her face."
				},
				{
					"name": "Rin",
					"text": "I think that's the normal reaction to have."
				},
				{
					"name": "Rin",
					"text": "I'm really glad you came back."
				},
				{
					"name": "Arishima",
					"text": "It's thanks to you."
				},
				{
					"text": "I take the chance to pick up the key from the bag by my feet and put it on the table."
				},
				{
					"text": "She looks at it for a moment before realizing what it is."
				},
				{
					"name": "Arishima",
					"text": "I think that, all in all, that studio had a positive effect on me."
				},
				{
					"name": "Arishima",
					"text": "Coming into contact with Shuho's raw writing helped me convey my feelings to you."
				},
				{
					"name": "Arishima",
					"text": "But I won't go there anymore. I can keep on living without Shuho."
				},
				{
					"name": "Arishima",
					"text": "As long as I know you're somewhere out there, I can keep on going."
				},
				{
					"name": "Rin",
					"text": "But I'm right next to you?"
				},
				{
					"name": "Arishima",
					"text": "I'm happy you feel this way about me. I know that you really mean it right now."
				},
				{
					"name": "Arishima",
					"text": "But I'm not young enough to think this will last forever."
				},
				{
					"name": "Arishima",
					"text": "I don't want to be a burden on you."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "She simply stares at me in silence."
				},
				{
					"name": "Arishima",
					"text": "Anyway..."
				},
				{
					"text": "I clear my throat and return her gaze."
				},
				{
					"name": "Arishima",
					"text": "I don't need to chase after Shuho's shadow any longer. I'll write my next work because you said you wanted to read it. I wanna write it for you."
				},
				{
					"name": "Arishima",
					"text": "I don't need the key anymore."
				},
				{
					"text": "She gives me a slow, deliberate nod."
				},
				{
					"name": "Rin",
					"text": "Okay, I'll take it back."
				},
				{
					"name": "Arishima",
					"text": "Just know that I don't think you need to go to that studio either."
				},
				{
					"name": "Rin",
					"text": "I think the same, yes."
				},
				{
					"name": "Arishima",
					"text": "What do you wanna do? If you don't want the key, I can hold onto it."
				},
				{
					"text": "I watch her stare down at the key for a moment."
				},
				{
					"name": "Rin",
					"text": "I think it will take me some time..."
				},
				{
					"name": "Rin",
					"text": "But I don't feel as trapped as I did before. By my father, or by that place."
				},
				{
					"text": "She says, her gaze fixed on the key."
				},
				{
					"name": "Rin",
					"text": "Neither of us needs this key, but it'll be needed when the studio is sold off someday, so I'll keep it safe."
				},
				{
					"text": "She says, raising her gaze to me."
				},
				{
					"text": "I answer with a nod."
				},
				{
					"name": "Rin",
					"text": "I went grocery shopping while you went to pick up your things. There's something I really wanted to make for you tonight."
				},
				{
					"name": "Arishima",
					"text": "Oh, really?"
				},
				{
					"text": "She quirks a smile."
				},
				{
					"name": "Arishima",
					"text": "Could it be mackerel?"
				},
				{
					"name": "Rin",
					"text": "Correct."
				},
				{
					"text": "I watch from behind as Rin works in the kitchen."
				},
				{
					"text": "She's so adept with the knife now that I can scarcely believe she was so clumsy not so long ago."
				},
				{
					"name": "Arishima",
					"text": "Whoa..."
				},
				{
					"name": "Rin",
					"text": "Yes?"
				},
				{
					"name": "Arishima",
					"text": "How many fish have you prepared?"
				},
				{
					"name": "Rin",
					"text": "I forgot. I ate them pretty much every day. For both lunch and dinner a few times, actually."
				},
				{
					"name": "Rin",
					"text": "The fishmonger even remembers me now. He thinks I just love horse mackerel."
				},
				{
					"name": "Arishima",
					"text": "I can imagine."
				},
				{
					"text": "Rin laughs as she cuts into the first fish."
				},
				{
					"text": "Her movement is smooth and fluid as a brook."
				},
				{
					"text": "She looks back at me, her eyes full of confidence."
				},
				{
					"name": "Rin",
					"text": "How many points?"
				},
				{
					"name": "Arishima",
					"text": "A hundred, definitely. You're better than me. I don't think I can score you anymore."
				},
				{
					"name": "Rin",
					"text": "Yes!"
				},
				{
					"text": "She has the sweetest of smiles on her face."
				},
				{
					"name": "Arishima",
					"text": "You really hate losing, huh?"
				},
				{
					"name": "Rin",
					"text": "Yep!"
				},
				{
					"text": "Rin reaches out for the second fish, cleans off the scales, and starts filleting it."
				},
				{
					"name": "Rin",
					"text": "I didn't ever want to lose to someone who looked at you with so much hate."
				},
				{
					"text": "Rin says, just as she cuts the head off the fish."
				},
				{
					"text": "I stare at it for a moment."
				},
				{
					"name": "Arishima",
					"text": "Why?"
				},
				{
					"text": "She looks back at me."
				},
				{
					"text": "I see a shade of uneasiness tinge her expression."
				},
				{
					"name": "Rin",
					"text": "Why what?"
				},
				{
					"name": "Arishima",
					"text": "I said some horrible things to you that day."
				},
				{
					"name": "Arishima",
					"text": "I was completely out of line, and I hurt you."
				},
				{
					"name": "Arishima",
					"text": "I thought our relationship was over that day."
				},
				{
					"name": "Arishima",
					"text": "But you..."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "She shifts her attention back to the fish, slices its belly open and washes away the innards."
				},
				{
					"name": "Rin",
					"text": "I was really sad that day."
				},
				{
					"name": "Rin",
					"text": "But I understood what you were saying."
				},
				{
					"name": "Rin",
					"text": "You and your ex-wife..."
				},
				{
					"text": "Her knife glides across the fish's back, opening the way to its insides without a sound."
				},
				{
					"name": "Rin",
					"text": "There's no way I can erase the time you spent with her."
				},
				{
					"name": "Rin",
					"text": "That's why I started seeing it as a competition I didn't want to lose."
				},
				{
					"name": "Rin",
					"text": "No matter how silly and childish it was."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She finishes filleting the second fish."
				},
				{
					"name": "Rin",
					"text": "I'm pretty messed up, huh?"
				},
				{
					"text": "She looks back at me."
				},
				{
					"text": "Her smile is defiant and confident."
				},
				{
					"name": "Rin",
					"text": "Almost as weird and messed up as you. Don't you think we're just made for each other?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Right?"
				},
				{
					"text": "I nod in response."
				},
				{
					"text": "Somehow, I feel as though I'm always nodding along with her."
				},
				{
					"text": "The fish Rin prepared are cleaned well and have the perfect texture. Nothing less than absolutely delicious."
				},
				{
					"name": "Arishima",
					"text": "It's really good. I'm amazed by what you can push yourself to achieve just because you don't want to lose."
				},
				{
					"name": "Rin",
					"text": "Mhm."
				},
				{
					"name": "Rin",
					"text": "Really, though, I was worried when you stopped responding to me."
				},
				{
					"name": "Arishima",
					"text": "Oh, sorry about that."
				},
				{
					"name": "Arishima",
					"text": "For not answering, and for yelling at you like that."
				},
				{
					"name": "Arishima",
					"text": "I'm really sorry."
				},
				{
					"name": "Rin",
					"text": "It's fine."
				},
				{
					"text": "Her gentle smile makes me feel like things are gonna be all right."
				},
				{
					"name": "Rin",
					"text": "I know how hurt you felt, too. You laid it all out in your writing."
				},
				{
					"name": "Rin",
					"text": "And you came back, so..."
				},
				{
					"name": "Rin",
					"text": "Back then, when I sent the picture, you were in the bathroom, weren't you?"
				},
				{
					"text": "I nod."
				},
				{
					"text": "I wrote everything in the manuscript that Rin read, even what happened in that bathroom."
				},
				{
					"name": "Rin",
					"text": "My message reached you right before you went through with it, right?"
				},
				{
					"name": "Rin",
					"text": "If I was too early or too late, I'm sure we wouldn't be here right now..."
				},
				{
					"text": "Rin trails off."
				},
				{
					"name": "Rin",
					"text": "It's like we had always been gears grinding against each other..."
				},
				{
					"name": "Rin",
					"text": "But that moment was the first time our gears meshed together."
				},
				{
					"name": "Arishima",
					"text": "You may be right."
				},
				{
					"text": "Our eyes meet."
				},
				{
					"name": "Arishima",
					"text": "That's a beautiful thought. I'll remember that."
				},
				{
					"text": "She blinks slowly and nods."
				},
				{
					"name": "Rin",
					"text": "But..."
				},
				{
					"name": "Arishima",
					"text": "Hm?"
				},
				{
					"name": "Rin",
					"text": "There's a lot to think about now. About the future, I mean."
				},
				{
					"text": "I let out a tired chuckle."
				},
				{
					"name": "Rin",
					"text": "For example, what about your job at the academy?"
				},
				{
					"name": "Arishima",
					"text": "I think they'll let the whole being absent from work without permission thing slide if I grovel a little."
				},
				{
					"name": "Arishima",
					"text": "But putting the moves on a student, that's a whole different matter."
				},
				{
					"text": "She squints her eyes, a little astounded."
				},
				{
					"name": "Rin",
					"text": "Obviously. We don't need to tell anyone about that."
				},
				{
					"text": "I remember the first day I was absent, Watanabe was the one who called."
				},
				{
					"text": "I need to get in touch with him later."
				},
				{
					"text": "No, wait. He's probably in Yakushima right now."
				},
				{
					"text": "Maybe it'd be a bad idea to call him about work in the middle of his vacation."
				},
				{
					"text": "My eyes wander about as I think, but they settle on Rin."
				},
				{
					"name": "Rin",
					"text": "Um..."
				},
				{
					"name": "Arishima",
					"text": "Hm?"
				},
				{
					"name": "Rin",
					"text": "Is your divorce finalized yet?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She avoids my gaze."
				},
				{
					"name": "Arishima",
					"text": "We're still in negotiations. But it's proceeding."
				},
				{
					"name": "Arishima",
					"text": "I actually got an email from my ex-wife's lawyer just now."
				},
				{
					"text": "Her expression goes from relieved to anxious in a moment."
				},
				{
					"name": "Rin",
					"text": "Just now? What did it say?"
				},
				{
					"name": "Rin",
					"text": "Ah, um, if you don't mind talking about it, that is."
				},
				{
					"name": "Arishima",
					"text": "It was about the house we had together."
				},
				{
					"name": "Arishima",
					"text": "It'll become her property. I was notified that I have to vacate it before the month is over."
				},
				{
					"name": "Rin",
					"text": "But why?"
				},
				{
					"name": "Rin",
					"text": "Is it because of what I did in front of her that day?"
				},
				{
					"text": "I slowly shake my head."
				},
				{
					"name": "Arishima",
					"text": "That's got nothing to do with it."
				},
				{
					"name": "Arishima",
					"text": "From the very start, I declared that I was willing to let them take care of the division of property as they saw fit."
				},
				{
					"name": "Arishima",
					"text": "It happened because of me, just like I wrote."
				},
				{
					"text": "Rin nods anxiously."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Shouko may have seen what Rin did as a sign of me being unfaithful."
				},
				{
					"text": "Perhaps she started feeling that there was no need to have mercy on me if we both were cheating on the other."
				},
				{
					"text": "Whatever the case may be, this is all conjecture. I'll just make Rin feel guilty if I mention any of it."
				},
				{
					"text": "She stands up and walks to the bedroom."
				},
				{
					"text": "I can faintly hear her rummaging around on the other side of the wall."
				},
				{
					"text": "After a moment, she comes back and sits down again."
				},
				{
					"text": "And then..."
				},
				{
					"text": "She places a key on the table."
				},
				{
					"text": "Again?"
				},
				{
					"text": "But this isn't the key to Shuho's studio."
				},
				{
					"text": "It's..."
				},
				{
					"name": "Rin",
					"text": "The key to this house."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "For you."
				},
				{
					"name": "Arishima",
					"text": "Rin, I don't think that's..."
				},
				{
					"text": "She shakes her head vehemently."
				},
				{
					"name": "Rin",
					"text": "Why so shy all of a sudden?"
				},
				{
					"name": "Rin",
					"text": "Think of it as helping me be at ease. Take it."
				},
				{
					"name": "Rin",
					"text": "If you don't, I won't be able to stop thinking about that day."
				},
				{
					"name": "Arishima",
					"text": "Should I take this as permission to come and go whenever I want?"
				},
				{
					"text": "She slowly shakes her head."
				},
				{
					"name": "Rin",
					"text": "I'd like you to live here, rather."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She then turns her gaze down to the table."
				},
				{
					"name": "Arishima",
					"text": "Rin, that's..."
				},
				{
					"name": "Rin",
					"text": "It can just be until you find another place to stay. Don't see it as a huge commitment."
				},
				{
					"name": "Rin",
					"text": "Living in a hotel costs money, and it's better than sleeping under some bridge."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I stare at her for a while."
				},
				{
					"name": "Arishima",
					"text": "Man, I'm a failure as a teacher, huh?"
				},
				{
					"text": "I say, shaking my head in defeat."
				},
				{
					"name": "Arishima",
					"text": "I'll look for a place of my own, though. I can't settle in a house that Shuho left for you."
				},
				{
					"text": "A smile comes back to her face."
				},
				{
					"name": "Rin",
					"text": "Then how about just during summer break?"
				},
				{
					"name": "Rin",
					"text": "We'll live together while we write our novels. Does that sound good?"
				},
				{
					"text": "I laugh at myself."
				},
				{
					"text": "We humans don't change that easily, huh?"
				},
				{
					"text": "I'm more and more convinced of this."
				},
				{
					"text": "I took her virginity, thoroughly made love to her for a whole night, and I'm still worried about what people might think."
				},
				{
					"text": "And if I keep trying to appease some imaginary ethical boogeyman, at this point, all I'll do is make her feel lonely."
				},
				{
					"text": "I nod in acceptance of Rin's proposal."
				},
				{
					"name": "Arishima",
					"text": "All right."
				},
				{
					"name": "Arishima",
					"text": "It'll be our very own writing camp."
				},
				{
					"name": "Rin",
					"text": "Yes!"
				},
				{
					"text": "And so, the odd pair started living together."
				},
				{
					"text": "I went back home, packed up the minimal necessities, and brought them back Rin's house."
				},
				{
					"text": "The summer days roll by as we read books and take walks together."
				},
				{
					"text": "After she makes dinner, I wash the dishes and brew coffee for us."
				},
				{
					"text": "We drink coffee and work on our manuscripts before heading to bed and getting on with more pleasurable activities."
				},
				{
					"text": "That's the daily routine we've gotten ourselves into as of late."
				},
				{
					"text": "We didn't feel like going out today, so instead we're working on our laptops side by side."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "Rin's manuscript isn't going so smoothly."
				},
				{
					"text": "I sneak a glance at her."
				},
				{
					"text": "She's looking down the screen, rubbing at her temples in frustration."
				},
				{
					"name": "Rin",
					"text": "Professor?"
				},
				{
					"name": "Arishima",
					"text": "Yes?"
				},
				{
					"text": "I turn to her and wait for her to continue."
				},
				{
					"text": "Her eyes stay glued to the display."
				},
				{
					"name": "Rin",
					"text": "How does one even write a novel?"
				},
				{
					"name": "Arishima",
					"text": "If I knew that, I'd be rich already."
				},
				{
					"text": "She raises her face and looks up at me."
				},
				{
					"name": "Rin",
					"text": "But you can write!"
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Rin",
					"text": "You literally did."
				},
				{
					"name": "Arishima",
					"text": "I wrote something, sure, but that was more a letter than a novel. I'm no good at novels."
				},
				{
					"name": "Arishima",
					"text": "Last time I tried to write, someone told me I couldn't depict people."
				},
				{
					"text": "Rin shrinks back, realization dawning on her face."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "I wish I knew how to write a novel."
				},
				{
					"name": "Rin",
					"text": "I shouldn't have been so arrogant..."
				},
				{
					"name": "Arishima",
					"text": "Hahahah."
				},
				{
					"text": "She stares daggers at me."
				},
				{
					"name": "Rin",
					"text": "What's so funny?"
				},
				{
					"name": "Arishima",
					"text": "Nothing."
				},
				{
					"name": "Arishima",
					"text": "I can't wait to read what you'll come up with."
				},
				{
					"name": "Rin",
					"text": "Why do you have to be so mean?"
				},
				{
					"name": "Rin",
					"text": "Stop it. You're making me too nervous to write anything at all, in case it turns out bad."
				},
				{
					"name": "Rin",
					"text": "Some teacher you are. Aren't you supposed to help the students who are struggling?"
				},
				{
					"name": "Arishima",
					"text": "You're an honor student. No need to treat you with kiddie gloves."
				},
				{
					"name": "Rin",
					"text": "You big meanie!"
				},
				{
					"text": "I laugh again."
				},
				{
					"name": "Arishima",
					"text": "You read lots of books. For a start, how about you try writing something you'd like to read?"
				},
				{
					"name": "Rin",
					"text": "But I'm writing it for you to read."
				},
				{
					"name": "Arishima",
					"text": "So? I want to know what kind of things you like to read."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "Well, I suppose I can hardly talk."
				},
				{
					"name": "Arishima",
					"text": "If that kind of vague advice helped, I would've written my first novel long ago."
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "Books I like, huh? Hmm, what kind of stuff have I read recently..."
				},
				{
					"name": "Rin",
					"text": "I just kinda read without thinking much, so nothing really sticks in my head."
				},
				{
					"name": "Arishima",
					"text": "How about we go to a bookstore?"
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "Going out for a walk is good when you're having a little writer's block."
				},
				{
					"name": "Arishima",
					"text": "And looking at bookshelves filled with different books to your own can be fun."
				},
				{
					"name": "Rin",
					"text": "Right."
				},
				{
					"text": "We decide to hit up our usual bookstore."
				},
				{
					"text": "It's a twenty minute bus ride in the opposite direction from campus."
				},
				{
					"text": "There's basically no one that could recognize us here."
				},
				{
					"text": "We can't go around being too conspicuous in the areas around the campus."
				},
				{
					"name": "Arishima",
					"text": "Remember we're writing for fun, first and foremost. Don't overthink it too much."
				},
				{
					"text": "I turn to her as we walk down the sidewalk, and she giggles."
				},
				{
					"name": "Arishima",
					"text": "What is it?"
				},
				{
					"name": "Rin",
					"text": "I remember saying something similar to you once."
				},
				{
					"name": "Arishima",
					"text": "Oh, yeah."
				},
				{
					"text": "The memory brings another bout of laughter."
				},
				{
					"name": "Arishima",
					"text": "And you were right. Just write whatever comes to you. Don't worry too much. If you wanna sing, then you start by humming."
				},
				{
					"name": "Arishima",
					"text": "Especially for people with your personality type."
				},
				{
					"name": "Rin",
					"text": "Yes, all right."
				},
				{
					"text": "Just like today, we've spent many a summer afternoon in this bookstore."
				},
				{
					"text": "We go our separate ways at the entrance and wander around looking at whatever takes our fancy."
				},
				{
					"text": "If either of us feels like going back, we reunite and go home."
				},
				{
					"text": "And if we find a book that we really want to keep reading, we buy it together."
				},
				{
					"text": "Today, each of us does their personal search."
				},
				{
					"text": "Rin focuses on the \"How to write a novel\" section of a shelf."
				},
				{
					"text": "I keep an eye on her from a distance."
				},
				{
					"text": "I didn't think she'd struggle with creating something to this extent."
				},
				{
					"text": "I'm seeing another side to her."
				},
				{
					"text": "She can be very mature, but also very young in some aspects."
				},
				{
					"text": "Those extremes live in balance inside of her."
				},
				{
					"text": "Not having anything specific in mind, I eye the literature section."
				},
				{
					"text": "In the foreign literature section, there are new books by writers that have been active since I was a student."
				},
				{
					"text": "Now that's dedication."
				},
				{
					"text": "For them, writing for an audience must be some kind of second nature."
				},
				{
					"text": "Even now, they still manage to write interesting stories, and many of their works have been adapted to visual mediums."
				},
				{
					"text": "Their books fly off the shelves like Shuho's."
				},
				{
					"text": "But the difference between a person who is worn down by writing and one who grows with the experience only becomes more marked with time."
				},
				{
					"text": "I move on to the section for new Japanese books."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "There, I spy a familiar name."
				},
				{
					"text": "There are two stacks of different books by the same author."
				},
				{
					"text": "One of them has a sticker that says \"Over 100,000 copies sold! The new Hatano Shuho!\""
				},
				{
					"text": "I take a look at the cover."
				},
				{
					"text": "It wasn't Shuho's name that I spotted, but the one of the actual author."
				},
				{
					"text": "The name of that young writer who was talking at that event back then."
				},
				{
					"text": "One of the books is published by the company Shouko works for."
				},
				{
					"text": "The other one is from a major publisher."
				},
				{
					"text": "The one with the impressive sticker is from the big publisher."
				},
				{
					"text": "I pick up the books and take a look at the colophons."
				},
				{
					"text": "The one from the big publisher is a sixth edition, and the one Shouko was in charge of a first edition."
				},
				{
					"text": "Considering how big a print run for a new author usually is, there's a huge magnitude of difference between them."
				},
				{
					"text": "I idly stare at the cover of the work edited by Shouko."
				},
				{
					"name": "Rin",
					"text": "Professor?"
				},
				{
					"text": "I turn back to see Rin looking at the book besides me."
				},
				{
					"name": "Rin",
					"text": "What's wrong?"
				},
				{
					"name": "Arishima",
					"text": "Ah, uh, nothing."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "Her gaze stops on the sticker on the book, and she seems to realize something when she reads the name of the author on the cover."
				},
				{
					"name": "Rin",
					"text": "Which one did your ex-wife work on?"
				},
				{
					"name": "Arishima",
					"text": "This one."
				},
				{
					"name": "Rin",
					"text": "Mmh..."
				},
				{
					"text": "Rin takes the book from my hand, and reaches out for the one that's still laying on the shelf."
				},
				{
					"name": "Arishima",
					"text": "Ah."
				},
				{
					"name": "Rin",
					"text": "I'll buy them."
				},
				{
					"name": "Arishima",
					"text": "You don't need to..."
				},
				{
					"name": "Rin",
					"text": "Not with my money. I'll use Shuho's royalties."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Isn't this guy supposed to be his replacement?"
				},
				{
					"name": "Rin",
					"text": "Let's read it. I'm kinda curious. Not enough to use my own money, though."
				},
				{
					"text": "Rin takes the books to the register with a slightly intimidating smile that doesn't leave any room for rebuttal."
				},
				{
					"text": "We sit on a park bench near the bookstore and get to reading."
				},
				{
					"text": "First, I read the book my ex-wife edited."
				},
				{
					"text": "Even ignoring the fact that they're a commercially published author, this person is on the up and up, and leagues ahead of me."
				},
				{
					"text": "There's not much to say about the story itself."
				},
				{
					"text": "It's the kind of a story I've read before, in a style I've seen somewhere else."
				},
				{
					"text": "That's all."
				},
				{
					"text": "The publisher deemed it had commercial value and pushed it out."
				},
				{
					"text": "You could say he's doing his job as a novelist well enough."
				},
				{
					"text": "After reading the first fifty or so pages, Rin and I exchange books."
				},
				{
					"text": "The work that apparently sold 100,000 copies is essentially the same as the one with Shouko's editing."
				},
				{
					"text": "It's interesting how he managed to sell so many copies just with the backing of a big publisher."
				},
				{
					"text": "Could it PR? Maybe the title for this one was more attention grabbing?"
				},
				{
					"text": "Again, I read the first 50 pages of the book, and then close it."
				},
				{
					"name": "Rin",
					"text": "How was it?"
				},
				{
					"name": "Arishima",
					"text": "Mmh..."
				},
				{
					"text": "I take a glance at the cover."
				},
				{
					"name": "Arishima",
					"text": "...I guess it's fine."
				},
				{
					"name": "Rin",
					"text": "This author's your ex-wife's lover, right?"
				},
				{
					"name": "Arishima",
					"text": "Probably."
				},
				{
					"name": "Rin",
					"text": "I like your writing way better."
				},
				{
					"text": "I raise my head and look up at her."
				},
				{
					"name": "Arishima",
					"text": "Thanks, that means a lot."
				},
				{
					"name": "Arishima",
					"text": "But he's a professional novelist, and I'm not. I don't have any desire to be one either."
				},
				{
					"name": "Arishima",
					"text": "If we use commercial value as the metric for how successful your writing is, I'm completely beat by him."
				},
				{
					"name": "Arishima",
					"text": "At least, that's what I think."
				},
				{
					"text": "She's staring straight at me."
				},
				{
					"text": "She doesn't nod or shake her head."
				},
				{
					"name": "Arishima",
					"text": "This book my ex-wife edited..."
				},
				{
					"name": "Arishima",
					"text": "I don't know if it sold well or not."
				},
				{
					"name": "Arishima",
					"text": "But on some level, this writer must have responded to what my ex-wife wanted with this work. They probably learned to trust each other by working together, and that brought them closer together."
				},
				{
					"text": "Like we never were, I remind myself."
				},
				{
					"name": "Arishima",
					"text": "The kitchen of... what used to be our house was almost untouched, like no people ever lived in that house."
				},
				{
					"text": "A slight frown touches her lips."
				},
				{
					"name": "Arishima",
					"text": "No one cooked there. It was just a place for me to brew coffee and smoke."
				},
				{
					"name": "Arishima",
					"text": "I... always felt guilty for never meeting my wife's expectations. That's why I never complained or asked anything of her."
				},
				{
					"name": "Arishima",
					"text": "I think what I really wanted was to lead a happy life like everybody else."
				},
				{
					"name": "Arishima",
					"text": "But when I realized my life was going nowhere and I wasn't happy, I just suppressed those feelings."
				},
				{
					"text": "I stop there."
				},
				{
					"name": "Rin",
					"text": "Because you betrayed her expectations?"
				},
				{
					"text": "Facing her, I nod."
				},
				{
					"text": "Then I flip through the book's pages."
				},
				{
					"name": "Arishima",
					"text": "I feel sad reading this. How could I have been so stupid for so many years?"
				},
				{
					"name": "Arishima",
					"text": "If I could have risen to meet her expectations like this, maybe I could have actually made it."
				},
				{
					"name": "Arishima",
					"text": "I suppose that in the end, our marriage didn't amount to much more than the union of a failed writer and an editor with no talent."
				},
				{
					"name": "Arishima",
					"text": "But..."
				},
				{
					"text": "I raise my head and look into Rin's eyes."
				},
				{
					"name": "Arishima",
					"text": "That's in the past now. What happened between me and my ex-wife is just that. Now I'm with you, and I'm happy with the time we have."
				},
				{
					"name": "Arishima",
					"text": "I've got no regrets."
				},
				{
					"text": "We stay silent for a moment, with only the sound of cicadas in the background."
				},
				{
					"text": "I gaze idly out at the people passing by our bench."
				},
				{
					"text": "Eventually, Rin breaks the silence."
				},
				{
					"name": "Rin",
					"text": "Professor."
				},
				{
					"text": "I turn back to her."
				},
				{
					"name": "Rin",
					"text": "Let's go shopping then head home."
				},
				{
					"name": "Arishima",
					"text": "Shopping?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "For dinner."
				},
				{
					"name": "Arishima",
					"text": "Oh, right."
				},
				{
					"text": "We buy the ingredients for dinner at a small supermarket on the way to the bus stop."
				},
				{
					"text": "As we step out of the store and I start to head towards the stop, Rin tugs on my sleeve."
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"name": "Rin",
					"text": "Not that way."
				},
				{
					"text": "She looks up at me, an innocent smile on her face."
				},
				{
					"name": "Rin",
					"text": "We're going to your house today. It's the opposite direction, right?"
				},
				{
					"name": "Arishima",
					"text": "My house?"
				},
				{
					"name": "Rin",
					"text": "You walked there after you got off the bus the day we met, right?"
				},
				{
					"name": "Arishima",
					"text": "Yeah, but..."
				},
				{
					"name": "Rin",
					"text": "I'll make you dinner in that unused kitchen."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "There's no one there, right?"
				},
				{
					"name": "Arishima",
					"text": "Yeah, but next month..."
				},
				{
					"text": "It'll become Shouko's property."
				},
				{
					"text": "I already got the official notice."
				},
				{
					"name": "Rin",
					"text": "But this month it's still your house, right?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "If the kitchen in your house really is as clean as new, I want to use it."
				},
				{
					"name": "Rin",
					"text": "That's okay, right?"
				},
				{
					"name": "Rin",
					"text": "Excuse me."
				},
				{
					"name": "Arishima",
					"text": "Mhm."
				},
				{
					"name": "Rin",
					"text": "Whoa, what a nice place."
				},
				{
					"name": "Rin",
					"text": "The ceiling is pretty high. It feels nice and spacious."
				},
				{
					"name": "Arishima",
					"text": "Come on in. It's nothing too fancy."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"name": "Rin",
					"text": "Can I use the kitchen?"
				},
				{
					"name": "Arishima",
					"text": "That's what we're here for."
				},
				{
					"name": "Rin",
					"text": "Can I use the tableware and everything?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "Go ahead. I get the feeling they're going to the trash sooner rather than later."
				},
				{
					"name": "Rin",
					"text": "All right."
				},
				{
					"text": "I sit at the table and stare idly at her."
				},
				{
					"text": "I had never dreamed that Rin would ever cook in this kitchen."
				},
				{
					"text": "Noticing my gaze, she looks back."
				},
				{
					"name": "Rin",
					"text": "What are you looking at?"
				},
				{
					"name": "Arishima",
					"text": "Nothing. Uh, it just feels kind of strange."
				},
				{
					"name": "Arishima",
					"text": "You cooking in this house."
				},
				{
					"name": "Rin",
					"text": "That's right. A girl who hasn't been alive for even half as long as you is cooking her heart out to make you happy here."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Doesn't that make you the happiest man on Earth?"
				},
				{
					"name": "Arishima",
					"text": "It should be illegal to be this happy. Oh, is that the police on the door?"
				},
				{
					"name": "Rin",
					"text": "Ahahah!"
				},
				{
					"name": "Rin",
					"text": "The night is still young."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Rin lines up dishes up on the table."
				},
				{
					"name": "Rin",
					"text": "I think we've had enough rice for a while, and there would be leftovers, so I made pasta today."
				},
				{
					"text": "She's prepared creamy pasta with mushrooms and salmon, and salad."
				},
				{
					"text": "Plus bowls of clear soup."
				},
				{
					"name": "Arishima",
					"text": "Looks delicious."
				},
				{
					"name": "Rin",
					"text": "Can't eat with only one hand, though."
				},
				{
					"name": "Arishima",
					"text": "You know I don't read when there's good company to share the food with."
				},
				{
					"name": "Rin",
					"text": "Lucky for me!"
				},
				{
					"name": "Arishima",
					"text": "Can I dig in?"
				},
				{
					"name": "Rin",
					"text": "Go right ahead."
				},
				{
					"name": "Arishima",
					"text": "Thanks."
				},
				{
					"text": "I wrap a generous amount of pasta around my fork and bring it to my mouth."
				},
				{
					"text": "I can taste Rin's cooking skill improving with each day."
				},
				{
					"text": "And I'm not too prideful to let her know."
				},
				{
					"name": "Rin",
					"text": "It's because I'm cooking for you. I never really tried when I was cooking for myself."
				},
				{
					"name": "Arishima",
					"text": "I'm the same way. I just ate whatever when I was on my own."
				},
				{
					"name": "Arishima",
					"text": "I think I only started really enjoying meals after we started living together."
				},
				{
					"text": "Rin beams at me."
				},
				{
					"name": "Rin",
					"text": "Is it like the dinner time that you imagined?"
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"name": "Rin",
					"text": "The happy life you must have envisioned when you bought this house."
				},
				{
					"name": "Arishima",
					"text": "Yeah, it's that and much more."
				},
				{
					"name": "Arishima",
					"text": "The food is amazing, and above all..."
				},
				{
					"name": "Arishima",
					"text": "You're with me now. It exceeds whatever I imagined when I got this house."
				},
				{
					"name": "Rin",
					"text": "Not yet."
				},
				{
					"name": "Arishima",
					"text": "Mm?"
				},
				{
					"name": "Rin",
					"text": "When we're done having dinner, we'll take a bath together..."
				},
				{
					"text": "I feel something warm sliding over my thigh."
				},
				{
					"text": "Her toes are sinuously gliding their way between my legs."
				},
				{
					"name": "Rin",
					"text": "Then we'll go the room you and your ex-wife slept in and do it all night long."
				},
				{
					"name": "Rin",
					"text": "All wet from the bath. We're gonna do it like animals until we're too exhausted to keep going."
				},
				{
					"text": "Her touch is setting my nerves on fire."
				},
				{
					"text": "I gulp in anticipation."
				},
				{
					"name": "Rin",
					"text": "I'll make you feel miles better than she ever did. And I'll make you moan louder than she ever could."
				},
				{
					"name": "Rin",
					"text": "I'll make all the wishes you had when you bought this house come true."
				},
				{
					"name": "Rin",
					"text": "Sounds good, doesn't it?"
				},
				{
					"text": "Slowly, she withdraws her feet."
				},
				{
					"text": "Then, with that little mischievous smile of hers curling across her face, she returns to her pasta."
				},
				{
					"text": "After the meal, we wash the dishes together and put the utensils back in their place."
				},
				{
					"name": "Arishima",
					"text": "...Rin."
				},
				{
					"name": "Rin",
					"text": "Mm?"
				},
				{
					"text": "She cocks her head and looks up at me."
				},
				{
					"name": "Arishima",
					"text": "If you wanna make my dreams come true, can we add one more thing to our schedule for tonight?"
				},
				{
					"text": "She quirks the corners of her mouth into a sly smile."
				},
				{
					"name": "Rin",
					"text": "Of course. What do you want to do?"
				},
				{
					"text": "I throw a glance at the living room, and then back at her."
				},
				{
					"name": "Arishima",
					"text": "...I wanna write together."
				},
				{
					"text": "Her eyes widen in surprise."
				},
				{
					"name": "Arishima",
					"text": "It always was a dream of mine. To spend time together like that with the person I love."
				},
				{
					"text": "She smiles sweetly and nods."
				},
				{
					"name": "Rin",
					"text": "Okay, let's do that."
				},
				{
					"name": "Arishima",
					"text": "Thanks."
				},
				{
					"text": "I bring my paper and pens from my room on the second floor."
				},
				{
					"text": "Rin brews us some coffee, and we sit opposite each other."
				},
				{
					"name": "Arishima",
					"text": "Okay, let's decide on a theme and try to write a short story. Something that will fit within about five pages."
				},
				{
					"text": "Rin nods dutifully."
				},
				{
					"name": "Rin",
					"text": "Sounds fun."
				},
				{
					"name": "Arishima",
					"text": "Don't worry about who's gonna read it. Just take it easy and write whatever you want."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"name": "Arishima",
					"text": "Think you can do it?"
				},
				{
					"name": "Rin",
					"text": "I'll try."
				},
				{
					"text": "I nod in response, take a sip of the coffee Rin brewed, and pick up my pen."
				},
				{
					"text": "For a while, she seems deep in thought with her chin resting on the palm of her hand, but she starts writing before long."
				},
				{
					"text": "I glance at her from time to time."
				},
				{
					"text": "She's scribbling furiously. I wouldn't be surprised if she ends up with ten pages."
				},
				{
					"text": "Looks like she's onto something."
				},
				{
					"text": "I go back to my own paper, trying to hide my smile so she doesn't get distracted."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "Done?"
				},
				{
					"text": "Rin nods, blowing out a satisfied breath."
				},
				{
					"text": "I smile at her in response."
				},
				{
					"name": "Rin",
					"text": "It's short, but I finally managed to write something."
				},
				{
					"name": "Arishima",
					"text": "What did you write?"
				},
				{
					"text": "She flashes a meaningful smile at me and makes that look she usually reserves for when we're in bed."
				},
				{
					"name": "Rin",
					"text": "Wanna read?"
				},
				{
					"name": "Arishima",
					"text": "Is the sky blue?"
				},
				{
					"name": "Rin",
					"text": "Will you go easy on your criticism?"
				},
				{
					"name": "Arishima",
					"text": "My baseline will be the first evaluation you gave me."
				},
				{
					"name": "Rin",
					"text": "You're gonna break my heart!"
				},
				{
					"name": "Arishima",
					"text": "I'm pulling your leg. I get it. That's not even the point here. I just wanna read something you wrote, that's all."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"text": "She bashfully presents me with her manuscript."
				},
				{
					"name": "Rin",
					"text": "I showed you mine, so now it's your turn."
				},
				{
					"name": "Arishima",
					"text": "Gladly."
				},
				{
					"text": "I hand her my manuscript."
				},
				{
					"name": "Rin",
					"text": "Spending time together like this is fun, huh?"
				},
				{
					"text": "I nod and begin reading her story."
				},
				{
					"text": "It's about..."
				},
				{
					"text": "A boy and a girl who have lived their entire lives underground, knowing nothing of the world above. One day they encounter a little bird and start to imagine the outside world."
				},
				{
					"text": "It strikes me as an odd story at first."
				},
				{
					"text": "But strangely enough, I'm fascinated by it."
				},
				{
					"text": "I somehow feel like I know this story."
				},
				{
					"text": "It's not a structural resemblance to something like The Blue Bird story. I just somehow get the feeling that I'm very familiar with the world she's depicting here."
				},
				{
					"text": "Perhaps her ability to evoke a landscape is just that impressive."
				},
				{
					"text": "The story ends with the little bird dying, and the two children digging a grave for it in the ground."
				},
				{
					"text": "It reminds me of that empty birdcage in Rin's room."
				},
				{
					"text": "Perhaps this story came from her own personal experiences, just like mine."
				},
				{
					"name": "Rin",
					"text": "Have you finished?"
				},
				{
					"text": "Rin's voice snaps me back to reality."
				},
				{
					"name": "Arishima",
					"text": "Yeah. It's a strange story, and a curious world you created here."
				},
				{
					"name": "Rin",
					"text": "Yeah..."
				},
				{
					"name": "Arishima",
					"text": "However..."
				},
				{
					"name": "Arishima",
					"text": "Your writing made the scenery really vivid in my mind. It was so real, I felt like I knew it from somewhere."
				},
				{
					"name": "Arishima",
					"text": "I really like this story."
				},
				{
					"text": "Her eyes gleam brilliantly."
				},
				{
					"name": "Arishima",
					"text": "Is this really the first time you've written a short story?"
				},
				{
					"name": "Rin",
					"text": "I've tried to write something like it a few times before."
				},
				{
					"name": "Arishima",
					"text": "Figures."
				},
				{
					"text": "She raises her face to look at me."
				},
				{
					"name": "Arishima",
					"text": "It feels like you're used to writing, and..."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "To be honest, I think you're talented. Now I'm looking forward to the end of summer even more."
				},
				{
					"text": "A smile of relief touches her face."
				},
				{
					"text": "I'm not just flattering her, and she seems to know that."
				},
				{
					"text": "Her writing truly has a captivating and genuine nature to it that makes you want to keep reading."
				},
				{
					"text": "It's nothing logical."
				},
				{
					"text": "It's the spark of latent talent."
				},
				{
					"text": "What I feel after reading this..."
				},
				{
					"text": "Is a little similar to what I felt after reading Shuho's story in that seminar anthology."
				},
				{
					"text": "Maybe if I read this back when I was young, I would have been blown away."
				},
				{
					"name": "Rin",
					"text": "It's really good."
				},
				{
					"name": "Arishima",
					"text": "I think you should have more confidence. The pitfall people like you tend to fall into is underestimating yourself more than you should."
				},
				{
					"name": "Arishima",
					"text": "It happens a lot. I think you should be more assertive."
				},
				{
					"name": "Rin",
					"text": "There's such a thing as affinity when it comes to liking a piece of writing, isn't there?"
				},
				{
					"name": "Arishima",
					"text": "That's right."
				},
				{
					"name": "Rin",
					"text": "When you said you liked it, it made me so much happier than if you had said it was good or bad."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Rin",
					"text": "Your story was really fun to read too. Were you writing about this house?"
				},
				{
					"name": "Arishima",
					"text": "Yeah."
				},
				{
					"text": "I wrote a story about an ordinary man who gets his dream home, and lives happily."
				},
				{
					"text": "But in time, younger colleagues than him get nicer houses."
				},
				{
					"text": "Others marry younger and more beautiful brides than his."
				},
				{
					"text": "The ideal life he envisioned suddenly seems small to him, and he becomes completely fascinated by a leaflet promoting a condominium that he finds one day."
				},
				{
					"text": "It's surreal little story that speaks of how society always makes us want more, even to our own detriment."
				},
				{
					"name": "Rin",
					"text": "You really have a cynical bone in there, huh?"
				},
				{
					"name": "Arishima",
					"text": "I guess it's hard not to be when you've spent your time in the shade for so long."
				},
				{
					"name": "Rin",
					"text": "Ahaha! But it adds a touch of personality to what you write. I wouldn't be able to come up with such a satirical take just from this house."
				},
				{
					"name": "Arishima",
					"text": "I guess it's one of the perks of not being that talented. Can't help feeling like I gotta push back against it all."
				},
				{
					"name": "Rin",
					"text": "But tonight you're going far beyond the ideals you had when you bought this house."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "You still have it in you to be this bitter about society?"
				},
				{
					"name": "Arishima",
					"text": "...Nice point."
				},
				{
					"text": "She giggles and nods."
				},
				{
					"name": "Rin",
					"text": "If you're with me, are you gonna go after a prettier girl when they show up?"
				},
				{
					"name": "Arishima",
					"text": "Never."
				},
				{
					"name": "Rin",
					"text": "Ahahah! That's a load off my mind, then."
				},
				{
					"text": "As usual, I'm overwhelmed by her."
				},
				{
					"text": "Rin always knows how to take the initiative between us."
				},
				{
					"name": "Arishima",
					"text": "But, uh..."
				},
				{
					"name": "Arishima",
					"text": "I think you could maybe keep going with this story a little longer, if you like. I think it's a nice thread to follow."
				},
				{
					"name": "Arishima",
					"text": "Think you could write a second part to this?"
				},
				{
					"name": "Rin",
					"text": "Yeah. I think I may have a couple more things to write about for this story."
				},
				{
					"name": "Rin",
					"text": "And I had lots of fun doing it today."
				},
				{
					"name": "Arishima",
					"text": "Me too."
				},
				{
					"text": "Suddenly, her gentle smile..."
				},
				{
					"text": "...fades away."
				},
				{
					"text": "It feels like she's gazing at something deep inside my soul."
				},
				{
					"text": "I meet her gaze with my own."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Her eyes shift, and I notice she's staring at the album I tried to give her once. It's sitting on a shelf behind me."
				},
				{
					"text": "I take a good look at her."
				},
				{
					"text": "Perhaps she's thinking of that picture where my ex-wife and I are smiling together."
				},
				{
					"text": "Silent, I simply gauge her expression."
				},
				{
					"text": "She turns to me and gives me a little smile, a mysterious twinkle in her rose-colored eyes."
				},
				{
					"name": "Rin",
					"text": "How about we take that bath?"
				},
				{
					"text": "Keeping her gaze pinned on me, Rin gets to her feet."
				},
				{
					"name": "Arishima",
					"text": "S-Sure."
				},
				{
					"text": "She walks up to me and gently takes my hand."
				},
				{
					"name": "Rin",
					"text": "Let's go?"
				},
				{
					"text": "I nod as I feel my heart beat faster, and let her lead me by the hand into the bathroom."
				},
				{
					"text": "We strip each other's clothes off and get into the shower, kissing passionately."
				},
				{
					"text": "And after, without even bothering to dry ourselves, we drench the floor on our way to the second floor bedroom, where I push Rin onto the bed with an almost animal impulse."
				},
				{
					"text": "She's lying in the same bed that once belonged to me and Shouko."
				},
				{
					"text": "Rin smiles as she opens herself up for me. The shine of the lights does amazing things to her wet, glistening figure."
				},
				{
					"text": "And just like she said, we spend the whole night making love atop the damp bed until morning comes and we give in to the sweet fatigue, still in a tight embrace."
				},
				{
					"text": "At the end of August, nearing the end of summer break, I get in contact with Watanabe."
				},
				{
					"text": "I get a response from him right away, and I tell him I'd like to talk."
				},
				{
					"text": "He made time for me immediately, and we're supposed to meet in this cafe today."
				},
				{
					"text": "I'm the first to arrive."
				},
				{
					"text": "I sit in the smoking area, and Watanabe shows up by the time I finish my second cig."
				},
				{
					"name": "Arishima",
					"text": "Long time no see."
				},
				{
					"name": "Watanabe",
					"text": "You sure you oughta look so calm? What happened with work? You skipped the end-of-term ceremony, man."
				},
				{
					"text": "I laugh in response."
				},
				{
					"name": "Arishima",
					"text": "Guess I did. I never skipped a class even when I was a student."
				},
				{
					"name": "Watanabe",
					"text": "And you thought it'd be cute to do it when you're a an old moose already?"
				},
				{
					"name": "Arishima",
					"text": "A lot of stuff happened, I suppose."
				},
				{
					"name": "Watanabe",
					"text": "I can imagine."
				},
				{
					"text": "I stare at Watanabe."
				},
				{
					"name": "Watanabe",
					"text": "Well, I imagined you might do something like this, so I can't say it was a huge shock."
				},
				{
					"text": "I nod and spread the divorce papers on the table."
				},
				{
					"text": "So far, they only have my signature on them."
				},
				{
					"name": "Watanabe",
					"text": "So I just gotta write down my name as witness and sign it?"
				},
				{
					"name": "Arishima",
					"text": "Apparently."
				},
				{
					"name": "Watanabe",
					"text": "Okay."
				},
				{
					"text": "Watanabe plucks a ballpoint pen from his bag and proceeds to carefully write and sign his name."
				},
				{
					"text": "It was news to me that you needed a third party to sign divorce papers."
				},
				{
					"text": "I was planning on telling him about the divorce anyway, after things calmed down, so I decided to ask him to be my witness."
				},
				{
					"name": "Arishima",
					"text": "Sorry for asking you to do this out of nowhere."
				},
				{
					"name": "Arishima",
					"text": "You're the only friend I could think of that I could even ask to help me with this."
				},
				{
					"name": "Watanabe",
					"text": "Oh, so I'm your friend? What an honor."
				},
				{
					"name": "Arishima",
					"text": "I wouldn't ask you if you weren't."
				},
				{
					"text": "I fold the now signed divorce papers and put them in my bag."
				},
				{
					"text": "With almost uncannily opportune timing, the waiter comes to take our orders."
				},
				{
					"text": "Watanabe orders iced coffee."
				},
				{
					"name": "Watanabe",
					"text": "So?"
				},
				{
					"text": "He takes a cig out of his chest pocket, lights it up, and pops it into his mouth."
				},
				{
					"name": "Arishima",
					"text": "Mmh?"
				},
				{
					"name": "Watanabe",
					"text": "You've been well?"
				},
				{
					"name": "Arishima",
					"text": "Yeah, I'd say so."
				},
				{
					"name": "Watanabe",
					"text": "Well, you don't sound so cheerful. What is it? Missing the wife already?"
				},
				{
					"name": "Arishima",
					"text": "Not at all."
				},
				{
					"name": "Watanabe",
					"text": "Whoa, ice cold."
				},
				{
					"text": "Watanabe laughs."
				},
				{
					"name": "Watanabe",
					"text": "So, if you need a witness, that means there's no dispute over the mediation and all that, right?"
				},
				{
					"name": "Arishima",
					"text": "You're pretty knowledgeable about this, huh?"
				},
				{
					"name": "Watanabe",
					"text": "I kinda looked it up before coming here."
				},
				{
					"name": "Watanabe",
					"text": "I guess it's good that it's not a messy divorce. Not like I know why you even divorced in the first place."
				},
				{
					"name": "Arishima",
					"text": "Mm... Well, there was a trigger, but I don't think there was one concrete reason."
				},
				{
					"name": "Watanabe",
					"text": "I suppose that's not unheard of."
				},
				{
					"text": "The waiter brings his iced coffee and he begins sipping on it."
				},
				{
					"name": "Arishima",
					"text": "How was Yakushima?"
				},
				{
					"name": "Watanabe",
					"text": "Pretty fun. Ah, sorry. I totally forgot your souvenir."
				},
				{
					"name": "Arishima",
					"text": "Don't sweat it."
				},
				{
					"name": "Watanabe",
					"text": "I'll bring it with me when we're back at work."
				},
				{
					"text": "Watanabe stubs his cigarette out in the ashtray."
				},
				{
					"name": "Watanabe",
					"text": "How about you? You go anywhere?"
				},
				{
					"name": "Arishima",
					"text": "Nah."
				},
				{
					"name": "Watanabe",
					"text": "How about a change of pace, then? Traveling alone could help you feel better."
				},
				{
					"name": "Watanabe",
					"text": "Why not let your hair down a little? Your wife kept you on a pretty tight leash, right?"
				},
				{
					"text": "I give him a bitter smile."
				},
				{
					"text": "Oh, I've already let my hair down plenty. So much so that I may not be fit to be a teacher anymore."
				},
				{
					"text": "I'm living at a student's home, and I'd rather not describe what we get up to every night under the covers."
				},
				{
					"text": "But I've gotta keep quiet about all that, unless I want to lose the little bit of life I have left."
				},
				{
					"name": "Arishima",
					"text": "I had my own kind of fun this summer break, I think."
				},
				{
					"name": "Watanabe",
					"text": "Oh, really? What, you've been writing?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "A lot of stuff happened, but I think life has gotten a lot more bearable. I'm enjoying each day now."
				},
				{
					"text": "Watanabe looks extremely surprised."
				},
				{
					"name": "Watanabe",
					"text": "Whoa, you really needed that divorce, huh?"
				},
				{
					"name": "Arishima",
					"text": "...Yeah."
				},
				{
					"text": "I pay the bill in the end."
				},
				{
					"name": "Watanabe",
					"text": "Thanks, boss."
				},
				{
					"name": "Arishima",
					"text": "Don't worry. I went and called you out of nowhere for this."
				},
				{
					"name": "Watanabe",
					"text": "Oh, by the way, what about your house? You weren't living apart, were you?"
				},
				{
					"name": "Watanabe",
					"text": "Did your wife leave? Or did you?"
				},
				{
					"name": "Arishima",
					"text": "...I think I gave the house away."
				},
				{
					"name": "Arishima",
					"text": "I gave up my right to it and left the house. I don't know if she's living there with her new man or something."
				},
				{
					"name": "Watanabe",
					"text": "Oh, I see. So you're living alone."
				},
				{
					"name": "Arishima",
					"text": "Uh, yeah."
				},
				{
					"name": "Watanabe",
					"text": "Is your new place around here?"
				},
				{
					"name": "Arishima",
					"text": "Yeah, I guess."
				},
				{
					"name": "Watanabe",
					"text": "..."
				},
				{
					"text": "Watanabe's expression turns suspicious, and he frowns."
				},
				{
					"name": "Watanabe",
					"text": "Arishima?"
				},
				{
					"name": "Arishima",
					"text": "What is it?"
				},
				{
					"name": "Watanabe",
					"text": "You're not living alone, are you? You're with someone!"
				},
				{
					"name": "Arishima",
					"text": "I'm alone, I swear."
				},
				{
					"name": "Watanabe",
					"text": "Man, you're such a bad liar. You're not fooling anyone."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Watanabe",
					"text": "So, what kind of person is she? Here I was all worried, and you already have a sweetheart waiting for you!"
				},
				{
					"name": "Watanabe",
					"text": "All you told me was how your ex-wife likes to ride around in fancy new cars and stuff."
				},
				{
					"name": "Arishima",
					"text": "Right..."
				},
				{
					"text": "After thinking for a moment, I figure it's weirder to be so secretive, and decide to tell him the bare bones of the situation."
				},
				{
					"name": "Arishima",
					"text": "I have a partner. She's letting me stay with her while I find a new place."
				},
				{
					"name": "Watanabe",
					"text": "Yeah, right! You sly dog."
				},
				{
					"name": "Arishima",
					"text": "I'm taking it easy. We read books every day and write together. It's a really nice life with her."
				},
				{
					"name": "Watanabe",
					"text": "Huh? That sounds perfect for you. I'm happy for you, man."
				},
				{
					"name": "Arishima",
					"text": "Yeah, I'm pretty happy. I can go drinking whenever, too, so feel free to invite me out anytime."
				},
				{
					"name": "Watanabe",
					"text": "Sounds like a plan!"
				},
				{
					"name": "Arishima",
					"text": "You taking the bus or train?"
				},
				{
					"name": "Watanabe",
					"text": "Train. How about you?"
				},
				{
					"name": "Arishima",
					"text": "Bus, but I can come with you to the station and catch it from there."
				},
				{
					"text": "We start walking to the station."
				},
				{
					"name": "Watanabe",
					"text": "So are you gonna get married again to this mystery lady?"
				},
				{
					"name": "Arishima",
					"text": "Uh..."
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Arishima",
					"text": "I'm not thinking about that right now. I feel like we're just sharing a moment in our lives right now."
				},
				{
					"name": "Arishima",
					"text": "I'm not young enough to fall in love blindly like that. If she finds someone else that's more appropriate for her, I'll leave."
				},
				{
					"name": "Watanabe",
					"text": "So it's someone younger than you, then."
				},
				{
					"name": "Arishima",
					"text": "...Yeah."
				},
				{
					"name": "Watanabe",
					"text": "Whoa, you sure mellowed out. Guess all it took was a divorce!"
				},
				{
					"text": "He sure knows how to make me chuckle."
				},
				{
					"text": "Divorce wasn't all it took, not by a long shot."
				},
				{
					"text": "It took almost killing myself and having someone read all my regret and negative thoughts about life to get me here."
				},
				{
					"text": "But that's something I can't tell even Watanabe."
				},
				{
					"text": "The whole story of the studio, and Shuho's diaries, and how it ended up with me being romantically involved with Rin."
				},
				{
					"text": "As long as I keep working as a teacher, I can't tell anyone about thisat least not until Rin has graduated."
				},
				{
					"name": "Watanabe",
					"text": "Hey, it was nice catching up."
				},
				{
					"name": "Arishima",
					"text": "Same here."
				},
				{
					"name": "Watanabe",
					"text": "You look better now. I'm glad to see some life breathed into those old bones of yours."
				},
				{
					"name": "Watanabe",
					"text": "I seriously thought you might have died when you didn't pick up the phone."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Watanabe has a discerning eye."
				},
				{
					"text": "I never cease to be amazed by him."
				},
				{
					"name": "Arishima",
					"text": "Thanks for the help. I'm living better now."
				},
				{
					"name": "Watanabe",
					"text": "Make sure you keep it that way. See you in September."
				},
				{
					"name": "Arishima",
					"text": "Yeah."
				},
				{
					"name": "Watanabe",
					"text": "Give my regards to that sweet little girlfriend of yours."
				},
				{
					"name": "Arishima",
					"text": "Will do."
				},
				{
					"text": "Watanabe laughs one more time as he leaves for the ticket gate."
				},
				{
					"text": "After seeing him off, I take out my phone and open the message app."
				},
				{
					"text": "I'm heading back."
				},
				{
					"text": "I send a message, and make my way to the bus stop."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "I'm glad it happened when he wasn't around."
				},
				{
					"text": "I tried not to worry about it, but soon enough there won't be any way to hide it."
				},
				{
					"text": "The scents I like have changed as of late."
				},
				{
					"text": "I used to like the smell of coffee, but now I can hardly stand it; I like the smell of oil now, too."
				},
				{
					"text": "I feel drowsy all the time."
				},
				{
					"text": "I've never been in the best of health."
				},
				{
					"text": "I'm used to being sick from something most of the time."
				},
				{
					"text": "I'm used to irregular menstrual cycles."
				},
				{
					"text": "But..."
				},
				{
					"text": "It's never been so late before."
				},
				{
					"text": "I still had an appetite, so I didn't think it was morning sickness."
				},
				{
					"text": "But I vomited a lot today."
				},
				{
					"text": "I looked it up, and the symptoms for morning sickness vary from person to person, but I have all of them."
				},
				{
					"text": "But he always uses contraception."
				},
				{
					"text": "Every day, except the first day we did it."
				},
				{
					"text": "That was the only day he finished inside me."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "I love him, probably more than he imagines."
				},
				{
					"text": "If there's anything I know to be true in my heart, it's that."
				},
				{
					"text": "But..."
				},
				{
					"text": "That's not the problem."
				},
				{
					"text": "I can't even imagine myself becoming a mother."
				},
				{
					"text": "I'm so scared of rejecting my child, like my parents denied my existence throughout my life."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "I was stupid."
				},
				{
					"text": "Maybe I wasn't ready to make love to him, after all."
				},
				{
					"text": "Somewhere in my heart, I thought that only one time wouldn't hurt."
				},
				{
					"text": "No, the desire to connect with him without anything in the way won out in the end."
				},
				{
					"text": "I wanted him to love me more, to go crazy for me."
				},
				{
					"text": "It never occurred to me that I would get pregnant from my very first time."
				},
				{
					"text": "I was so dumb."
				},
				{
					"text": "Why didn't I take the morning after pill?"
				},
				{
					"text": "I was foolish and ignorant."
				},
				{
					"text": "And in the end, my stupidity might end up costing a life."
				},
				{
					"text": "My hands tremble at the thought."
				},
				{
					"text": "Unconsciously, I bring my shivering hands to my stomach."
				},
				{
					"text": "I don't understand why I did that instinctively."
				},
				{
					"text": "Holding my stomach, I sit down."
				},
				{
					"text": "I want this all to be a misunderstanding on my part."
				},
				{
					"text": "A mere coincidence."
				},
				{
					"text": "Yes, it has to be."
				},
				{
					"text": "I keep telling myself that, but the trembling doesn't go away."
				},
				{
					"name": "Arishima",
					"text": "Hey there."
				},
				{
					"name": "Rin",
					"text": "Oh, you're back."
				},
				{
					"text": "I find Rin sitting at the table. She looks up at me and smiles."
				},
				{
					"text": "She's holding her phone in her lap."
				},
				{
					"name": "Arishima",
					"text": "That's odd."
				},
				{
					"name": "Rin",
					"text": "Huh?"
				},
				{
					"name": "Arishima",
					"text": "The phone. I never see you using it, usually."
				},
				{
					"name": "Rin",
					"text": "Oh, really?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Rin",
					"text": "My generation are always on our phones, you know?"
				},
				{
					"name": "Arishima",
					"text": "I'm aware."
				},
				{
					"text": "In the kitchen, I run some water into the kettle."
				},
				{
					"name": "Arishima",
					"text": "Want some coffee?"
				},
				{
					"text": "Rin thinks for a moment, then shakes her head slowly."
				},
				{
					"name": "Rin",
					"text": "I'll pass, thanks."
				},
				{
					"name": "Rin",
					"text": "Was Professor Watanabe well?"
				},
				{
					"name": "Arishima",
					"text": "Yeah, he's as fit as a fiddle."
				},
				{
					"text": "Rin wears a pleasant smile on her face."
				},
				{
					"text": "After dinner, we both sit together to write on our laptops."
				},
				{
					"text": "Ever since we wrote together that night in my old house, she's been hitting the keys at a constant pace."
				},
				{
					"text": "For a while there, she seemed to have gotten into the groove of writing, but recently I've caught her staring at her screen in silence for long stretches of time."
				},
				{
					"name": "Arishima",
					"text": "What's up?"
				},
				{
					"name": "Rin",
					"text": "Huh?"
				},
				{
					"text": "She raises her face from the screen and looks at me."
				},
				{
					"name": "Arishima",
					"text": "Getting writer's block again?"
				},
				{
					"name": "Rin",
					"text": "Oh, no. I'm just thinking how to continue."
				},
				{
					"name": "Arishima",
					"text": "Gotcha."
				},
				{
					"name": "Arishima",
					"text": "You seem to have been going at a good pace so far. How much do you have left?"
				},
				{
					"name": "Rin",
					"text": "I'm wondering the same."
				},
				{
					"name": "Rin",
					"text": "Whatever the case, I'll need to finish it before summer break is over."
				},
				{
					"text": "Rin looks down blankly at her hands on the keyboard."
				},
				{
					"name": "Arishima",
					"text": "What's it about?"
				},
				{
					"text": "At my question, she raises her eyes."
				},
				{
					"name": "Rin",
					"text": "...Someone I've been trying not to think about, I guess."
				},
				{
					"name": "Arishima",
					"text": "I see."
				},
				{
					"text": "It seems that she's using her own experiences as inspiration."
				},
				{
					"text": "Everyone's first work is more or less a projection of him or herself."
				},
				{
					"text": "Perhaps, through her writing, she's looking for answers to questions she hasn't yet resolved within herself."
				},
				{
					"name": "Rin",
					"text": "But I might change my mind and write something else. So I can't let you read it yet."
				},
				{
					"name": "Arishima",
					"text": "No need to rush it. I'll wait for as long as you need."
				},
				{
					"name": "Rin",
					"text": "Yeah, thanks."
				},
				{
					"text": "After that, she turns to her screen and hits the keys for a while, but stops soon after."
				},
				{
					"name": "Arishima",
					"text": "Tomorrow..."
				},
				{
					"name": "Rin",
					"text": "Huh?"
				},
				{
					"name": "Arishima",
					"text": "I'm going to see some places. Summer break's almost over."
				},
				{
					"name": "Rin",
					"text": "Oh..."
				},
				{
					"text": "Her voice lowers to a murmur."
				},
				{
					"text": "I answer with a simple nod."
				},
				{
					"name": "Arishima",
					"text": "It'd be weird if I commuted to work from here."
				},
				{
					"name": "Arishima",
					"text": "There are lots of single rooms to rent. I'm not picky, so I'm sure I can find a nice enough place."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "Her eyes swim about the living room."
				},
				{
					"name": "Arishima",
					"text": "I'll make sure to find something near here. You can come and visit me."
				},
				{
					"name": "Rin",
					"text": "Yeah, I'd like that."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "I let out a huge sigh, and it seems like my soul leaves along with my breath."
				},
				{
					"text": "The moment I saw the result, my heart sank down to my stomach."
				},
				{
					"text": "I simply stare in shock at the two lines."
				},
				{
					"name": "Rin",
					"text": "Why?"
				},
				{
					"text": "I know why, yet I still ask the empty air."
				},
				{
					"text": "If this was just me reaping what I'd sown, it'd be fine."
				},
				{
					"text": "If I was the only one getting hurt, I wouldn't care."
				},
				{
					"text": "But..."
				},
				{
					"text": "I press my hand to my forehead, feeling an imminent migraine coming."
				},
				{
					"text": "I can't have a baby."
				},
				{
					"text": "I can't be a parent."
				},
				{
					"name": "Rin",
					"text": "I'm sorry."
				},
				{
					"text": "The words spill out of my mouth for some reason."
				},
				{
					"text": "I think they're directed at the life inside of me... and to him."
				},
				{
					"text": "If anyone finds out that I'm pregnant with his baby, his whole life will change."
				},
				{
					"text": "He may even come to regret ever meeting me."
				},
				{
					"text": "Just like Hatano Shuho hated the woman that birthed me, he may hate me too."
				},
				{
					"text": "I'm scared."
				},
				{
					"text": "I'm sorry I don't have the courage to be upfront with you."
				},
				{
					"text": "I'm sorry I don't have the courage to tell you..."
				},
				{
					"name": "Rin",
					"text": "I'm sorry..."
				},
				{
					"text": "Among the gynecology and obstetrics centers that I looked up, I found a few that don't require you to register with them."
				},
				{
					"text": "One of them was run by a female doctor."
				},
				{
					"text": "I came out of the west exit of Shinjuku station into an office district, and found the hospital after walking for a while. It was on the fifth floor of a tall building."
				},
				{
					"text": "The doctor had long hair, and her features struck me as very neat and prim."
				},
				{
					"text": "Before I could tell her I wanted an abortion, she put on an ultrasound image of my stomach on the screen."
				},
				{
					"text": "I lay there on the hard examination bed and listened distractedly as she pointed to some little white dots, telling me that's the baby."
				},
				{
					"text": "I stare at the image."
				},
				{
					"text": "Unable to sort out my feelings, tears blurred my view."
				},
				{
					"text": "I was trying to erase this child from the world."
				},
				{
					"text": "I was trying to dispose of it, not even treating it as a life."
				},
				{
					"text": "I was the only one who would mourn it."
				},
				{
					"text": "Lying on the bed, tears rolled down my face."
				},
				{
					"text": "After the ultrasound, the doctor explained the procedure for issuing a pregnancy certificate. As soon as she stopped talking, I told her that I wanted an abortion."
				},
				{
					"text": "I told her that I had no parents and that I couldn't get a consent form from the father. I asked her to book me in for an abortion as soon as possible."
				},
				{
					"text": "She nodded and informed me that it could be done as soon as tomorrow."
				},
				{
					"text": "She explained that, if it's what I want, it's better to abort as soon as possible."
				},
				{
					"text": "But if I change my mind, I'm free to cancel at any point, even on the day of the procedure. She asked me if I understood many times."
				},
				{
					"text": "I interjected with nods and got up from my seat after she was done explaining."
				},
				{
					"text": "She asked me I'd like to take a copy of the sonogram."
				},
				{
					"text": "The doctor got up after me and handed me the photo."
				},
				{
					"text": "It's just a little cluster of white dots contrasting against the black and gray of the background."
				},
				{
					"text": "I trace my fingers over the tiny white blobs. They're so small I would have overlooked them if it wasn't for the doctor being nice enough to mark them with her pen."
				},
				{
					"text": "This little life's whole world is me."
				},
				{
					"text": "I wonder if the woman who gave birth to me also looked at me like this. A little white dot in a sea of dark."
				},
				{
					"text": "What did she think, I wonder."
				},
				{
					"text": "Maybe she thought she could use it to entrap Hatano Shuho."
				},
				{
					"text": "Perhaps that's what she thought."
				},
				{
					"text": "But..."
				},
				{
					"name": "Rin",
					"text": "...She gave birth to me."
				},
				{
					"text": "I can't even recall her voice, but she gave birth to me."
				},
				{
					"text": "The loneliness my parents forced on me has nothing to do with this baby."
				},
				{
					"text": "If I reject them..."
				},
				{
					"text": "I'll become the same as my parents."
				},
				{
					"name": "Rin",
					"text": "Can I..."
				},
				{
					"text": "I..."
				},
				{
					"text": "Can I be a mother to this baby?"
				},
				{
					"text": "I'm tired of walking."
				},
				{
					"text": "My feet hurt like hell."
				},
				{
					"text": "I visited three real estate agents and was shown seven apartments."
				},
				{
					"text": "It took me all damn day in the end."
				},
				{
					"text": "Now that I think about it, I haven't been out for a full day all summer long."
				},
				{
					"text": "Since I'm spending the summer together with Rin, we should have gone on a trip somewhere."
				},
				{
					"name": "Arishima",
					"text": "So they were pretty much the same when it came to amenities, but I never noticed before how much the thickness of the walls can change the ventilation and feeling a room has."
				},
				{
					"name": "Arishima",
					"text": "Given my budget, I may as well go for one of those instead of a high-rise."
				},
				{
					"name": "Arishima",
					"text": "High-rise apartments have such low ceilings to hide all the steel beams, and I like high ceilings because they help the place feel less cramped."
				},
				{
					"name": "Rin",
					"text": "Oh, is that so?"
				},
				{
					"name": "Arishima",
					"text": "They also recommended something called weekly apartments. The procedure to rent one is easy, you don't need a lot of paperwork, and you can just give a down payment and not worry about annual income checks and all that."
				},
				{
					"text": "I triumphantly dump all the house hunting knowledge I acquired today on Rin while she's preparing stuff in the kitchen."
				},
				{
					"text": "She listens to all of it with a sweet smile on her face."
				},
				{
					"name": "Arishima",
					"text": "And that was my day. How was yours? Do anything fun?"
				},
				{
					"name": "Rin",
					"text": "Shopping. I wanted to cook a proper meal for a change."
				},
				{
					"name": "Arishima",
					"text": "Oh? But you always cook properand deliciousmeals."
				},
				{
					"name": "Rin",
					"text": "Oh, you know that's not true. I know I don't usually make a big, fancy spread, but I splurged a little today."
				},
				{
					"name": "Arishima",
					"text": "We celebrating something?"
				},
				{
					"name": "Rin",
					"text": "No, not really. I just feel a little peckish today."
				},
				{
					"name": "Arishima",
					"text": "Huh? That's a surprise."
				},
				{
					"name": "Rin",
					"text": "Really?"
				},
				{
					"name": "Arishima",
					"text": "A welcome surprise, to be sure."
				},
				{
					"text": "She lived up to her word."
				},
				{
					"text": "A bunch of fancy looking dishes are lined up on the table today."
				},
				{
					"text": "There's medium rare steak slices, mashed potatoes, bean soup, and a bowl of salad."
				},
				{
					"text": "Even baguettes and butter."
				},
				{
					"name": "Arishima",
					"text": "Whoa, this really is a feast."
				},
				{
					"name": "Rin",
					"text": "Right?"
				},
				{
					"name": "Rin",
					"text": "Don't you think you could go out with no regrets if this was our last supper?"
				},
				{
					"text": "Rin says, as she sits in front of me."
				},
				{
					"text": "That comment makes me think for a moment."
				},
				{
					"name": "Rin",
					"text": "Well, our summer together isn't over just yet."
				},
				{
					"name": "Arishima",
					"text": "Right."
				},
				{
					"name": "Arishima",
					"text": "Our summer isn't over until we read each other's work."
				},
				{
					"name": "Rin",
					"text": "I'll try my best."
				},
				{
					"name": "Rin",
					"text": "Let's dig in."
				},
				{
					"text": "I nod and bring a spoonful of beans to my mouth."
				},
				{
					"text": "I notice that Rin doesn't drink any coffee after dinner today either."
				},
				{
					"text": "I'm the only one drinking it."
				},
				{
					"text": "After we're done with dinner, we settle down to write on our laptops again."
				},
				{
					"text": "I'm currently revising my second draft."
				},
				{
					"text": "After all that thinking yesterday, it seems she's finally continuing her story today."
				},
				{
					"name": "Arishima",
					"text": "Looks like..."
				},
				{
					"name": "Rin",
					"text": "Hm?"
				},
				{
					"text": "When she stops typing for a moment, I get her attention."
				},
				{
					"name": "Arishima",
					"text": "Looks like you made up your mind."
				},
				{
					"name": "Rin",
					"text": "Really?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "Feel like you can write now?"
				},
				{
					"name": "Rin",
					"text": "Yeah."
				},
				{
					"name": "Rin",
					"text": "I feel like I know exactly what I need to do now."
				},
				{
					"name": "Arishima",
					"text": "That's good."
				},
				{
					"text": "She smiles at me."
				},
				{
					"name": "Arishima",
					"text": "Summer break's almost over."
				},
				{
					"name": "Rin",
					"text": "Mm?"
				},
				{
					"name": "Arishima",
					"text": "Why don't we go somewhere?"
				},
				{
					"name": "Rin",
					"text": "Somewhere?"
				},
				{
					"name": "Arishima",
					"text": "I mean, we haven't gone out much. It feels like kind of a waste of a good vacation."
				},
				{
					"name": "Arishima",
					"text": "If you have anywhere you'd like to go, let's do it."
				},
				{
					"name": "Arishima",
					"text": "Our last outing was in Sakuragicho, and I think I'd like to replace those memories with something more fun."
				},
				{
					"name": "Rin",
					"text": "Ahahah, yeah."
				},
				{
					"name": "Arishima",
					"text": "We can leave tomorrow, if you want. How about it?"
				},
				{
					"text": "She thinks for a moment."
				},
				{
					"name": "Rin",
					"text": "Going on a trip does sound fun..."
				},
				{
					"text": "There's a glint of sadness in her smile."
				},
				{
					"name": "Arishima",
					"text": "You have other plans?"
				},
				{
					"text": "Rin stares into my eyes."
				},
				{
					"text": "Then she slowly shakes her head."
				},
				{
					"name": "Rin",
					"text": "I'm not going anywhere. This is where I want to be."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "It's a nice idea, but we don't need to do anything special. I just want to be together at home, just like we've been this whole time."
				},
				{
					"name": "Arishima",
					"text": "You sure?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "I mean, when summer break is over..."
				},
				{
					"text": "Her gaze wanders in the space between the two of us."
				},
				{
					"name": "Rin",
					"text": "When it's over, all these summer days will become precious memories, right?"
				},
				{
					"name": "Rin",
					"text": "That's why... I want to stay like this."
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Arishima",
					"text": "All right. Then we stay like this. Tomorrow, and the day after that."
				},
				{
					"name": "Rin",
					"text": "Yes."
				},
				{
					"text": "Rin is aware that the time we're sharing is going to end."
				},
				{
					"text": "And she's right that our lives will probably change as soon as the next semester starts."
				},
				{
					"text": "Right now we're in our little period of grace."
				},
				{
					"text": "If we're to build a truly strong bond, we must learn to coexist while also living our separate lives."
				},
				{
					"text": "Now, whether we'll be able to do that will be tested when summer break is over."
				},
				{
					"text": "We spent the last days of August in the same manner."
				},
				{
					"text": "We read, wrote, and lived together in the same space."
				},
				{
					"text": "We went about our activities, safe in each other's presence. And so, those dreamlike days flew by."
				},
				{
					"text": "And now, it's the last day of August."
				},
				{
					"text": "The last day of our summer break."
				},
				{
					"name": "Arishima",
					"text": "Here's mine."
				},
				{
					"name": "Rin",
					"text": "What kind of story is it?"
				},
				{
					"name": "Arishima",
					"text": "It's about a middle-aged man who decides he wants to run a marathon. The story is about the little changes you can see in yourself when you put in the effort, and the hope they bring."
				},
				{
					"name": "Arishima",
					"text": "I think it's plain, simple, and doesn't really stand out from the crowd..."
				},
				{
					"name": "Arishima",
					"text": "But at least I mustered up the courage and patience to write even a shoddy little piece like this. Took me long enough."
				},
				{
					"text": "I finish that last sentence with a little chuckle."
				},
				{
					"name": "Arishima",
					"text": "If I started sooner, maybe I could've been earning my current salary from writing."
				},
				{
					"text": "Rin nods, a little smile touching her lips."
				},
				{
					"text": "I wait for her to say something."
				},
				{
					"text": "As for her..."
				},
				{
					"text": "I see no laptop or papers in her hands."
				},
				{
					"name": "Rin",
					"text": "I..."
				},
				{
					"name": "Rin",
					"text": "Couldn't write anything in the end."
				},
				{
					"name": "Rin",
					"text": "I lost the summer battle."
				},
				{
					"text": "My eyes widen in surprise."
				},
				{
					"name": "Arishima",
					"text": "But I saw you writing? I thought you had the rest of it planned out."
				},
				{
					"name": "Rin",
					"text": "Still, I couldn't write it all the way to the end. Not yet."
				},
				{
					"name": "Arishima",
					"text": "Oh, I see."
				},
				{
					"name": "Rin",
					"text": "But I'll complete it someday."
				},
				{
					"name": "Rin",
					"text": "When I do, will you read it?"
				},
				{
					"text": "I give her a firm, deep nod."
				},
				{
					"name": "Arishima",
					"text": "I'd love to read it."
				},
				{
					"text": "She smiles at me."
				},
				{
					"text": "Then she turns to look at my manuscript."
				},
				{
					"name": "Rin",
					"text": "I didn't finish mine, but can I read yours?"
				},
				{
					"text": "I nod and present it to her."
				},
				{
					"name": "Arishima",
					"text": "Of course. I wrote this for you."
				},
				{
					"name": "Rin",
					"text": "I'm so happy."
				},
				{
					"text": "She reads my manuscript until night falls."
				},
				{
					"name": "Rin",
					"text": "It's such a refreshing story. Perfect for summer."
				},
				{
					"name": "Rin",
					"text": "It's completely different from the things you're written so far."
				},
				{
					"name": "Arishima",
					"text": "Uh, it's kind of hard to put into words, but I suppose I didn't go as hard with this one."
				},
				{
					"name": "Arishima",
					"text": "It just kinda let myself write naturally. It's been a long time since I last had that experience."
				},
				{
					"name": "Rin",
					"text": "Yeah, I can feel that."
				},
				{
					"name": "Rin",
					"text": "Of the pieces you've written, I think this is the one I'd like to keep reading again and again."
				},
				{
					"name": "Arishima",
					"text": "Well, I don't think there's much to get out of it from rereads. You probably won't come out thinking any different from it."
				},
				{
					"text": "Upon hearing that, Rin smiles again."
				},
				{
					"name": "Rin",
					"text": "I guess we have no regrets left from this summer."
				},
				{
					"name": "Arishima",
					"text": "I have one. I couldn't read your story."
				},
				{
					"name": "Arishima",
					"text": "That's one huge regret."
				},
				{
					"name": "Rin",
					"text": "I'm very sorry about that."
				},
				{
					"text": "I laugh, and she keeps on smiling."
				},
				{
					"name": "Rin",
					"text": "I'll do my best so you can read it someday."
				},
				{
					"name": "Arishima",
					"text": "Write it at your own pace. You gotta walk if you wanna run."
				},
				{
					"name": "Arishima",
					"text": "Though I'm just repeating your words."
				},
				{
					"name": "Rin",
					"text": "Hah. People who've never written anything always say the most insensitive things, huh?"
				},
				{
					"name": "Arishima",
					"text": "You bet."
				},
				{
					"text": "Our laughter fills the room."
				},
				{
					"text": "On that last night of our summer vacation, we make love one more time. We seek each other quietly, lovingly."
				},
				{
					"text": "Afterwards, we lie on the bed together, the room comfortably cool from the air conditioner. I fall into a deep sleep while stroking Rin's head."
				},
				{
					"text": "And that night, I have a strange dream."
				},
				{
					"text": "I dream about a girl. A beautiful girl with white hair just like Rin's."
				},
				{
					"text": "The girl lived in a room much like Shuho's studio."
				},
				{
					"text": "The little studio has a completely different atmosphere from Shuho's, though."
				},
				{
					"text": "It's almost as if her will to live just exuded from every little thing."
				},
				{
					"text": "I stroke Rin's head while I stare at that slightly familiar scenery in the border between waking and sleep."
				},
				{
					"name": "Rin",
					"text": "Mmh..."
				},
				{
					"text": "Rin wakes up and rests her cheek on my chest."
				},
				{
					"name": "Arishima",
					"text": "I had a strange dream."
				},
				{
					"name": "Rin",
					"text": "A dream?"
				},
				{
					"name": "Arishima",
					"text": "A girl that looked like you was writing a novel on her own."
				},
				{
					"name": "Rin",
					"text": "A novel..."
				},
				{
					"name": "Arishima",
					"text": "Yeah... I think she was writing about us."
				},
				{
					"name": "Rin",
					"text": "In a place that looked a lot like Shuho's studio."
				},
				{
					"text": "I shift my gaze down to her."
				},
				{
					"text": "Her upturned eyes are aimed straight at my face."
				},
				{
					"name": "Rin",
					"text": "I think we had the same dream."
				},
				{
					"name": "Arishima",
					"text": "Oh."
				},
				{
					"name": "Arishima",
					"text": "Well, I suppose there's a first time for everything."
				},
				{
					"name": "Rin",
					"text": "I know how she feels writing that novel."
				},
				{
					"name": "Arishima",
					"text": "You do?"
				},
				{
					"name": "Rin",
					"text": "The feeling of wanting your loved one to read it..."
				},
				{
					"name": "Rin",
					"text": "And at the same time, the fear of laying yourself bare."
				},
				{
					"name": "Rin",
					"text": "She's been struggling with those feelings for so long."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "For her, that novel is... a pure depiction of her deepest emotions. A story from the heart that tells more about her than a diary ever could."
				},
				{
					"name": "Rin",
					"text": "And she's lost. Wondering if she should show that to the man she loves."
				},
				{
					"name": "Arishima",
					"text": "What does she do in the end?"
				},
				{
					"name": "Rin",
					"text": "I don't know."
				},
				{
					"text": "She looks up at me."
				},
				{
					"name": "Rin",
					"text": "I woke up in the middle of the dream."
				},
				{
					"text": "I give her a little nod and stroke her hair again."
				},
				{
					"name": "Arishima",
					"text": "What would you do?"
				},
				{
					"name": "Rin",
					"text": "Me?"
				},
				{
					"name": "Arishima",
					"text": "Would you give that story depicting yourself to the person you love?"
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "She takes a deep, silent breath."
				},
				{
					"text": "I keep on softly stroking her hair."
				},
				{
					"name": "Rin",
					"text": "If I could write it, I'm sure I would."
				},
				{
					"name": "Arishima",
					"text": "I see."
				},
				{
					"text": "When that happens..."
				},
				{
					"text": "Will the person she loves be me?"
				},
				{
					"text": "Or someone not even she knows yet?"
				},
				{
					"text": "Whichever it ends up being is fine by me."
				},
				{
					"text": "As long as she's happy."
				},
				{
					"text": "As I stroke her hair and sort through my thoughts, the sweet embrace of sleep wraps around us both."
				},
				{
					"name": "Arishima",
					"text": "I'll go first."
				},
				{
					"text": "Rin nods."
				},
				{
					"text": "It's still really early to go, but we can't arrive on campus together."
				},
				{
					"text": "There are some cafes that open early at the station."
				},
				{
					"text": "I'll go kill some time in one of them."
				},
				{
					"text": "I rented a weekly apartment near the academy and have decided to commute from there to work until I find a more permanent place."
				},
				{
					"text": "I had the feeling that if I didn't find a place by the time the new term started, I would end up settling down in Rin's place for good."
				},
				{
					"name": "Arishima",
					"text": "Can I come over during the weekends?"
				},
				{
					"text": "Rin smiles and nods."
				},
				{
					"name": "Arishima",
					"text": "...I'm feeling really sad."
				},
				{
					"name": "Arishima",
					"text": "I had the best summer in my life thanks to you."
				},
				{
					"name": "Arishima",
					"text": "If I hadn't met you..."
				},
				{
					"text": "Rin waits for me to continue, looking slightly surprised."
				},
				{
					"name": "Arishima",
					"text": "I would have just kept spending my summers doing nothing with my life."
				},
				{
					"name": "Arishima",
					"text": "Thinking of that really scares me."
				},
				{
					"name": "Arishima",
					"text": "I'm so glad that we met."
				},
				{
					"text": "The corners of her mouth turn up into a small, relieved smile."
				},
				{
					"name": "Rin",
					"text": "Aw, stop it. You're making it sound like we won't see each other ever again."
				},
				{
					"name": "Arishima",
					"text": "Can you tell how hard I'm trying to stall for time?"
				},
				{
					"name": "Arishima",
					"text": "I don't want our summer together to end. That's how much I loved living together."
				},
				{
					"name": "Rin",
					"text": "Yeah. I feel the same."
				},
				{
					"name": "Arishima",
					"text": "Thank you. For everything."
				},
				{
					"name": "Rin",
					"text": "...Yes."
				},
				{
					"name": "Arishima",
					"text": "See you."
				},
				{
					"text": "Rin nods."
				},
				{
					"text": "With painful reluctance, I turn my back on Rin's home and close the door on my way out."
				},
				{
					"text": "The moment the door closes, the tears begin flooding down my face with the intensity of a broken dam."
				},
				{
					"text": "My legs simply give out beneath me, and I sink down onto the floor."
				},
				{
					"name": "Rin",
					"text": "Uuuh... *Sob*"
				},
				{
					"text": "Why am I like this?"
				},
				{
					"text": "Why couldn't I believe in him? Why couldn't I let myself depend on him?"
				},
				{
					"text": "In the end, I'm not qualified to become anyone's mother."
				},
				{
					"text": "I couldn't put my ego aside in front of him."
				},
				{
					"text": "I don't want to take away his life."
				},
				{
					"text": "I don't want to become a shackle on him."
				},
				{
					"text": "I'm scared. The thought of him hating me is too much."
				},
				{
					"text": "His heart healed. He's stronger now."
				},
				{
					"text": "He'll be fine without me."
				},
				{
					"text": "I won't ever forget the summer we shared."
				},
				{
					"text": "That's why..."
				},
				{
					"text": "Please, forget about me."
				},
				{
					"text": "I'll remember for the both of us, so please forget."
				},
				{
					"text": "I left the house with a little time to spare, still dressed as I had been when I saw the teacher off."
				},
				{
					"text": "I walk through the city after the waves of students heading to school have died down."
				},
				{
					"text": "Over the past summer, I've grown to like this city a little more."
				},
				{
					"text": "The caf where I had my first meal with my teacher and the fish shop where he remembered my face are part of this city."
				},
				{
					"text": "I don't know why I hadn't noticed it before."
				},
				{
					"text": "It was a nice town, this place."
				},
				{
					"text": "I'm glad I finally realized that."
				},
				{
					"text": "The days I spent with my teacher made me realize that I was still a young child."
				},
				{
					"text": "No matter how tall you are."
				},
				{
					"text": "No, the taller she was, the more her infancy seemed to stand out."
				},
				{
					"text": "All of my daily necessities fit into this small carrying case."
				},
				{
					"text": "I wonder if this is the weight of my life to date."
				},
				{
					"text": "With these thoughts in mind, I pulled my light carry-on case and headed for the station."
				},
				{
					"text": "I walked to the end of the platform, which was sparsely populated."
				},
				{
					"text": "Across the railroad tracks and over the fence, I can see the city of Yumemi, where I have lived until today."
				},
				{
					"text": "I stared blankly at the city and the flow of people walking through it."
				},
				{
					"text": "At that moment, I clearly felt that I was no longer a resident of that city."
				},
				{
					"text": "They were people I didn't know, walking in a city where I didn't exist."
				},
				{
					"text": "There is no place for me in this city anymore."
				},
				{
					"text": "It was my choice. I didn't feel lonely."
				},
				{
					"text": "From a distance, I could hear the sound of a train running."
				},
				{
					"text": "It was the sound of a train carrying me and my child to the next city."
				},
				{
					"text": "I put my hand over my stomach."
				},
				{
					"text": "I smile, tears running down my face."
				},
				{
					"text": "My hands are warm."
				},
				{
					"text": "The one thing giving me peace is the child growing inside of me."
				},
				{
					"text": "I..."
				},
				{
					"text": "I don't want to throw away my life like my father did."
				},
				{
					"text": "I don't want to be a parent like that."
				},
				{
					"text": "My parents left me unbearable loneliness and unspent money."
				},
				{
					"text": "Wealth beyond anything I could ever accomplish."
				},
				{
					"text": "Regardless of whether I want it or not, I have to live with it."
				},
				{
					"text": "But I can use it to protect this baby."
				},
				{
					"text": "I made up my mind."
				},
				{
					"text": "I'll raise this baby myself."
				},
				{
					"text": "I feel happy, overcome with a feeling that I can only assume is motherhood enveloping me."
				},
				{
					"text": "It makes me feel like I can become whole."
				},
				{
					"text": "I'm not alone anymore."
				},
				{
					"text": "Having something to protect, I find meaning in life for the first time."
				},
				{
					"text": "Yes..."
				},
				{
					"text": "It's thanks to him. He saved me."
				},
				{
					"text": "Having this baby inside me made me stronger."
				},
				{
					"name": "Rin",
					"text": "...I'll be strong. We'll make it."
				},
				{
					"text": "I mutter to myself, gently stroking my stomach."
				},
				{
					"text": "The train comes into the platform, blocking the view of the city I'm leaving."
				},
				{
					"text": "The doors slide open. I stop for a moment, then shake my head."
				},
				{
					"text": "And then, I step into the train."
				}
			]
		},
		{}
	]
}