{
	"scenes": [
		{},
		{
			"texts": [
				{
					"text": "We have three more days of class left in the semester, including today."
				},
				{
					"text": "After that, the graduation ceremonies will be held at the start of next week."
				},
				{
					"text": "As the week goes by, the only thing I look forward to is dinner with Rin every night."
				},
				{
					"text": "Also, I'm finally seeing an end to the number of diaries that Shuho left behind."
				},
				{
					"text": "The mountain of already read diaries is far bigger than what I have left."
				},
				{
					"text": "Soon..."
				},
				{
					"text": "Soon his death will come."
				},
				{
					"text": "How did he portray himself just before the end?"
				},
				{
					"text": "How did he express his state of mind?"
				},
				{
					"text": "I'll decide what I want to write after reading all of his diaries."
				},
				{
					"text": "Do I want to fix the novel that Rin pushed back, or write something completely different?"
				},
				{
					"text": "I'm trying not to think about that right now."
				},
				{
					"text": "I'm focusing all of my attention on capturing the man that Hatano Shuho really was."
				},
				{
					"text": "To be honest, I wish I could spend every waking minute poring over his words."
				},
				{
					"text": "I just want to take a deep dive into his mind and understand the depths of him."
				},
				{
					"text": "But still, I come here every day."
				},
				{
					"text": "Each morning, I grapple with the self hatred I feel and despair at the fact that I still haven't changed."
				},
				{
					"text": "I stop by home."
				},
				{
					"text": "I'll be staying in Shuho's studio for the next three days."
				},
				{
					"text": "I want to do something similar to what he did, living and working in that cramped space."
				},
				{
					"text": "I pull my dusty duffel bag out of the closet and pack a few changes of clothes."
				},
				{
					"text": "Rather that staying cooped up in this dead house, I'd rather be in that studio."
				},
				{
					"text": "I can't even breathe comfortably in this place anymore."
				},
				{
					"text": "The scent of death is more marked the deeper I read into his diaries."
				},
				{
					"text": "Perhaps that's only because I already know he dies at the end."
				},
				{
					"text": "...No."
				},
				{
					"text": "Not quite."
				},
				{
					"text": "All of us are dying."
				},
				{
					"text": "Whether we're aware of it or not."
				},
				{
					"text": "But how conscious are we of our imminent demise?"
				},
				{
					"text": "That's the problem."
				},
				{
					"text": "Shuho was definitely heading towards death, by his own hand."
				},
				{
					"text": "Knowing that death lay ahead, he kept on walking straight onward."
				},
				{
					"text": "And it can be felt in his writing."
				},
				{
					"text": "The grim impression I get from his writing is at its peak now that those intentions are at the forefront."
				},
				{
					"text": "It can't be compared to any of his novels."
				},
				{
					"text": "If I think of those diaries as part of his bibliography, his death would be the grand finale."
				},
				{
					"text": "How did Shuho arrive at this point?"
				},
				{
					"text": "How did he lose all possible roads besides death?"
				},
				{
					"text": "I want to see it."
				},
				{
					"text": "I grab my bag and leave the room."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I look back at the quiet house."
				},
				{
					"text": "That used to be my home."
				},
				{
					"text": "Now I can barely stand to be there."
				},
				{
					"text": "Everyday I come back here..."
				},
				{
					"text": "And I feel like this isn't the place I belong."
				},
				{
					"text": "I feel itchy and wrong."
				},
				{
					"text": "This isn't my home."
				},
				{
					"text": "Now that I'm aware of it, it's painful to remain."
				},
				{
					"text": "For a moment, a thought crosses my mind."
				},
				{
					"text": "Perhaps this is the last time I'll ever come here."
				},
				{
					"text": "It's an alluring delusion on my part."
				},
				{
					"text": "This could be it. I could abandon the boring tedium of daily life and go somewhere to never return."
				},
				{
					"text": "Maybe beyond that, I could meet the same fate as Shuho..."
				},
				{
					"text": "Or a calm and sweet daily life with Rin."
				},
				{
					"text": "I turn my back on the empty house, the thoughts cycling through my mind as I walk on ahead."
				},
				{
					"text": "I put my bag on the floor and sit at Shuho's desk like usual."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "My heart feels at ease again."
				},
				{
					"text": "It feels very much like smoking a cigarette after a long while without one."
				},
				{
					"text": "I chuckle to myself."
				},
				{
					"text": "\"Didn't you hate Hatano Shuho?\""
				},
				{
					"text": "That's what my ex-wife said to me."
				},
				{
					"text": "Now I'm addicted to his writing."
				},
				{
					"text": "No, I'm enthralled by the person himself."
				},
				{
					"text": "I start reading from where I left off yesterday."
				},
				{
					"text": "Shuho himself seemed to be addicted to the bafflement he caused in those around him."
				},
				{
					"text": "I chuckle at myself again."
				},
				{
					"text": "We're becoming closer, little by little."
				},
				{
					"text": "At first I was taken aback by his almost childish impulsiveness, but now even that attitude from Shuho seems sacred."
				},
				{
					"text": "To think that someone with such huge influence would use it on such trivial things."
				},
				{
					"text": "It makes his innocence stand out all the more, and it seems to me his devoted followers, faithfully going along with every whim, were performing some kind of ritual."
				},
				{
					"name": "Arishima",
					"text": "I see."
				},
				{
					"text": "I understand how he felt now."
				},
				{
					"text": "This was his way to free himself from the yoke of society."
				},
				{
					"text": "I take a deep breath and turn the page."
				},
				{
					"text": "\"I'm freeing myself from the yoke of society.\""
				},
				{
					"text": "It's written right there."
				},
				{
					"text": "The very same sentence I was thinking of is right there on the page."
				},
				{
					"text": "Out of pure surprise, I check the cover."
				},
				{
					"text": "This is Shuho's diary."
				},
				{
					"text": "It's not mine."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I crack a smile."
				},
				{
					"text": "...I'm so happy."
				},
				{
					"text": "This feels so good."
				},
				{
					"text": "Shuho and I are of one mind right now."
				},
				{
					"text": "Perhaps the smile on my face isn't mine. Maybe it's Shuho's."
				},
				{
					"text": "I lovingly trace my fingers across his words."
				},
				{
					"text": "It feels strangely nostalgic."
				},
				{
					"text": "Like I can touch his mind through the faint memories in this writing."
				},
				{
					"text": "A warm feeling fills my chest."
				},
				{
					"text": "But it's not enough yet."
				},
				{
					"text": "I need to show this to the world."
				},
				{
					"text": "My heart is one with his, but I remain chained to the yoke he sought to fight off."
				},
				{
					"text": "\"I must fight it off.\""
				},
				{
					"text": "That's what's written on the paper."
				},
				{
					"text": "Again and again, filling the whole page."
				},
				{
					"name": "Arishima",
					"text": "Fight it off..."
				},
				{
					"text": "I mutter the words."
				},
				{
					"text": "If that's what he says..."
				},
				{
					"text": "They're also my words."
				},
				{
					"name": "Arishima",
					"text": "...I must fight it off."
				},
				{
					"text": "This time, I say it clearly in my own words."
				},
				{
					"text": "That's it."
				},
				{
					"text": "Fight it off."
				},
				{
					"text": "That's what it's all about."
				},
				{
					"text": "You fight it off."
				},
				{
					"text": "I receive the usual invitation from Rin and go down to the entrance."
				},
				{
					"text": "And just like always, she's already waiting for me."
				},
				{
					"name": "Arishima",
					"text": "Hey there."
				},
				{
					"name": "Rin",
					"text": "Hello."
				},
				{
					"text": "Recently, we've been going grocery shopping together, then eating the food she makes at her place."
				},
				{
					"name": "Rin",
					"text": "How about we go to the shopping district today?"
				},
				{
					"name": "Rin",
					"text": "I don't think we'll happen across any familiar faces if we go to the same area as that diner we went to before."
				},
				{
					"text": "I respond with a hearty nod."
				},
				{
					"name": "Arishima",
					"text": "Yeah, let's do that."
				},
				{
					"text": "We visit a shopping district pretty far away from campus."
				},
				{
					"text": "We walk side by side."
				},
				{
					"name": "Rin",
					"text": "You'll be staying at the studio from today, right?"
				},
				{
					"name": "Arishima",
					"text": "Yeah. I brought what I need."
				},
				{
					"name": "Arishima",
					"text": "I did a search, and there's a public bath I can use nearby."
				},
				{
					"name": "Rin",
					"text": "Oh, I see."
				},
				{
					"name": "Arishima",
					"text": "You making curry again today?"
				},
				{
					"name": "Rin",
					"text": "Let's change things up a little. Didn't we have that yesterday?"
				},
				{
					"text": "I notice a faint tinge of exasperation in her playful tone, and nod."
				},
				{
					"name": "Arishima",
					"text": "All right."
				},
				{
					"text": "As we walk, we pass by a fishmonger with a bunch of fish on display in styrofoam containers and ice."
				},
				{
					"text": "The cheerful shopkeep calls out to us."
				},
				{
					"name": "Fishmonger",
					"text": "Hey, you there! We got the best horse mackerel today! How about sashimi for dinner? Your daughter will love it!"
				},
				{
					"text": "A bitter smile spreads on my face."
				},
				{
					"name": "Fishmonger",
					"text": "Come on, take a look! Nothing better for the summer! These ain't like those lifeless specimens you get at the crummy supermarkets! They are as dead as 'em, though!"
				},
				{
					"text": "Thinking back on it, I remember seeing Rin eat horse mackerel at the cafeteria before."
				},
				{
					"name": "Arishima",
					"text": "You like mackerel?"
				},
				{
					"name": "Rin",
					"text": "Huh? I never really thought much of it. I guess I like it well enough."
				},
				{
					"text": "I walk up the man."
				},
				{
					"name": "Arishima",
					"text": "So horse mackerel, eh? It does make for good sashimi."
				},
				{
					"name": "Fishmonger",
					"text": "You bet! 100 yen each!"
				},
				{
					"name": "Arishima",
					"text": "You don't keep the lights on with those prices, do you?"
				},
				{
					"name": "Fishmonger",
					"text": "Ah, you sound like my wife! Don't you worry, I don't care if I'm in the red!"
				},
				{
					"name": "Arishima",
					"text": "Hard to argue with that."
				},
				{
					"text": "I look back at her."
				},
				{
					"name": "Arishima",
					"text": "Mind if I use the kitchen today?"
				},
				{
					"text": "Looking slightly puzzled, she nods."
				},
				{
					"name": "Arishima",
					"text": "I'll take two, then."
				},
				{
					"name": "Fishmonger",
					"text": "R-Right. That'll be 200 yen."
				},
				{
					"text": "I pull out my wallet and pay the man."
				},
				{
					"name": "Fishmonger",
					"text": "Uh, here you go."
				},
				{
					"text": "A tinge of confused concern flashes through his face."
				},
				{
					"text": "I turn to him and put on my best wry smile."
				},
				{
					"name": "Arishima",
					"text": "She's the daughter of a friend who passed away. Nothing fishy going on."
				},
				{
					"name": "Fishmonger",
					"text": "Oh..."
				},
				{
					"text": "The man nods, placated, if unconvinced, as he puts three mackerels into a plastic bag."
				},
				{
					"name": "Fishmonger",
					"text": "Got a lot on your plate, eh?"
				},
				{
					"text": "I blow out a breath and nod."
				},
				{
					"text": "Well, he's not wrong about that."
				},
				{
					"name": "Rin",
					"text": "Why three?"
				},
				{
					"name": "Arishima",
					"text": "The third one's a bonus."
				},
				{
					"name": "Rin",
					"text": "Why?"
				},
				{
					"name": "Arishima",
					"text": "Who knows. Maybe horse mackerel doesn't sell that well."
				},
				{
					"name": "Rin",
					"text": "Really?"
				},
				{
					"name": "Arishima",
					"text": "It's not tasty looking like tuna or porgy. And it's not quite in season like mackerel pike."
				},
				{
					"name": "Arishima",
					"text": "But it's always a solid choice. You can boil it, roast it, eat it raw, and it'll always taste good. You can never go wrong with it in a Japanese meal."
				},
				{
					"text": "Rin nods as she looks down at the bag of fish I'm carrying."
				},
				{
					"name": "Rin",
					"text": "Um, what do you even do with it? I mean, it's not a clean fillet."
				},
				{
					"text": "That draws a little chuckle out of me."
				},
				{
					"name": "Arishima",
					"text": "Well, we clean them up and slice them into sashimi."
				},
				{
					"name": "Arishima",
					"text": "I'm good at that."
				},
				{
					"text": "She opens her eyes wide."
				},
				{
					"name": "Rin",
					"text": "Wow, so you cook?"
				},
				{
					"name": "Arishima",
					"text": "I'm from Minamiboso over in Chiba. I used to fish a lot when I was younger. Caught a fair amount of horse mackerel about this size, actually."
				},
				{
					"name": "Rin",
					"text": "Oh, is that so?"
				},
				{
					"name": "Arishima",
					"text": "You fine with raw fish?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "I'm not a picky eater."
				},
				{
					"name": "Arishima",
					"text": "That's good. I'll be cooking today."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"text": "A pleasant smile plays on her face."
				},
				{
					"name": "Rin",
					"text": "Thank you."
				},
				{
					"text": "After that, we stop by the supermarket and buy a few more ingredients."
				},
				{
					"name": "Rin",
					"text": "Can I watch?"
				},
				{
					"name": "Rin",
					"text": "How you clean the fish, I mean."
				},
				{
					"name": "Arishima",
					"text": "Be my guest."
				},
				{
					"name": "Rin",
					"text": "Yes!"
				},
				{
					"text": "I descale the fish and cut off the tails and heads."
				},
				{
					"text": "Then I slice them open, take out the guts, and wash them in the sink."
				},
				{
					"name": "Rin",
					"text": "Whoa, you're so fast."
				},
				{
					"text": "Rin watches me intently."
				},
				{
					"name": "Rin",
					"text": "Are you sure you don't cook that often?"
				},
				{
					"name": "Arishima",
					"text": "Not at all. And I'm not that good."
				},
				{
					"name": "Rin",
					"text": "But I can't do it like that. I've never prepared fish before."
				},
				{
					"name": "Arishima",
					"text": "I don't think anyone gives much thought to preparing food like this when living alone."
				},
				{
					"name": "Arishima",
					"text": "I haven't done this in years. Usually only for special occasions."
				},
				{
					"name": "Rin",
					"text": "So today's special?"
				},
				{
					"text": "She casts her gaze up at me, waiting for an answer."
				},
				{
					"text": "I stumble upon my words for a moment."
				},
				{
					"name": "Arishima",
					"text": "It's to thank you for cooking for us every day. It's been a long time since anyone cooked for me, or vice versa. I'd say that's special enough."
				},
				{
					"name": "Rin",
					"text": "When was the last time?"
				},
				{
					"text": "I think for a moment."
				},
				{
					"name": "Arishima",
					"text": "Well, the best part of twenty years, maybe?"
				},
				{
					"name": "Rin",
					"text": "So it was with your wife, back then."
				},
				{
					"name": "Arishima",
					"text": "Yeah. Ex-wife."
				},
				{
					"text": "She stares at me."
				},
				{
					"text": "I look up from the chopping board at her."
				},
				{
					"name": "Rin",
					"text": "Do you still not want to talk about this?"
				},
				{
					"name": "Arishima",
					"text": "I..."
				},
				{
					"text": "I turn back to the fish and begin removing the bones."
				},
				{
					"name": "Arishima",
					"text": "That was back when we were newlyweds. I think it was a wedding anniversary. I taught her how to prepare fish."
				},
				{
					"text": "Her eyes open slightly in surprise."
				},
				{
					"name": "Rin",
					"text": "This is the first time you've talked about any good memories with her."
				},
				{
					"name": "Arishima",
					"text": "I can believe that."
				},
				{
					"name": "Arishima",
					"text": "Horse mackerel's perfect for practicing. It's moderately challenging, cheap, and you can get it pretty much anywhere."
				},
				{
					"name": "Arishima",
					"text": "Not to mention delicious."
				},
				{
					"text": "She nods along as I speak."
				},
				{
					"name": "Rin",
					"text": "So she learned to prepare fish?"
				},
				{
					"name": "Arishima",
					"text": "I don't know about that. She did seem to get the hang of it that day."
				},
				{
					"name": "Arishima",
					"text": "She didn't really cook much, but she was surprisingly good at it. I think she was pretty mad when I gave her final product 80 points."
				},
				{
					"name": "Arishima",
					"text": "She told me that scoring every single thing was annoying."
				},
				{
					"text": "Rin smiles as she listens."
				},
				{
					"name": "Arishima",
					"text": "But besides that one time, I never ate fish she prepared."
				},
				{
					"name": "Rin",
					"text": "Even though you taught her and all?"
				},
				{
					"name": "Arishima",
					"text": "It's a hassle. Even if she was a housewife, I don't think many take the time to prepare food from scratch like that these days."
				},
				{
					"name": "Rin",
					"text": "Hmm..."
				},
				{
					"text": "I finish up separating the fish's flesh from the bones."
				},
				{
					"name": "Arishima",
					"text": "So this is how you fillet the fish. You're left with two sides and the bones. Easy so far, right?"
				},
				{
					"name": "Arishima",
					"text": "And now you pull out the bones one by one. That's why I bought some tweezers. They're in that bag."
				},
				{
					"name": "Rin",
					"text": "Say."
				},
				{
					"name": "Arishima",
					"text": "Mm?"
				},
				{
					"text": "Rin looks up at me, a small smile on her face."
				},
				{
					"name": "Rin",
					"text": "Would you teach me too."
				},
				{
					"name": "Arishima",
					"text": "This?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Arishima",
					"text": "You planning on preparing fish on your own?"
				},
				{
					"name": "Rin",
					"text": "Does it matter? Just teach me. Let's switch places, please?"
				},
				{
					"name": "Arishima",
					"text": "S-Sure."
				},
				{
					"name": "Rin",
					"text": "It's the first time I've touched a fish when it's, uh, not ready to eat."
				},
				{
					"text": "Rin tells me as she puts the fish on the chopping board."
				},
				{
					"name": "Arishima",
					"text": "First you take the scales off, and then this hard part here that extends from the tail."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"name": "Arishima",
					"text": "Try scraping it with the tip of the knife without using too much force."
				},
				{
					"name": "Rin",
					"text": "Like this?"
				},
				{
					"name": "Arishima",
					"text": "Yeah, do the same for the other side. Start from the tail and work your way down... Yeah, that's it."
				},
				{
					"name": "Rin",
					"text": "Heheh."
				},
				{
					"name": "Arishima",
					"text": "What's so funny?"
				},
				{
					"name": "Rin",
					"text": "Your instructions. Very professor-like."
				},
				{
					"name": "Arishima",
					"text": "Well, that's kind of my gig right now."
				},
				{
					"name": "Rin",
					"text": "Oh, really?"
				},
				{
					"name": "Arishima",
					"text": "I see a lot more from that podium than you might think."
				},
				{
					"name": "Arishima",
					"text": "Like you looking out the window and not paying attention to your lectures."
				},
				{
					"name": "Rin",
					"text": "I know you do."
				},
				{
					"name": "Rin",
					"text": "You teachers tend to forget because it's been a long time since you were on the other side."
				},
				{
					"text": "She looks up at me again."
				},
				{
					"text": "She looks gazes into my eyes, a suggestive expression spreading across her face."
				},
				{
					"name": "Rin",
					"text": "But we students notice your gaze way more than you might think, too."
				},
				{
					"name": "Arishima",
					"text": "...I see."
				},
				{
					"name": "Rin",
					"text": "Your eyes are always on me. I hope the other students haven't caught up yet."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "So, what's next?"
				},
				{
					"name": "Arishima",
					"text": "Oh, right. Now you cut off the head. Make sure you don't take too much meat off with it... And then..."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Rin is surprisingly ham-fisted with her attempt."
				},
				{
					"text": "She knows how to use a knife, but preparing fish is obviously something new for her."
				},
				{
					"text": "Compared to my cuts, she only manages to get about seventy percent of the flesh off the fish."
				},
				{
					"name": "Arishima",
					"text": "Well, it's your first time. You'll improve with practice."
				},
				{
					"name": "Rin",
					"text": "I thought I could do better. You made it look so easy."
				},
				{
					"name": "Arishima",
					"text": "I've probably prepared more than a hundred of these in my time. Even a total oaf will get good if he repeats something often enough."
				},
				{
					"name": "Rin",
					"text": "How many points?"
				},
				{
					"name": "Arishima",
					"text": "What?"
				},
				{
					"name": "Rin",
					"text": "If you were to score it."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "You did well for your first time, really. I still remember mine, it was such a—"
				},
				{
					"name": "Rin",
					"text": "On a 100-point scale."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I sigh."
				},
				{
					"name": "Arishima",
					"text": "I'd say around 70, I suppose."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "That's a good enough passing grade in class."
				},
				{
					"name": "Rin",
					"text": "I lose to your wife."
				},
				{
					"name": "Arishima",
					"text": "No need to turn it into a competition. You don't lose to my ex-wife in any respect."
				},
				{
					"name": "Rin",
					"text": "But this is a loss."
				},
				{
					"name": "Rin",
					"text": "I don't want to lose to her."
				},
				{
					"name": "Rin",
					"text": "I want to be the number one for you. In all respects."
				},
				{
					"name": "Arishima",
					"text": "O-Okay..."
				},
				{
					"text": "Her expression is dead serious, so I struggle to say anything."
				},
				{
					"text": "She looks down at the fish with sad eyes."
				},
				{
					"name": "Arishima",
					"text": "The criteria for the score isn't complicated; it's how much food you can get out of the fish. It just means you got 70\\% of the meat out of it."
				},
				{
					"name": "Arishima",
					"text": "You'll get better with practice, I promise. No need to beat yourself up over it."
				},
				{
					"name": "Rin",
					"text": "I'll buy more."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "Sure, fish is good for you. Helps with blood pressure."
				},
				{
					"name": "Rin",
					"text": "I don't care about that."
				},
				{
					"text": "She snaps back at me."
				},
				{
					"name": "Rin",
					"text": "Uh, okay."
				},
				{
					"text": "She lets out a small sigh."
				},
				{
					"text": "I find her pure determination so adorable that I can't help but smile."
				},
				{
					"text": "I only realize I'm doing it when she glares up at me and pouts in displeasure."
				},
				{
					"name": "Arishima",
					"text": "I'll slice it up so we can eat. Go ahead and wait at the table."
				},
				{
					"text": "She nods and dejectedly walks to the table."
				},
				{
					"text": "I serve her the fish I prepared, and place the fish she prepared in front of myself."
				},
				{
					"text": "I turned the third fish into a namerou-style mashed fish medley."
				},
				{
					"text": "Preparing fish is the only cooking-related skill I have."
				},
				{
					"text": "I can't really make much else."
				},
				{
					"text": "I sliced some silken tofu and sprinkled it with some condiments we bought to make a cold tofu dish."
				},
				{
					"text": "I also made miso soup by pouring hot water onto instant stock and served some pickled vegetables on a small dish."
				},
				{
					"text": "Most of the work simply involved taking the ingredients out of their packaging."
				},
				{
					"text": "I carefully set the plates on the table."
				},
				{
					"name": "Rin",
					"text": "It looks amazing."
				},
				{
					"name": "Arishima",
					"text": "Don't start with that. All I did was put the stuff onto the plates."
				},
				{
					"name": "Rin",
					"text": "But it's a full meal."
				},
				{
					"name": "Arishima",
					"text": "We've got Japan's efficient food processing and the distribution networks to thank for that. It's amazing how we can always get fresh tofu."
				},
				{
					"name": "Rin",
					"text": "Someone's not used to getting praised, huh?"
				},
				{
					"text": "Rin says, letting out a small giggle."
				},
				{
					"name": "Rin",
					"text": "I'm so happy you made all of this for me."
				},
				{
					"name": "Rin",
					"text": "Why do you have to bring up Japanese food processing and distribution?"
				},
				{
					"name": "Arishima",
					"text": "Well, it's just that, uh, the miso soup and the tofu are freeze dried and..."
				},
				{
					"name": "Rin",
					"text": "Yes, yes, I understand now. Japanese technology sure is amazing."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Are you mad?"
				},
				{
					"name": "Arishima",
					"text": "Not at all. I'm happy you feel comfortable enough to banter. Your bite is pretty fitting for someone your age."
				},
				{
					"name": "Rin",
					"text": "Are you treating me like a kid again?"
				},
				{
					"text": "I shake my head emphatically."
				},
				{
					"name": "Arishima",
					"text": "It's not a bad thing to act your age. When you get over forty, you start acting old without even trying to."
				},
				{
					"name": "Arishima",
					"text": "If you wish your youth away, you'll regret it later down the road."
				},
				{
					"name": "Rin",
					"text": "I'm a young adult, you know?"
				},
				{
					"name": "Arishima",
					"text": "Right. It's easy to forget."
				},
				{
					"name": "Rin",
					"text": "A young woman who is also your student, and you're having dinner with her on a weekend, all alone in this house."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Am I going to hell for this?"
				},
				{
					"name": "Rin",
					"text": "I'd say you have a pretty young spirit, professor."
				},
				{
					"name": "Arishima",
					"text": "Remind me never to cross you."
				},
				{
					"text": "Rin laughs out loud and looks back at me."
				},
				{
					"name": "Rin",
					"text": "Let's eat! It looks delicious."
				},
				{
					"name": "Arishima",
					"text": "Yeah."
				},
				{
					"name": "Rin",
					"text": "It's so good!"
				},
				{
					"name": "Arishima",
					"text": "It's pretty good, yeah."
				},
				{
					"name": "Rin",
					"text": "You can actually cook! This is really good too."
				},
				{
					"text": "Rin reaches out for the minced fish with her chopsticks."
				},
				{
					"name": "Arishima",
					"text": "I think anyone could make it tasty. Like curry, it's pretty hard to mess up."
				},
				{
					"name": "Rin",
					"text": "Heheh, I see."
				},
				{
					"name": "Arishima",
					"text": "I'm not being modest. The fish and the soybeans are just that good."
				},
				{
					"name": "Rin",
					"text": "Soybeans? What are you talking about now?"
				},
				{
					"text": "She puts a hand to her mouth as she stifles a chuckle."
				},
				{
					"text": "Here we go again... Can I stop opening my big mouth?"
				},
				{
					"name": "Arishima",
					"text": "We're eating tofu made from soybeans, dipped in soy sauce also made from them."
				},
				{
					"name": "Arishima",
					"text": "The miso for the soup base comes from soybeans, as does the bean curd in the soup."
				},
				{
					"text": "Her eyes grow round with surprise."
				},
				{
					"name": "Rin",
					"text": "You're right!"
				},
				{
					"name": "Arishima",
					"text": "Back when I was a penniless student, I used to always order the same stuff from the cafeteria's menu."
				},
				{
					"name": "Arishima",
					"text": "50 yen tofu miso soup, 60 yen cold tofu. 80 yen natto, and 150 yen white rice for a total of 340 yen."
				},
				{
					"name": "Arishima",
					"text": "And when you sprinkle some soy sauce on it, basically everything is..."
				},
				{
					"name": "Rin",
					"text": "Soy!"
				},
				{
					"name": "Arishima",
					"text": "A very soyd state of affairs, back then."
				},
				{
					"name": "Rin",
					"text": "Ahahah!"
				},
				{
					"name": "Rin",
					"text": "You're actually pretty funny, too."
				},
				{
					"text": "I stare at her, dumbfounded. I can't believe she laughed at that."
				},
				{
					"name": "Arishima",
					"text": "Funny? Are you sure?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Rin",
					"text": "Well, maybe funny in the weird sense."
				},
				{
					"name": "Arishima",
					"text": "*Sigh*"
				},
				{
					"name": "Rin",
					"text": "That's a compliment, just so you know."
				},
				{
					"text": "She smiles as our eyes meet, then continues eating her meal as if nothing happened."
				},
				{
					"text": "I follow her example and keep eating as well."
				},
				{
					"text": "The horse mackerel is really damn good."
				},
				{
					"text": "After we've both finished our meal and taken the dishes to the sink, I boil some water in the electric kettle and make two cups of coffee."
				},
				{
					"text": "Rin holds the steaming mug in both hands and drinks little sips as she cools it off by blowing on it."
				},
				{
					"name": "Rin",
					"text": "Are you heading back to the studio?"
				},
				{
					"name": "Arishima",
					"text": "Yeah, I wanna read through the diaries. I'll report back when I'm finished with them."
				},
				{
					"name": "Rin",
					"text": "...Have you come across anything new?"
				},
				{
					"name": "Arishima",
					"text": "Mmh..."
				},
				{
					"text": "I think back on what's written in the diaries."
				},
				{
					"name": "Arishima",
					"text": "Shuho revised his stuff so much people took to making fun of him and calling him the vintner. You know that, right?"
				},
				{
					"text": "With her eyes still upturned to me, she nods."
				},
				{
					"name": "Arishima",
					"text": "His novels sold well. He changed the bindings with each new edition, but the only binding he never changed was the one on his debut work."
				},
				{
					"text": "She nods again."
				},
				{
					"name": "Rin",
					"text": "I know that, too."
				},
				{
					"name": "Arishima",
					"text": "I found the reason behind that in one of his diaries."
				},
				{
					"name": "Rin",
					"text": "There was a reason?"
				},
				{
					"name": "Arishima",
					"text": "When he looked out over that view for the first time, he desperately wanted to be someone."
				},
				{
					"name": "Arishima",
					"text": "And he got everything he wished for back then. The money, the fame."
				},
				{
					"name": "Rin",
					"text": "It seems that way, yes."
				},
				{
					"name": "Arishima",
					"text": "But he regretted it."
				},
				{
					"name": "Rin",
					"text": "He did?"
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Arishima",
					"text": "It seems like that place was an important turning point in his life. That's why it's the only thing he never changed."
				},
				{
					"name": "Rin",
					"text": "Is that so? That place is in this prefecture, right?"
				},
				{
					"name": "Arishima",
					"text": "Sakuragicho."
				},
				{
					"name": "Rin",
					"text": "Oh..."
				},
				{
					"name": "Arishima",
					"text": "I got curious about that scenery while reading his diary. I'm thinking of going there tomorrow."
				},
				{
					"name": "Rin",
					"text": "To Sakuragicho?"
				},
				{
					"text": "I nod again."
				},
				{
					"name": "Arishima",
					"text": "Not that I think I'll have some big revelation there or anything."
				},
				{
					"name": "Rin",
					"text": "I see."
				},
				{
					"text": "Rin turns her gaze back to her mug."
				},
				{
					"text": "I watch her for a moment before finishing up the last of my coffee."
				},
				{
					"text": "When I'm done, I get up and walk to the entrance to put my shoes on."
				},
				{
					"name": "Rin",
					"text": "Professor."
				},
				{
					"text": "She calls out to me from behind."
				},
				{
					"text": "I turn back to her."
				},
				{
					"name": "Rin",
					"text": "Can I go with you tomorrow?"
				},
				{
					"name": "Arishima",
					"text": "To Sakuragicho?"
				},
				{
					"text": "Rin nods firmly."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I stare at her in silence for a moment."
				},
				{
					"text": "Her eyes wander nervously."
				},
				{
					"name": "Rin",
					"text": "What do you think? Would I be a bother?"
				},
				{
					"name": "Arishima",
					"text": "Okay. Just to be on the safe side, let's meet there."
				},
				{
					"text": "Her tense expression unravels into one of relief."
				},
				{
					"name": "Rin",
					"text": "Yes."
				},
				{
					"name": "Arishima",
					"text": "Are you sure you wanna waste your weekend on this, though?"
				},
				{
					"name": "Rin",
					"text": "I have no plans anyway. I'd just be reading books at home."
				},
				{
					"name": "Arishima",
					"text": "All right."
				},
				{
					"text": "Rin smiles and gives me a little bow."
				},
				{
					"name": "Rin",
					"text": "Thank you very much for today. I'll take the exam again."
				},
				{
					"name": "Arishima",
					"text": "What exam?"
				},
				{
					"name": "Rin",
					"text": "Filleting fish."
				},
				{
					"name": "Arishima",
					"text": "Oh, yeah."
				},
				{
					"name": "Rin",
					"text": "I'll get over 80 points, at least."
				},
				{
					"text": "She makes me chuckle again."
				},
				{
					"name": "Arishima",
					"text": "You really hate losing, don't you?"
				},
				{
					"name": "Rin",
					"text": "I told you I'm a stubborn one."
				},
				{
					"text": "She says, her eyes glittering with an alluring shine."
				},
				{
					"name": "Rin",
					"text": "Thank you for the lovely dinner."
				},
				{
					"name": "Arishima",
					"text": "Right back at you."
				},
				{
					"name": "Arishima",
					"text": "Have a good night."
				},
				{
					"text": "I turn my back on her and leave the room."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I walk the road between Rin's place and Shuho's studio."
				},
				{
					"text": "As I walk, my mind is full of thoughts about tomorrow."
				},
				{
					"text": "Come to think of it, all we've ever done is have dinner together. We've never been out anywhere just for fun."
				},
				{
					"text": "I feel like my ethical boundaries are thinning out more and more by the day."
				},
				{
					"text": "At first I didn't even want to talk to her without a good reason."
				},
				{
					"text": "But then we read books together at the library, and as things developed she gave me the key to her dad's studio."
				},
				{
					"text": "And then we started having dinner at her place daily."
				},
				{
					"text": "Now we're going out together on the weekend."
				},
				{
					"text": "Is this really okay?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "The warm smile she left me with at the front door is still fresh in my memory."
				},
				{
					"text": "Lately, I've come to see a lot of different sides to her."
				},
				{
					"text": "Sometimes she seems so mature that it makes my heart skip a beat, but she also has her childish moments."
				},
				{
					"text": "Then, the thought hits me."
				},
				{
					"text": "Perhaps she's getting involved with me in an attempt to regain the lost time with her deceased father?"
				},
				{
					"text": "Rin herself may be seeing me under his shadow."
				},
				{
					"text": "The thought makes me a little sad, but a part of me also feels relieved that the dangerous nature of our relationship may fade, given enough time."
				},
				{
					"text": "We're just going out tomorrow, no big deal. Don't overthink it."
				},
				{
					"text": "In the off chance that we bump into someone we know, it shouldn't set off any alarm bells if we say we just happened to meet."
				},
				{
					"text": "Maybe it'd be different with Watanabe, but I don't think most people would jump to the conclusion that we're romantically involved just from seeing us walking together."
				},
				{
					"text": "Even the fishmonger thought we were parent and child at first."
				},
				{
					"text": "I think about what to wear tomorrow as I make my way back to the the condominium complex."
				},
				{
					"text": "I'm halfway there now."
				},
				{
					"text": "Not too far in physical distance."
				},
				{
					"text": "But Rin and Shuho's hearts are separated by an insurmountable chasm."
				},
				{
					"text": "And there's nothing that can fill such a gap."
				},
				{
					"text": "Rin will never have a weekend outing with her dad."
				},
				{
					"text": "...What should I do for her?"
				},
				{
					"text": "What can I even do?"
				},
				{
					"text": "Become a replacement for her dad?"
				},
				{
					"text": "I failed to depict Shuho once."
				},
				{
					"text": "I have to admit to that."
				},
				{
					"text": "Shuho was self-centered, vindictive, and had an impulsive nature that bordered on childish."
				},
				{
					"text": "He seemed to reject the idea of being understood by others."
				},
				{
					"text": "It's exactly like Rin said."
				},
				{
					"text": "It's true that Shuho was never the appealing, idealistic depiction that I thought up. The person that lived in that studio was very different."
				},
				{
					"text": "With that knowledge, what I can do is..."
				},
				{
					"text": "Come into contact with Shuho's real writing in Rin's stead and tell her about it."
				},
				{
					"text": "I can serve as a bridge connecting the bottomless rift between parent and child."
				},
				{
					"text": "That's probably the best I can do."
				},
				{
					"text": "And..."
				},
				{
					"text": "I guess I can keep teaching her how to fillet fish."
				},
				{
					"text": "Next morning."
				},
				{
					"text": "I go to the public bathhouse early and head to Sakuragicho station before our appointed time."
				},
				{
					"text": "When I arrive at the ticket gate extra early, I send Rin a message."
				},
				{
					"text": "\"I'm here already. I'll be waiting by the ticket gate.\""
				},
				{
					"text": "Immediately after sending the message, Rin walks over to me from the other side of the ticket gate, wearing a beautiful white sundress."
				},
				{
					"name": "Rin",
					"text": "Sorry for the wait."
				},
				{
					"name": "Arishima",
					"text": "It's still not even the time we agreed. I just got here."
				},
				{
					"text": "She smiles at me."
				},
				{
					"name": "Arishima",
					"text": "We can walk to to the observation deck. Let's get going."
				},
				{
					"text": "We walk through the city together."
				},
				{
					"name": "Rin",
					"text": "Do you come to Sakuragicho often?"
				},
				{
					"name": "Arishima",
					"text": "Not really. It isn't my first time, though."
				},
				{
					"name": "Rin",
					"text": "Really? Did you come on a date?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "For a moment, I'm unsure on how to answer."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "With your wife?"
				},
				{
					"text": "But she answers the question for me."
				},
				{
					"text": "When I turn to her, she has that sly smile on her face."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "Ahahah!"
				},
				{
					"name": "Arishima",
					"text": "What's so funny?"
				},
				{
					"name": "Rin",
					"text": "You're like a little kid getting caught with your hand in the cookie jar."
				},
				{
					"text": "She pulls a sullen expression, nodding grudgingly."
				},
				{
					"text": "Looks like she's mimicking me now."
				},
				{
					"name": "Rin",
					"text": "But that must have been a long time ago, right?"
				},
				{
					"name": "Arishima",
					"text": "Back during my student days. So long ago I barely remember."
				},
				{
					"name": "Arishima",
					"text": "It's so blurry that I can't recall much else besides the fact that it happened."
				},
				{
					"name": "Rin",
					"text": "Was your wife pretty basic?"
				},
				{
					"text": "After thinking for a moment, I nod."
				},
				{
					"name": "Rin",
					"text": "A date in Sakuragicho, huh? That's really cliche."
				},
				{
					"name": "Arishima",
					"text": "Well, we're headed that way, so I don't think we can really judge."
				},
				{
					"name": "Rin",
					"text": "Right. This is kind of a date too, then."
				},
				{
					"text": "I instinctively turn to her."
				},
				{
					"text": "She's walking alongside me, her expression nonplussed."
				},
				{
					"name": "Rin",
					"text": "This is such a beautiful city. The sky is so vast, and there are no mountains to block the view."
				},
				{
					"name": "Arishima",
					"text": "Yeah, it feels really refreshing, doesn't it?"
				},
				{
					"text": "Rin shades her eyes with her hand as she looks up at the tower that rises in front of the station."
				},
				{
					"name": "Rin",
					"text": "We're going up there?"
				},
				{
					"name": "Arishima",
					"text": "Yeah."
				},
				{
					"name": "Rin",
					"text": "Whoa..."
				},
				{
					"name": "Arishima",
					"text": "There's a bookstore and gift stores in there. Well, there's a bit of everything, I'd say."
				},
				{
					"name": "Arishima",
					"text": "These huge complexes are nice if you wanna go shopping. We can even grab a bite."
				},
				{
					"name": "Arishima",
					"text": "Back when this was opened to the public, its selling factor was being the fastest elevator In the world. You can get up to the 69th floor from the ground floor in 40 seconds flat."
				},
				{
					"name": "Rin",
					"text": "Whoa!"
				},
				{
					"text": "There's a tinge of awe in her voice."
				},
				{
					"name": "Rin",
					"text": "You know so much."
				},
				{
					"text": "I look down at her and see her directing that usual suggestive smile at me."
				},
				{
					"name": "Arishima",
					"text": "It just was in the news when it opened, that's all."
				},
				{
					"name": "Rin",
					"text": "Ooh, is that so?"
				},
				{
					"text": "I clear my throat and keep on walking."
				},
				{
					"name": "Arishima",
					"text": "Let's go."
				},
				{
					"name": "Rin",
					"text": "Okay."
				},
				{
					"name": "Rin",
					"text": "That was really fast."
				},
				{
					"name": "Arishima",
					"text": "Told you."
				},
				{
					"name": "Rin",
					"text": "It's my first time coming to an observation deck."
				},
				{
					"name": "Arishima",
					"text": "There should be a cafe around. Wanna take a break?"
				},
				{
					"name": "Rin",
					"text": "Yes, thanks."
				},
				{
					"text": "We buy iced tea and coffee at the bar inside the deck and sit on a sofa facing the windows."
				},
				{
					"text": "The weather's so nice you can even see the Tokyo metropolitan area in the distance."
				},
				{
					"name": "Arishima",
					"text": "That's Tokyo over there."
				},
				{
					"text": "Rin nods slowly as she gazes at the expansive scenery spreading before us."
				},
				{
					"text": "I do the same, and we sit in silence for a moment."
				},
				{
					"text": "We look out over countless roofs and apartment buildings."
				},
				{
					"text": "Each of them houses an individual life, perhaps more. Even at my ripe mature age, it's hard to wrap my head around."
				},
				{
					"text": "It's impossible to look at the world from my own narrow viewpoint and grasp even a fragment of the life, the energy of all the people that make this world turn."
				},
				{
					"text": "I think Shuho felt stress because of that too."
				},
				{
					"text": "The one big difference, however..."
				},
				{
					"text": "While I'm facing all of this vastness as just another face in the crowd, Shuho lived in a whole lot of different worlds."
				},
				{
					"text": "Whether he wanted to or not..."
				},
				{
					"text": "Did Shuho ever come here after becoming a writer?"
				},
				{
					"text": "Or was bringing Rin here to look at this scenery together like I'm doing now not an option for him?"
				},
				{
					"text": "As I gaze at the breathtaking scenery that became the monument to Shuho's regret, the iced tea on the table in front of us crackles as it warms."
				},
				{
					"text": "Droplets of condensation form on the surface of the glass."
				},
				{
					"name": "Rin",
					"text": "Professor, you..."
				},
				{
					"text": "Rin begins to speak, but she trails off."
				},
				{
					"text": "I turn to her and regard her profile as she looks out the window."
				},
				{
					"name": "Rin",
					"text": "What do you feel looking at all this?"
				},
				{
					"text": "Stunned, I keep staring at her."
				},
				{
					"text": "Her attention stays on the scenery, but she turns to meet my gaze after a while."
				},
				{
					"name": "Arishima",
					"text": "What do I feel?"
				},
				{
					"name": "Rin",
					"text": "Yeah. Overlooking this huge city."
				},
				{
					"text": "Rin turns to look back out at Yokohama and Tokyo's landscape in the distance."
				},
				{
					"name": "Rin",
					"text": "Looking at this vast unknown world expanding as far as the eye can see..."
				},
				{
					"text": "Rin squints slightly, looking for the words."
				},
				{
					"name": "Rin",
					"text": "Do you feel relief at the fact you're not alone?"
				},
				{
					"name": "Rin",
					"text": "Or..."
				},
				{
					"name": "Rin",
					"text": "Maybe alienated that you're alone in all this vastness?"
				},
				{
					"name": "Rin",
					"text": "Which is it?"
				},
				{
					"text": "I let out a dry, short laugh."
				},
				{
					"text": "Rin turns to me again."
				},
				{
					"name": "Arishima",
					"text": "You really need to ask? I think you know the answer to that."
				},
				{
					"text": "Rin has the same sad smile on her face as I do."
				},
				{
					"name": "Rin",
					"text": "Alienation."
				},
				{
					"text": "I nod."
				},
				{
					"name": "Arishima",
					"text": "I don't think I could get along with someone that saw this scenery and felt secure."
				},
				{
					"name": "Rin",
					"text": "Ahahah."
				},
				{
					"text": "A little laugh escapes her lips, and then she takes a sip of her tea."
				},
				{
					"name": "Rin",
					"text": "I know how you feel."
				},
				{
					"text": "She gazes at the scenery, a faint smile on her face."
				},
				{
					"name": "Rin",
					"text": "I wonder which camp my father was in."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I definitely think he'd be on the alienated side."
				},
				{
					"name": "Rin",
					"text": "Keeping your distance is easier for those that live differently."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I turn to Rin."
				},
				{
					"text": "She's still looking out the window, down at that vast cityscape."
				},
				{
					"text": "Is she talking about Shuho there?"
				},
				{
					"text": "As I think, Rin turns back to me."
				},
				{
					"name": "Rin",
					"text": "I wish just looking down at the campus from here could count towards my attendance."
				},
				{
					"text": "She says, a silly smile on her face."
				},
				{
					"name": "Arishima",
					"text": "I don't think the teachers would approve of that."
				},
				{
					"text": "Her smile turns a little sour."
				},
				{
					"name": "Rin",
					"text": "I know that. Your sense of humor sucks sometimes, huh?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She exclaims cheerfully and stretches her arms out."
				},
				{
					"name": "Rin",
					"text": "Thank you for bringing me to a place where you shared memories with your wife."
				},
				{
					"name": "Arishima",
					"text": "...Is that a joke too?"
				},
				{
					"name": "Rin",
					"text": "Not at all?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "You told me a lie today, didn't you?"
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"name": "Rin",
					"text": "You said that the memory of being here with your wife was so vague that you didn't remember, right?"
				},
				{
					"name": "Rin",
					"text": "But you did remember the speed of the elevator, that there was a cafe, and even these seats made for couples to share."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"name": "Rin",
					"text": "You remember the last time you were here with her, don't you?"
				},
				{
					"name": "Arishima",
					"text": "...Yeah."
				},
				{
					"name": "Arishima",
					"text": "It was a figure of speech, sorry."
				},
				{
					"name": "Rin",
					"text": "It sounds more like a lie, don't you think?"
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Suddenly, I feel an emotionless chill in her tone, and I'm at a loss."
				},
				{
					"name": "Rin",
					"text": "Ahahah!"
				},
				{
					"text": "While I try to squeeze out a response, she laughs out loud."
				},
				{
					"name": "Rin",
					"text": "I'm kidding. Sorry. No need to look so down."
				},
				{
					"text": "She says, before taking the last sip of her iced tea."
				},
				{
					"name": "Rin",
					"text": "Thank you very much."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I can't help but wonder what she's thanking me for."
				},
				{
					"name": "Rin",
					"text": "I wouldn't be here if it wasn't for you. I didn't even know my father had a place that was so special to him."
				},
				{
					"name": "Rin",
					"text": "I'm glad I came."
				},
				{
					"text": "She murmurs, with her eyes downcast."
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Rin",
					"text": "So what shall we do now? You know your way around here, right?"
				},
				{
					"name": "Arishima",
					"text": "There's a small shopping mall if we down to the 5th floor. We can grab a bite to eat there."
				},
				{
					"name": "Rin",
					"text": "Should be a short ride on the ex-fastest elevator. Let's go."
				},
				{
					"name": "Arishima",
					"text": "It sounds kinda sad when you put it that way."
				},
				{
					"text": "We go down and share a light meal on the bustling shopping floor."
				},
				{
					"name": "Arishima",
					"text": "Is there anything you wanna see?"
				},
				{
					"name": "Rin",
					"text": "Like what?"
				},
				{
					"name": "Arishima",
					"text": "There are clothes shops, or more general stuff. Err... There's lots to see, I suppose."
				},
				{
					"name": "Rin",
					"text": "I can see that. But there's not really anything I'm after in particular."
				},
				{
					"name": "Rin",
					"text": "We can just do some window shopping. Let's start from the top."
				},
				{
					"name": "Arishima",
					"text": "Okay."
				},
				{
					"text": "The mall extends up five floors, each of them full of all kinds of shops."
				},
				{
					"text": "Most of them you can take a peek inside of from the outside."
				},
				{
					"text": "We slowly stroll along, looking into the stops as we go."
				},
				{
					"name": "Rin",
					"text": "Ah."
				},
				{
					"text": "A newly opened big bookstore chain on the second floor catches Rin's attention."
				},
				{
					"text": "I follow her inside."
				},
				{
					"name": "Rin",
					"text": "These pictures are pretty nice, aren't they?"
				},
				{
					"text": "Rin heads straight to the little section of children's picture books. Apparently this is what caught her interest from the outside."
				},
				{
					"text": "There's a funny daruma doll with the face of a bird on the cover."
				},
				{
					"name": "Arishima",
					"text": "Oh, isn't that the bird illustration you sent me? No, is it a daruma doll?"
				},
				{
					"name": "Rin",
					"text": "Illustration? I sent you this?"
				},
				{
					"text": "I fish my phone out of my pocket and show her the screen of our conversation."
				},
				{
					"text": "She sent it that one day she worked part-time."
				},
				{
					"name": "Arishima",
					"text": "This one here."
				},
				{
					"name": "Rin",
					"text": "You call the emojis 'illustrations'?"
				},
				{
					"name": "Arishima",
					"text": "Emojis?"
				},
				{
					"text": "I repeat the alien word like a student attending language school."
				},
				{
					"text": "Then I realize it must be some kind of new slang."
				},
				{
					"name": "Rin",
					"text": "Those are called emojis. You should try to remember that."
				},
				{
					"text": "She says, her face adorned with that little smug grin I've come to know so well, and then she giggles."
				},
				{
					"name": "Arishima",
					"text": "Emojis, huh? Consider it memorized."
				},
				{
					"name": "Rin",
					"text": "Yes, emojis."
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Arishima",
					"text": "Which one do you want?"
				},
				{
					"name": "Rin",
					"text": "Hm... Yeah, it'd be a waste to come here and not buy anything."
				},
				{
					"text": "Rin picks up a little sticker set of the weird daruma bird emoji."
				},
				{
					"name": "Arishima",
					"text": "Stickers? That's a sticker, right?"
				},
				{
					"name": "Rin",
					"text": "Can't you tell? They're stickers, yeah. Why are you second guessing yourself now?"
				},
				{
					"text": "Rin looks suitably amused by my feigned ignorance."
				},
				{
					"text": "Then, her attention shifts to a T-shirt with a print of the funny daruma bird on it. She looks at it with the intensity only a kid wishing for something really hard could have."
				},
				{
					"text": "There is an air of innocence and earnest passion about her."
				},
				{
					"name": "Arishima",
					"text": "Let me get that for you. As thanks for teaching me about emojis."
				},
				{
					"name": "Rin",
					"text": "Huh?"
				},
				{
					"text": "I grab the set of stickers from her hand and one of the folded T-shirts from the pile."
				},
				{
					"text": "She looks up at me in surprise."
				},
				{
					"name": "Arishima",
					"text": "And to thank you for inviting me out today. It's nothing fancy, but it'll do."
				},
				{
					"name": "Arishima",
					"text": "Is small the right size for the shirt?"
				},
				{
					"text": "Rin smiles."
				},
				{
					"name": "Rin",
					"text": "Thank you so much. This is the first a man has given me a gift."
				},
				{
					"name": "Arishima",
					"text": "...Are you sure you want that first gift to come from me? And something this simple on top of that?"
				},
				{
					"name": "Rin",
					"text": "Of course."
				},
				{
					"name": "Rin",
					"text": "Please buy it for me."
				},
				{
					"text": "We go to the register together and pay for the two items."
				},
				{
					"text": "I see that an area extending from the cash register to the exit has been cordoned off for an autograph session with some novelist."
				},
				{
					"text": "There aren't that many people waiting for it."
				},
				{
					"text": "The bookstore clerk is announcing that a talk show will begin shortly as part of the event."
				},
				{
					"text": "Rin stares at the clerk."
				},
				{
					"name": "Arishima",
					"text": "You know them?"
				},
				{
					"name": "Rin",
					"text": "No..."
				},
				{
					"text": "Her smile looks a bit bashful."
				},
				{
					"name": "Rin",
					"text": "When I was working in the supermarket, people didn't stop to listen to what I had to say. So I can kind of relate."
				},
				{
					"name": "Arishima",
					"text": "Makes sense."
				},
				{
					"text": "I turn to look at the small event venue too."
				},
				{
					"text": "It's a small setup consisting of a table and two chairs."
				},
				{
					"text": "Just then, someone walking towards the table enters my field of vision."
				},
				{
					"name": "Rin",
					"text": "Ah."
				},
				{
					"text": "Rin lets out a small breath at the same time as I realize that it's my ex-wife."
				},
				{
					"text": "A man who seems to be the author walks in front of her and sits down at the table."
				},
				{
					"text": "My ex-wife sits next to him."
				},
				{
					"text": "As we stand there, the safety stanchion behind us is closed, and we're left having to pass through the almost empty venue."
				},
				{
					"text": "The man gives his pen name and bows his head."
				},
				{
					"text": "In contrast to the impression he gives off, his speech and mannerism make him seem rather young."
				},
				{
					"text": "As I vaguely stare at him and think how he looks about the same age as Watanabe, Shouko picks up the microphone."
				},
				{
					"name": "Shouko",
					"text": "My name is Arishima, and I'm here representing Shueisha books. I had the pleasure of editing on this occasion. We're here to give you all some insight into the writing process of Mr. Saeki's newest work and—"
				},
				{
					"text": "She greets the small crowd with amazing eloquence as she scans the people in attendance with a slightly uninterested look, until her gaze settles on me."
				},
				{
					"text": "First comes astonishment, and then her expression settles into one of visceral disgust."
				},
				{
					"text": "Some of the spectators notice and look back at me."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "But it only takes her a second to erase all trace of emotion from her expression."
				},
				{
					"text": "She smooths it over with a small apology, and then the talk continues."
				},
				{
					"text": "But then..."
				},
				{
					"text": "I feel something warm touch my arm."
				},
				{
					"text": "Rin entwines her left arm with my right."
				},
				{
					"text": "Instinctively, my head snaps back to her."
				},
				{
					"text": "She staring straight at Shouko."
				},
				{
					"text": "There is a faint smile on her face."
				},
				{
					"name": "Shouko",
					"text": "..."
				},
				{
					"text": "Shouko's gaze falls on us again."
				},
				{
					"text": "She clearly tenses up."
				},
				{
					"text": "Her face warps and twitches into a murderous scowl."
				},
				{
					"text": "Her gaze is set right on our entwined arms."
				},
				{
					"text": "It's obvious to the people in attendance that something's going on."
				},
				{
					"text": "I shake off Rin's arm with all my force and rush out as fast as my legs will carry me."
				},
				{
					"text": "I'm almost running."
				},
				{
					"text": "I just want to get away from that place."
				},
				{
					"name": "Rin",
					"text": "Professor! Professor!"
				},
				{
					"text": "I can hear Rin calling out to me from behind."
				},
				{
					"text": "But I don't stop."
				},
				{
					"name": "Rin",
					"text": "Professor! Wait! Please!"
				},
				{
					"text": "She keeps calling out for me to stop."
				},
				{
					"text": "I clench my teeth and keep walking."
				},
				{
					"text": "I feel so unbearably wretched."
				},
				{
					"text": "I can't contain this anger."
				},
				{
					"text": "No matter how much I clench my teeth or how white my knuckles get from balling my fists, it doesn't go away."
				},
				{
					"name": "Rin",
					"text": "Professor, I..."
				},
				{
					"name": "Arishima",
					"text": "Don't follow me!"
				},
				{
					"text": "Rin jolts back and freezes in place when I yell."
				},
				{
					"text": "The people passing along the Sakuragicho street throw glances at us as they go."
				},
				{
					"text": "Rin looks up at me, obviously terrified."
				},
				{
					"text": "The people around us keep their distance, but they don't keep their curious gazes from us."
				},
				{
					"text": "I put a hand to my forehead."
				},
				{
					"text": "The blood rushes up to my head and I get dizzy."
				},
				{
					"text": "Feeling myself stagger, I let out a small breath between clenched teeth."
				},
				{
					"text": "I move over to the side of the road and slump down with my back against a wall."
				},
				{
					"name": "Arishima",
					"text": "Why? Why did you do that?"
				},
				{
					"name": "Arishima",
					"text": "What were you thinking? Why in the world would you do that?"
				},
				{
					"name": "Arishima",
					"text": "Are you trying to make my life hell?"
				},
				{
					"text": "I hear as she approaches with timid steps."
				},
				{
					"name": "Rin",
					"text": "I'm so sorry, I just..."
				},
				{
					"name": "Arishima",
					"text": "Don't drag me into your childish rivalry..."
				},
				{
					"name": "Rin",
					"text": "I'm sorry! Please, forgive me."
				},
				{
					"name": "Rin",
					"text": "That was your wife, right? I remember her from the pictures."
				},
				{
					"name": "Arishima",
					"text": "I don't want anything to do with Shouko."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "This is a problem between me and my ex-wife. You didn't have to come stomping into it because of your ego."
				},
				{
					"name": "Rin",
					"text": "Yes, but..."
				},
				{
					"name": "Rin",
					"text": "But not being able to get between you two... It makes me feel so sad..."
				},
				{
					"name": "Arishima",
					"text": "And how is that my problem?!"
				},
				{
					"name": "Arishima",
					"text": "You... You two! How miserable must you make me to be satisfied?!"
				},
				{
					"name": "Arishima",
					"text": "You and your damn dad!"
				},
				{
					"text": "When I shout those words out, all sound around us disappears."
				},
				{
					"text": "Tears silently roll down her cheeks and fall to her feet."
				},
				{
					"text": "Stunned, I simply stare at her as she cries."
				},
				{
					"text": "She blinks a lot of times, but it doesn't help."
				},
				{
					"text": "The patter of her tears on the ground is audible in the absolute silence."
				},
				{
					"text": "She hangs her head down and all emotions drain from her face."
				},
				{
					"text": "Her face might as well have turned into a piece of marble, such is the lack of emotion."
				},
				{
					"text": "She quietly stands up and leaves, her unfeeling steps growing distant."
				},
				{
					"text": "Still stunned, I stare at the space she occupied just a moment ago."
				},
				{
					"text": "The burning anger consumed everything inside of me, leaving nothing."
				},
				{
					"text": "Emptiness spreads through my chest, like water seeping into a sinking ship."
				},
				{
					"text": "The only thing that compels me to stand up and leave that place is the possibility of seeing Shouko again."
				},
				{
					"text": "I get up, head to Sakuragicho station, and everything is a blur after that."
				},
				{
					"text": "I feel like I had a bag when I left this morning."
				},
				{
					"text": "Who gives a damn?"
				},
				{
					"text": "There's nothing left for me to cling onto."
				},
				{
					"text": "There's no need to be attached to my belongings."
				},
				{
					"text": "I destroyed it all again."
				},
				{
					"text": "I completely broke something inside of Rin."
				},
				{
					"text": "Of course I came back here."
				},
				{
					"text": "I have nothing left but this place."
				},
				{
					"text": "Exhausted, I sit at Shuho's desk."
				},
				{
					"text": "As I finish reading the notebooks piled on the left, I stack them on the right."
				},
				{
					"text": "It's strange."
				},
				{
					"text": "Why is Shuho's writing penetrating me so deeply?"
				},
				{
					"text": "I'm sure I have nothing left inside of me."
				},
				{
					"text": "Just like water dripping into sand, his writing silently soaks into me."
				},
				{
					"text": "There are only six notebooks left."
				},
				{
					"text": "My journey with Shuho will be over soon."
				},
				{
					"text": "I see..."
				},
				{
					"text": "This is probably my final duty."
				},
				{
					"text": "When I'm in this room, sitting at this desk, I feel like our thoughts become one."
				},
				{
					"text": "When the door closes, we're the only ones here."
				},
				{
					"text": "Now this is the only place where I can be myself."
				},
				{
					"text": "I open Shuho's diary."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I follow the decline of Shuho's mental state."
				},
				{
					"text": "\"I just keep writing out of habit.\""
				},
				{
					"text": "\"I keep writing garbage prose, deceiving one and all.\""
				},
				{
					"text": "\"I've stopped thinking completely.\""
				},
				{
					"text": "\"I just watch as my fingers keep on hitting the keyboard keys regardless of what I think.\""
				},
				{
					"text": "\"I'm just a chunk of meat rolling down a hill on inertia alone.\""
				},
				{
					"text": "\"I can't find any meaning to living a life like this.\""
				},
				{
					"text": "\"Of course I can't. Such a thing never existed to begin with.\""
				},
				{
					"text": "\"I stink. Even I can tell.\""
				},
				{
					"text": "\"I've spent five, six, seven days without leaving this chair. I can smell my own foul stench.\""
				},
				{
					"text": "\"The intense odor forces me to confront my own existence.\""
				},
				{
					"text": "\"I hate it. I hate it so much.\""
				},
				{
					"text": "\"I can't take it anymore.\""
				},
				{
					"text": "\"No more. I need it to end.\""
				},
				{
					"text": "Unable to believe my eyes, I read the sentences over and over again."
				},
				{
					"text": "What state of mind drove him to suicide in the end?"
				},
				{
					"text": "I've kept reading through these diaries until today in hopes of finding out."
				},
				{
					"text": "For the first time, his thoughts rejecting life..."
				},
				{
					"text": "...are exactly the same ones I'm having right now."
				},
				{
					"text": "The same state of mind I had when I pushed Rin away."
				},
				{
					"text": "That adorably naive and misguided jealousy."
				},
				{
					"text": "Her firm insistence."
				},
				{
					"text": "And her pure, heartbroken pain."
				},
				{
					"text": "All I could do was stand like a miserable doll as I faced the person I wanted to see least in the world."
				},
				{
					"text": "I was so miserable and useless and weak."
				},
				{
					"text": "And after acting in such a shameful manner, I'm sitting here like nothing happened. I hate myself for that."
				},
				{
					"text": "You're right, Shuho."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "The resemblance up until now wasn't just a coincidence."
				},
				{
					"text": "What he wrote here are my thoughts put to paper."
				},
				{
					"name": "Arishima",
					"text": "Shuho..."
				},
				{
					"text": "I raise my face from the diary."
				},
				{
					"text": "When he resolved to die, was in the same state of mind as I am now?"
				},
				{
					"text": "It looks like a clear, flowing signpost directed at me."
				},
				{
					"text": "The eternal sluggish despair at being alive."
				},
				{
					"text": "In his words, the unconscious loss of something, and the gradual despair for that which cannot be recovered."
				},
				{
					"text": "That state no one can understand; the self-righteousness of knowing you're the only one."
				},
				{
					"text": "At the end of the meandering road..."
				},
				{
					"text": "Shuho was in the same state of mind. We arrived at the same conclusion."
				},
				{
					"text": "Our lives couldn't be more different."
				},
				{
					"text": "We're completely dissociated from each other."
				},
				{
					"text": "I'm a sad, middle-aged nobody, and he was one of the biggest writers Japan has ever produced."
				},
				{
					"text": "Our lives aren't and never were of the same nature."
				},
				{
					"text": "But..."
				},
				{
					"text": "But perhaps we can be the same in death."
				},
				{
					"text": "I couldn't be what I wanted to be."
				},
				{
					"text": "Not once have I been satisfied with where I am in life."
				},
				{
					"text": "Shuho's the icon I've been longing for."
				},
				{
					"text": "I've finally found a way to be exactly like him."
				},
				{
					"text": "To die the same way."
				},
				{
					"text": "I can put myself in the same environment and the same mental state."
				},
				{
					"text": "And by doing so, in the moment of death..."
				},
				{
					"text": "I can finally become one with my idol."
				},
				{
					"text": "That sounds like a sweeter choice to me than living this dead end, boring life every day for 30 more years."
				},
				{
					"text": "I look up from the notebook and stare into the void."
				},
				{
					"text": "The void in the studio where Shuho once lived."
				},
				{
					"text": "...I need to finish it."
				},
				{
					"text": "I need to be jaded like him."
				},
				{
					"text": "And fight against that life I hate."
				},
				{
					"text": "And become one."
				},
				{
					"text": "One with Shuho."
				},
				{
					"text": "For once, we'll be running side by side, then merge like lanes of traffic down the same cliff..."
				},
				{
					"text": "I feel the corners of my mouth rise."
				},
				{
					"text": "Perhaps I lived my awful life in preparation for this moment."
				},
				{
					"text": "I wouldn't have gotten here if it wasn't for all that despair, all that frustration piling up year on year."
				},
				{
					"text": "I laugh."
				},
				{
					"text": "I laugh out loud in the lone room."
				},
				{
					"text": "A new week has begun."
				},
				{
					"text": "I've spent the whole weekend in this room."
				},
				{
					"text": "I didn't go to the public bath."
				},
				{
					"text": "I haven't changed my clothes."
				},
				{
					"text": "I stopped reading the diaries."
				},
				{
					"text": "Covered in the same raw, beastly stench that Shuho spoke about, I kept on lashing away at all around me to create the same circumstances."
				},
				{
					"text": "I take my phone out and check the screen."
				},
				{
					"text": "Monday morning. Just past 8 a.m."
				},
				{
					"text": "It's almost time for my first lecture of the day."
				},
				{
					"text": "I've spent two full days in this room."
				},
				{
					"text": "I haven't contacted anyone."
				},
				{
					"text": "And naturally, Rin didn't send any messages after that outburst."
				},
				{
					"text": "I'm left with nothing but my thoughts and this room."
				},
				{
					"text": "I go from the study to the living room and out to the balcony."
				},
				{
					"text": "I smoke a cig for the first time in two days."
				},
				{
					"text": "My phone rings while I'm smoking."
				},
				{
					"text": "It's Watanabe."
				},
				{
					"text": "I stare at the phone as it rings on the palm of my hand."
				},
				{
					"text": "It's Monday."
				},
				{
					"text": "The staff meeting has definitely started already."
				},
				{
					"text": "I'm still filled with fear and apprehension."
				},
				{
					"text": "But if I lose to this fear here, nothing will change."
				},
				{
					"text": "The life I've always felt the need to protect is worth nothing."
				},
				{
					"text": "At least, it's not worth anything to me."
				},
				{
					"text": "I can admit it now."
				},
				{
					"text": "But I need to show how worthless it is."
				},
				{
					"text": "To both the world and myself."
				},
				{
					"text": "The phone stops ringing in my hand."
				},
				{
					"name": "Arishima",
					"text": "Heheh..."
				},
				{
					"text": "Laughter bubbles up in me."
				},
				{
					"text": "How anticlimactic."
				},
				{
					"text": "This is the first time I've ever been absent from work."
				},
				{
					"text": "So this is how it feels?"
				},
				{
					"text": "Fear of this weak and fleeting feeling is what has kept me chained to that job all these years?"
				},
				{
					"text": "My phone rings again."
				},
				{
					"text": "Watanabe again."
				},
				{
					"text": "Watanabe..."
				},
				{
					"text": "There's nothing for me where you are."
				},
				{
					"text": "This place is all I have."
				},
				{
					"text": "I found where I belong."
				},
				{
					"text": "The phone stops ringing."
				},
				{
					"text": "This time, it stays silent."
				},
				{
					"text": "I see."
				},
				{
					"text": "So this is the liberation Shuho felt."
				},
				{
					"text": "I've taught on that podium every day for 20 years."
				},
				{
					"text": "Knowing very well that what I taught never helped anyone. That I didn't help anyone."
				},
				{
					"text": "But today I took hold of the reins of my life and abandoned all that."
				},
				{
					"text": "I look down at the city from the veranda."
				},
				{
					"text": "The view from that observation deck was completely different."
				},
				{
					"text": "Far more vast than this, for starters."
				},
				{
					"text": "I remember that scenery I looked out at together with Rin."
				},
				{
					"text": "I probably won't have such a nice time with Rin ever again."
				},
				{
					"text": "The view from the veranda is so minimized that I could reach out and grab it."
				},
				{
					"text": "I can see everyone going about their business in a way I can grasp from here."
				},
				{
					"text": "But even in this reduced scope, there's no place for me to live."
				},
				{
					"text": "And once I finish reading, I'll also lose my role here."
				},
				{
					"text": "What comes after that?"
				},
				{
					"text": "There's only one answer."
				},
				{
					"text": "Shuho died..."
				},
				{
					"text": "...in the bathroom."
				},
				{
					"text": "I grab the last notebook."
				},
				{
					"text": "I begin reading it aloud."
				},
				{
					"text": "Occasionally, I lose track of whether what I'm saying is what I'm thinking, or what's written in the diary."
				},
				{
					"text": "Is Shuho's ghost taking controlling and speaking for me? I don't even know anymore."
				},
				{
					"text": "His diary..."
				},
				{
					"text": "Towards the end, it's actually calmer in tone."
				},
				{
					"text": "I'm convinced that, no matter how vast the world is, there's no place in it for me."
				},
				{
					"text": "And as long as I continue trudging aimlessly in this bog, I will keep hating myself."
				},
				{
					"text": "I could keep on endlessly enumerating the things I hate about myself. All the hate I feel inside of me."
				},
				{
					"text": "The line between life and death has begun to blur."
				},
				{
					"text": "Like how the boundary between waking and sleep disappears during a doze."
				},
				{
					"text": "I see it. Death is at hand."
				},
				{
					"text": "Shuho's last words weren't a message to anyone."
				},
				{
					"name": "Arishima",
					"text": "\"Once you pull yourself out of this narrow, pointless world, you can't go back.\""
				},
				{
					"name": "Arishima",
					"text": "\"Everything but me fits perfectly in the picture, and the world will soon move on, as if I was never there at all.\""
				},
				{
					"name": "Arishima",
					"text": "\"There is nothing left for me but death.\""
				},
				{
					"name": "Arishima",
					"text": "\"No loneliness or fear.\""
				},
				{
					"name": "Arishima",
					"text": "\"I've simply realized my true place at last, and I'm going where I should have always been.\""
				},
				{
					"text": "Those were Shuho's last words."
				},
				{
					"text": "I close the notebook and get up."
				},
				{
					"text": "I wonder why? Maybe because I know what happened here?"
				},
				{
					"text": "The air hangs heavy in the dim bathroom."
				},
				{
					"text": "It clings to me like a viscous, dense substance."
				},
				{
					"text": "So this is where Shuho died."
				},
				{
					"text": "Will I die here too?"
				},
				{
					"text": "I look at the bathtub."
				},
				{
					"text": "That's the only spot in this bathroom that looks eerily clean."
				},
				{
					"text": "There are no traces of blood."
				},
				{
					"text": "It looks almost new."
				},
				{
					"text": "Regardless of his intentions, Shuho's death was announced as a simple turn of destiny and, looking at the tub, I could almost believe it."
				},
				{
					"name": "Arishima",
					"text": "But it wasn't so."
				},
				{
					"text": "I'm sure he wouldn't have wanted his traces to be erased."
				},
				{
					"text": "I'm sure he would have wanted the proof of his death to remain."
				},
				{
					"text": "He didn't want his death to be clean..."
				},
				{
					"text": "More horrible, miserable..."
				},
				{
					"text": "He wanted everyone to hear his screams of agony."
				},
				{
					"text": "That's how he wanted to go."
				},
				{
					"text": "I step into the bathtub and lie down."
				},
				{
					"text": "The hard, cold surface envelops me."
				},
				{
					"text": "I look up at the ceiling."
				},
				{
					"text": "Shuho probably slit his wrists."
				},
				{
					"text": "Rin said the blood had turned black like a stain when she found him."
				},
				{
					"text": "What did he use?"
				},
				{
					"text": "A kitchen knife? A box cutter?"
				},
				{
					"text": "I should have one of those in my bag."
				},
				{
					"text": "Suddenly, a foul stench hits my nose."
				},
				{
					"text": "It's my own smell."
				},
				{
					"text": "It reminds me that I'm here."
				},
				{
					"text": "I see."
				},
				{
					"text": "Death seems worthwhile enough to get away from this infernal stench."
				},
				{
					"text": "The shower head is facing my way."
				},
				{
					"text": "I raise myself and pull down the shower lever."
				},
				{
					"text": "A small stream of water pours down onto me with force."
				},
				{
					"text": "The cold water washes over me, leaving me breathless for a moment."
				},
				{
					"text": "For a brief moment, I feel like life has stopped."
				},
				{
					"text": "But it soon comes back to me."
				},
				{
					"text": "My soaked shirt sticks to my skin."
				},
				{
					"text": "The same one I wore when walking around Sakuragicho with Rin."
				},
				{
					"text": "I haven't changed clothes since then."
				},
				{
					"text": "It's not so bad to have my body temperature washed away by the icy water."
				},
				{
					"text": "How long can my body fight against the cold of the water?"
				},
				{
					"text": "I feel like I could waste away in a few hours, or continue suffering for a couple days."
				},
				{
					"text": "But this cold stream is definitely shaving down my time."
				},
				{
					"text": "It's leading me to death, slowly but surely."
				},
				{
					"text": "Being led to the eternal sleep by something familiar like water may not be so bad."
				},
				{
					"text": "The water begins pooling at the bottom of the bathtub."
				},
				{
					"text": "I close my eyes."
				},
				{
					"text": "Only the sound of running water reaches my ears."
				},
				{
					"text": "I had a boring life."
				},
				{
					"text": "I believe so from the bottom of my heart."
				},
				{
					"text": "My life was no story."
				},
				{
					"text": "I loved stories, but they never loved me back."
				},
				{
					"text": "But my last few days were fun."
				},
				{
					"text": "I managed to get close to Shuho."
				},
				{
					"text": "I was able to talk with Rin."
				},
				{
					"text": "At the very least, I was able to understand something no one else ever did: Shuho's death."
				},
				{
					"text": "I was able to sympathize with the man."
				},
				{
					"text": "It was fun."
				},
				{
					"text": "I feel like I became the protagonist of my own little story."
				},
				{
					"text": "But time is up."
				},
				{
					"text": "I gotta turn the last page."
				},
				{
					"text": "It's enough."
				},
				{
					"text": "I'm tired."
				},
				{
					"text": "I don't want to keep going."
				},
				{
					"text": "I don't want to hurt Rin ever again."
				},
				{
					"text": "Going back to the life I had before this is too much."
				},
				{
					"text": "I can't return to that self."
				},
				{
					"text": "I want to end it here, on my own terms."
				},
				{
					"text": "If I let this chance to die that Shuho has given me pass me by, I'll default back to that excuse of a life."
				},
				{
					"text": "I lost Rin, my wife, my house, my job."
				},
				{
					"text": "I'll just be hovering between life and death, a walking corpse, watching the days pass me by."
				},
				{
					"text": "And a few decades later..."
				},
				{
					"text": "I'll die alone in a ditch somewhere."
				},
				{
					"text": "No one will miss me."
				},
				{
					"text": "Would it be any different from me taking the initiative and ending it all on my own terms?"
				},
				{
					"text": "No, there's no difference."
				},
				{
					"text": "I know that better than anyone."
				},
				{
					"text": "I raise my head and take the water face on."
				},
				{
					"text": "Closing my eyes, I simply listen to it gushing down."
				},
				{
					"text": "I'm beginning to tremble from the cold."
				},
				{
					"text": "My teeth are chattering."
				},
				{
					"text": "Now I'm just waiting for death like Shuho did."
				},
				{
					"text": "A weird noise reaches my ears besides the water."
				},
				{
					"text": "I slowly open my eyes."
				},
				{
					"text": "The water mercilessly assaults them."
				},
				{
					"text": "The water seeps through the tiny gap between my eyelids and eyeball."
				},
				{
					"text": "My phone vibrates in my pocket twice."
				},
				{
					"text": "I stare up at the ceiling in a daze."
				},
				{
					"text": "I blink again and again."
				},
				{
					"text": "My phone vibrates yet again."
				},
				{
					"text": "I reach for it in my pocket and take a look."
				},
				{
					"text": "Messages from Rin."
				},
				{
					"text": "\"Photo has been sent.\""
				},
				{
					"text": "That's what it says on the display."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Why is the phone shaking?"
				},
				{
					"text": "Ah, because my hand is shaking."
				},
				{
					"text": "I can hear Shuho's voice in my head."
				},
				{
					"text": "\"Don't look.\""
				},
				{
					"text": "\"Don't listen to her.\""
				},
				{
					"text": "\"Don't let a once in a lifetime death get away from you... Don't live.\""
				},
				{
					"text": "I hold onto my phone with quivering hands."
				},
				{
					"text": "I feel like I'm standing on the edge between life and death."
				},
				{
					"text": "If I turn off this phone and close my eyes..."
				},
				{
					"text": "To never open them again..."
				},
				{
					"text": "I can be one in death with Hatano Shuho."
				},
				{
					"text": "We may have been completely different in life, but we can be together in death."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "It's better for Rin if I'm not around."
				},
				{
					"text": "I can't stand how pure and sweet she is."
				},
				{
					"text": "Let me die, Rin. Please."
				},
				{
					"text": "Let me rest."
				},
				{
					"text": "I don't have the energy to endure this pain anymore."
				},
				{
					"text": "My heart's already broken in half."
				},
				{
					"text": "The moment I yelled at you and dirtied your soul..."
				},
				{
					"text": "I did something to you that can't be taken back."
				},
				{
					"text": "Let me go away."
				},
				{
					"text": "Please..."
				},
				{
					"text": "Don't make me keep piling on regrets."
				},
				{
					"name": "Arishima",
					"text": "Hah... Hah..."
				},
				{
					"text": "I can hear my breath growing shallow."
				},
				{
					"text": "My internal organs are feeling the pressure, and my blood circulation is slowly grinding to a halt."
				},
				{
					"text": "It looks like I'm finally shuffling off this mortal coil."
				},
				{
					"text": "The water is steadily stealing my temperature."
				},
				{
					"text": "People can die this easily?"
				},
				{
					"text": "I can feel myself drifting out of consciousness."
				},
				{
					"text": "This darkness..."
				},
				{
					"text": "I can see glimpses of it. It's death."
				},
				{
					"text": "I realize instinctively."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "As I drift away..."
				},
				{
					"text": "A ringing in my ears grows louder."
				},
				{
					"text": "Eventually the sound grows so intense that I can't even hear the water."
				},
				{
					"text": "But then the sound shifts and coats me, like melting metal, taking form around me."
				},
				{
					"name": "Rin",
					"text": "You will crawl back from the edge of death..."
				},
				{
					"name": "Rin",
					"text": "Professor..."
				},
				{
					"name": "Rin",
					"text": "Save me, please..."
				},
				{
					"text": "\"How many points?\""
				},
				{
					"text": "The sentence is like a ray of sunlight penetrating my hazy consciousness."
				},
				{
					"text": "It bounces off the shimmering surface of water beneath my bowed head."
				},
				{
					"text": "It's the display of my phone."
				},
				{
					"text": "\"How many points?\""
				},
				{
					"text": "Rin's message is reflected perfectly."
				},
				{
					"text": "She's asking me something."
				},
				{
					"text": "I can't tell if I'm delirious or if this is really happening."
				},
				{
					"text": "My arm feels stiff and heavy."
				},
				{
					"text": "As soon as I try to move it, my numb fingers shiver in response."
				},
				{
					"text": "But I manage."
				},
				{
					"text": "With quivering fingers, I swipe the screen."
				},
				{
					"text": "I open the image Rin sent me."
				},
				{
					"text": "It's a picture of three filleted fish."
				},
				{
					"text": "I stare at it in disbelief."
				},
				{
					"text": "\"How many points?\""
				},
				{
					"text": "That's what she wrote."
				},
				{
					"text": "The image of her working hard in the kitchen comes to mind."
				},
				{
					"text": "Her clumsily handling the knife and cleaning the fish."
				},
				{
					"text": "She still..."
				},
				{
					"text": "...wants me?"
				},
				{
					"text": "The image of her eating all alone in the cafeteria flashes through my mind."
				},
				{
					"text": "Her figure looking out the classroom's window."
				},
				{
					"text": "Even though I hurt her..."
				},
				{
					"text": "I can picture her, stubbornly trying to cling to me. The image is burned into my eyelids."
				},
				{
					"name": "Arishima",
					"text": "Rin..."
				},
				{
					"name": "Arishima",
					"text": "Rin..."
				},
				{
					"text": "I mutter her name time and time again."
				},
				{
					"text": "In time, my mutters drown out the sound of water."
				},
				{
					"text": "I start speaking louder and louder."
				},
				{
					"text": "Why...?"
				},
				{
					"text": "Why am I calling her name so strongly?"
				},
				{
					"text": "That day when I forced myself on my wife..."
				},
				{
					"text": "The only person I was thinking about was Rin."
				},
				{
					"text": "I despaired at the thought that it wouldn't go away."
				},
				{
					"text": "Now, standing on the brink of death, with my sight and hearing all but gone, what remains is Rin's image."
				},
				{
					"text": "Her memory growing bigger and clearer in my mind."
				},
				{
					"name": "Arishima",
					"text": "I..."
				},
				{
					"text": "My teeth are chattering."
				},
				{
					"text": "A groan escapes my mouth."
				},
				{
					"name": "Arishima",
					"text": "I-I..."
				},
				{
					"text": "Can't I even die?"
				},
				{
					"text": "I'm not needed by anyone. I hurt those I come close to."
				},
				{
					"text": "I've already lost all semblance of a normal life."
				},
				{
					"text": "My life is worthless. I know that better than anyone."
				},
				{
					"name": "Arishima",
					"text": "A-Am I scared?"
				},
				{
					"text": "Does death..."
				},
				{
					"text": "...scare me so?"
				},
				{
					"name": "Arishima",
					"text": "Uh... Ah... Hah..."
				},
				{
					"text": "My voice quavers."
				},
				{
					"text": "I went all the way up to the edge."
				},
				{
					"text": "And I brushed against death's cold embrace."
				},
				{
					"name": "Arishima",
					"text": "Sh-Shit... Shit!"
				},
				{
					"text": "I thought I was serious about this."
				},
				{
					"text": "I thought that for once I would do something with my free will."
				},
				{
					"text": "I thought I could follow in Shuho's footsteps."
				},
				{
					"name": "Arishima",
					"text": "I-I can't...die... I can't... Uuuh..."
				},
				{
					"text": "I feel something wet and warm run down my cheeks."
				},
				{
					"text": "It's tears."
				},
				{
					"text": "They run down my frozen cheeks and reach my lips."
				},
				{
					"name": "Arishima",
					"text": "Sh-Shuho..."
				},
				{
					"text": "In the end..."
				},
				{
					"text": "Shuho and I are different."
				},
				{
					"text": "While he became a great writer, I became a sad and useless middle-aged man."
				},
				{
					"text": "Whereas he decided to die and went through with it..."
				},
				{
					"text": "I chose death, yet I'll end up crawling out of this bathroom."
				},
				{
					"text": "But..."
				},
				{
					"name": "Arishima",
					"text": "R-R-Rin... Rin..."
				},
				{
					"text": "I call her name with as much force as I can muster."
				},
				{
					"text": "I clench my teeth and squeeze her name out like a mantra."
				},
				{
					"name": "Arishima",
					"text": "Not yet... Not yet..."
				},
				{
					"text": "I still..."
				},
				{
					"text": "...have something I need you to know."
				},
				{
					"text": "I need to tell you."
				},
				{
					"text": "This miserable, ugly, and helpless mess that I've become..."
				},
				{
					"text": "This useless piece of trash that can't even die..."
				},
				{
					"text": "Just thinking of you, remembering your voice..."
				},
				{
					"text": "For this, I would cling to life like the leech I am..."
				},
				{
					"text": "Because I want you to know."
				},
				{
					"text": "I..."
				},
				{
					"text": "Even if I hurt you once..."
				},
				{
					"text": "I don't want to die."
				},
				{
					"name": "Arishima",
					"text": "Uuh.... Nngh!"
				},
				{
					"text": "With my trembling hands, I grip the side of the bathtub."
				},
				{
					"text": "The cold stream of water pierces all the way to my brain as I slowly heave myself up."
				},
				{
					"text": "\"You'll crawl from the edge of death.\""
				},
				{
					"text": "I hear her voice."
				},
				{
					"text": "I'll write it."
				},
				{
					"text": "This time I'll make it."
				},
				{
					"text": "I'll depict how weak and flawed a person I am."
				},
				{
					"text": "And you, Rin..."
				},
				{
					"text": "You need to know how irreplaceable you are, how you changed my life—how you saved me."
				},
				{
					"text": "And how, despite all that, all I did was hurt you and feel sorry for myself after."
				},
				{
					"text": "I'll write it all down for you."
				},
				{
					"text": "Something so intense that you'll forget about your parents denying your existence."
				},
				{
					"text": "So you'll know how deep my feelings for you run."
				},
				{
					"text": "I won't die until I finish writing it."
				},
				{
					"name": "Arishima",
					"text": "Ngh... Uuugh..."
				},
				{
					"text": "I get up."
				},
				{
					"text": "I feel weak and unsteady on my feet."
				},
				{
					"text": "After slapping at empty air countless times, I finally manage to put a hand on the shower handle and stop the water."
				},
				{
					"text": "The drain makes a little whirlpool of freezing water."
				},
				{
					"text": "The echo of running water still remains in the room."
				},
				{
					"text": "I need to go and save Rin."
				},
				{
					"text": "I return to the studio, still soaked to my core."
				},
				{
					"text": "I rub my hands against my cold, trembling body."
				},
				{
					"text": "Slowly but surely, a flicker of heat is born and grows within."
				},
				{
					"text": "I know Shuho now."
				},
				{
					"text": "I have an infinitely deeper understanding of him compared to before I came to this studio."
				},
				{
					"text": "But what I can do for Rin right now is not depict Shuho."
				},
				{
					"text": "The hurtful words I shouted at her come back to me like a boomerang."
				},
				{
					"text": "What happened between her and her dad is hers to internalize and deal with. I can't step into it in a vain attempt to save her."
				},
				{
					"text": "Even if that's what she thinks she wants, it's not the answer."
				},
				{
					"text": "What I can do..."
				},
				{
					"text": "What I CAN write..."
				},
				{
					"text": "Is that no matter what, there is someone who wants her madly; a person who would do anything to see her happy."
				},
				{
					"text": "She needs to know that she's not alone, that there's someone out there who wants her to be in this world."
				},
				{
					"text": "I can't do anything but that."
				},
				{
					"text": "We share that feeling of being at the edge of the world, left out and detached from everyone else."
				},
				{
					"text": "Sharing meals and words together, we came to understand that of one another."
				},
				{
					"text": "I know that helplessness very well."
				},
				{
					"text": "I now realize how unstable I am, now that I feel no connection to anything."
				},
				{
					"text": "How painful it is to live like that."
				},
				{
					"text": "And Rin feels the same way."
				},
				{
					"text": "That's why, at the very least, I need to let her know that she is wanted."
				},
				{
					"text": "While making my feelings manifest like that may not saver her, maybe it can bring her some peace of mind."
				},
				{
					"text": "And no matter how awful my life may be, I think that if I can at least help assuage her heart, I can live on."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "I'm weak."
				},
				{
					"text": "Far weaker than Shuho."
				},
				{
					"text": "That is the first truth that I learned about him when I stepped into this room."
				},
				{
					"text": "I'm weaker than he ever was at his lowest."
				},
				{
					"text": "More unsightly than he ever was at his lowest."
				},
				{
					"text": "And more vile than he was at his lowest."
				},
				{
					"text": "He was himself, which is more than I can say about myself."
				},
				{
					"text": "That's why I came back, shaking like a leaf and unable to die."
				},
				{
					"text": "I must admit it to myself."
				},
				{
					"text": "I have no choice but to accept myself."
				},
				{
					"text": "I open my bag."
				},
				{
					"text": "I grab my laptop and turn it on."
				},
				{
					"text": "I create a new file and get to writing."
				},
				{
					"text": "I'm writing this just for Rin's eyes."
				},
				{
					"text": "She's the only one who ever needs to read it."
				},
				{
					"text": "I'm writing this with the sole intent of communicating it to her."
				},
				{
					"text": "I begin tapping away at the keys."
				},
				{
					"text": "The tremors in my limbs haven't stopped yet."
				},
				{
					"text": "But I press on."
				},
				{
					"text": "For the first time in my life, I feel unstoppable."
				},
				{
					"text": "I love my writing more than the lines any literary genius could put together."
				},
				{
					"text": "A once in a lifetime moment."
				},
				{
					"text": "When I met Shuho, all my paper thin bravado and confidence crumpled, and I got into the habit of running away."
				},
				{
					"text": "I was scared of giving it my all and not even coming close to his level."
				},
				{
					"text": "I was afraid of living."
				},
				{
					"text": "Of my routine being broken."
				},
				{
					"text": "Of having my weaknesses made apparent."
				},
				{
					"text": "That's why..."
				},
				{
					"text": "When I fell in love with Rin, I tried to lie to myself again."
				},
				{
					"text": "I told myself that it was only to protect my current life."
				},
				{
					"text": "But it was a lie."
				},
				{
					"text": "My life was meaningless."
				},
				{
					"text": "My marriage was a sham."
				},
				{
					"text": "When I faced Rin, I..."
				},
				{
					"text": "I simply realized that it was all bullshit. I wasn't protecting anything."
				},
				{
					"text": "All I ever did was pile on the years, without anything but my age to show for it."
				},
				{
					"text": "That fact that, by my forties, I'd never lost anything was proof that I never even attempted to win something, to do anything with my life."
				},
				{
					"text": "And I was afraid of realizing my own deception."
				},
				{
					"text": "But I'm not afraid anymore."
				},
				{
					"text": "I have nothing left to lose, no appearances to protect."
				},
				{
					"text": "I am immediately struck by the magnitude of time that I simply wasted."
				},
				{
					"text": "Infinite possibilities expand in front of Rin. The world is her oyster."
				},
				{
					"text": "Her future is unwritten, and her possibilities are as vast as the view we saw from that observation deck."
				},
				{
					"text": "I want to tell her that."
				},
				{
					"text": "That she still has the power to change her life."
				},
				{
					"text": "And that there are people in the world who want to see her blossom into her best self."
				},
				{
					"text": "I need to tell her."
				},
				{
					"text": "With that single desire, I push on my proverbial brush."
				},
				{
					"text": "How much time has passed?"
				},
				{
					"text": "I forget about eating and sleeping in favor of writing."
				},
				{
					"text": "I pour my heart and soul into it."
				},
				{
					"text": "How I tried to turn away from my desires after falling in love with Rin, and tried to keep up appearances."
				},
				{
					"text": "How, in a desperate attempt to fool myself, I trampled upon my wife's wishes and hurt her deeply."
				},
				{
					"text": "I write it all as it happened."
				},
				{
					"text": "My hands don't stop for a minute."
				},
				{
					"text": "With my undying feelings for Rin as the driving force, I write down all that I want to convey."
				},
				{
					"text": "By the time I come to from my writing frenzy, my clothes are dry."
				},
				{
					"text": "The thin fabric of my shirt completely dry."
				},
				{
					"text": "How many days has it been?"
				},
				{
					"text": "I can't even tell if it's day or night."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Abruptly, I realize that I'm out of things to write."
				},
				{
					"text": "For a moment, I wonder why, but I quickly realize that I've simply written all there was to write."
				},
				{
					"text": "Stunned, I stare at the blinking cursor on my screen."
				},
				{
					"text": "My field of view slowly widens away from the narrow screen."
				},
				{
					"text": "All the focus I had converged on writing expands into perceiving everything around me again."
				},
				{
					"text": "That little buzz that I always had in my heart, that nagging feeling of wrongness that I pushed to the back of my mind..."
				},
				{
					"text": "I can't feel it anymore."
				},
				{
					"text": "My heart feels like the swaying surface of a calm sea."
				},
				{
					"text": "I'm at peace."
				},
				{
					"text": "My gaze wanders up for a moment."
				},
				{
					"text": "I think the text I wrote is longer than what I wrote for Rin before."
				},
				{
					"text": "I save the file."
				},
				{
					"text": "I think about a title for it, and decide to go with \"For Rin.\""
				},
				{
					"text": "I go out for the first time in what must be days."
				},
				{
					"text": "The sun is setting on the horizon."
				},
				{
					"text": "The sky's warm colors hurt my eyes."
				},
				{
					"text": "I load the file onto an USB drive and go to a convenience store to print it and package it up in a brown envelope."
				},
				{
					"text": "And with that in hand, I head to Rin's apartment."
				},
				{
					"text": "As I walk to her place, a bus slows down and stops near me."
				},
				{
					"text": "I see Rin alighting from the bus."
				},
				{
					"text": "I come to a stop and watch her from afar."
				},
				{
					"text": "When she happens to turn my way, she notices me immediately."
				},
				{
					"text": "Her eyes widen in surprise, and we stay like that for a moment, saying nothing."
				},
				{
					"name": "Rin",
					"text": "Professor?"
				},
				{
					"name": "Arishima",
					"text": "...Rin."
				},
				{
					"text": "We face each other for what seems like hours."
				},
				{
					"name": "Rin",
					"text": "Are you okay?"
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"text": "She looks uneasy, like she's peering down at the bottom of a deep, dark well."
				},
				{
					"name": "Rin",
					"text": "You look really bad."
				},
				{
					"text": "I chuckle involuntarily."
				},
				{
					"text": "I don't doubt that I do. I haven't eaten in days."
				},
				{
					"name": "Arishima",
					"text": "I've been writing."
				},
				{
					"name": "Rin",
					"text": "Writing?"
				},
				{
					"text": "I walk up to her and present the envelope."
				},
				{
					"text": "She looks down at it, and then up at me again."
				},
				{
					"name": "Arishima",
					"text": "I wrote all I want you to know here. Everything I want to tell you."
				},
				{
					"name": "Rin",
					"text": "Everything you want me to know...?"
				},
				{
					"text": "I nod."
				},
				{
					"text": "She seems like she's about to say something, but instead she just stares back at me in silence."
				},
				{
					"name": "Arishima",
					"text": "When I finished writing this, I felt something I've never felt before."
				},
				{
					"text": "I try to search for the right words."
				},
				{
					"text": "She looks up straight into my eyes."
				},
				{
					"name": "Arishima",
					"text": "I felt like writing this saved me somehow."
				},
				{
					"name": "Arishima",
					"text": "I got a sense of fulfillment that I've never felt before from writing."
				},
				{
					"name": "Arishima",
					"text": "And it's all thanks to you. Meeting you has changed me."
				},
				{
					"name": "Arishima",
					"text": "I realized how miserable and weak I am."
				},
				{
					"text": "She blinks several times, clearly taken aback."
				},
				{
					"name": "Rin",
					"text": "What did you write?"
				},
				{
					"name": "Arishima",
					"text": "I wrote about myself."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "She doesn't look away from me."
				},
				{
					"name": "Rin",
					"text": "There's something you want to show me about yourself? It's for me?"
				},
				{
					"text": "I nod again."
				},
				{
					"name": "Arishima",
					"text": "The more I fell for you, the more I tried to fool myself."
				},
				{
					"name": "Arishima",
					"text": "I kept trying to suppress the feelings I was having for a student who was young enough to be my daughter."
				},
				{
					"text": "Rin silently meets my gaze."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"name": "Arishima",
					"text": "You can read everything about me in there."
				},
				{
					"name": "Arishima",
					"text": "At first I thought that I should write about Shuho."
				},
				{
					"name": "Arishima",
					"text": "Since you can't bring yourself to be in that studio, I thought I should learn all that Shuho was and depict it for you."
				},
				{
					"name": "Arishima",
					"text": "But..."
				},
				{
					"text": "I wait for the words to float up from my soul."
				},
				{
					"name": "Arishima",
					"text": "But that depends on how you perceive him. He's already dead."
				},
				{
					"name": "Arishima",
					"text": "I can't tell you what to think about him—no one can."
				},
				{
					"name": "Arishima",
					"text": "I realized that what I yelled at you for applied to me, too."
				},
				{
					"text": "Suddenly, her eyes begin tearing up."
				},
				{
					"name": "Arishima",
					"text": "But I still wanted to do something for you."
				},
				{
					"name": "Arishima",
					"text": "It's the first time I've felt such a strong need to do something for anyone."
				},
				{
					"name": "Arishima",
					"text": "Even if I could depict Shuho as he was, it would still be just a pale imitation of the real person."
				},
				{
					"name": "Arishima",
					"text": "But I can write about myself."
				},
				{
					"name": "Arishima",
					"text": "No, the ONLY thing I can write about is myself. That's what I realized."
				},
				{
					"text": "I stare right back at her."
				},
				{
					"name": "Arishima",
					"text": "I wrote because I wanted you to know."
				},
				{
					"name": "Arishima",
					"text": "I wanted you to know that there's someone out there, one single person..."
				},
				{
					"name": "Arishima",
					"text": "...who loves you with all his heart and wants for you to be happy."
				},
				{
					"name": "Arishima",
					"text": "And when I realized that I wanted you to know..."
				},
				{
					"name": "Arishima",
					"text": "Depicting people—depicting myself..."
				},
				{
					"name": "Arishima",
					"text": "...became a tool for it, rather than the objective."
				},
				{
					"name": "Rin",
					"text": "..."
				},
				{
					"text": "Rin lowers her gaze and stares at the brown envelope in my hands."
				},
				{
					"name": "Arishima",
					"text": "Maybe this is completely different from what you expected from me."
				},
				{
					"name": "Arishima",
					"text": "Maybe I'm just saving myself here."
				},
				{
					"text": "When I say this, she raises her head again and takes a slow, deep breath."
				},
				{
					"name": "Arishima",
					"text": "I crawled back from the edge of death. Though I can't say it was as cool as it sounds."
				},
				{
					"text": "She looks up at me in complete silence."
				},
				{
					"text": "She doesn't try to reach for the envelope."
				},
				{
					"text": "She simply stares at me."
				},
				{
					"text": "We stay like that for a long while."
				},
				{
					"text": "A car passes by us and and trundles away."
				},
				{
					"text": "We've been staring at each other for a while now."
				},
				{
					"text": "It might look strange from an outside perspective."
				},
				{
					"text": "But it seems like the most natural thing in the world to me."
				},
				{
					"text": "In time, she slowly speaks up."
				},
				{
					"name": "Rin",
					"text": "Say it one more time, please."
				},
				{
					"name": "Arishima",
					"text": "Huh?"
				},
				{
					"name": "Rin",
					"text": "That you love me..."
				},
				{
					"name": "Rin",
					"text": "Let me hear it one more time."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "Her gaze never leaves mine."
				},
				{
					"text": "I feel drawn in by her eyes, like my very soul is being sucked into her."
				},
				{
					"text": "In fact, I feel like my heart has been captured by those rose eyes."
				},
				{
					"text": "I can't escape."
				},
				{
					"text": "...No, there's no need to escape."
				},
				{
					"text": "A soft smile spreads across my face."
				},
				{
					"name": "Arishima",
					"text": "I love you."
				},
				{
					"text": "I hear something fall to the ground."
				},
				{
					"text": "The sound of Rin's bag falling on the sidewalk."
				},
				{
					"text": "With her eyes still locked onto mine, she reaches out and cups my cheeks."
				},
				{
					"text": "The moment I feel her warmth..."
				},
				{
					"text": "I'm drawn in close to her."
				},
				{
					"text": "My entire field of view is filled with her."
				},
				{
					"text": "Her bangs flutter in the wind in front of me."
				},
				{
					"text": "I feel a warmth that is not my own all over my face and lips."
				},
				{
					"text": "The tip of my nose brushes her cheek."
				},
				{
					"text": "Her soft sighs reach my ears."
				},
				{
					"text": "My heart is beating so hard it's almost fit to burst."
				},
				{
					"text": "Rin becomes my entire world."
				},
				{
					"text": "Everything I see, hear, and feel..."
				},
				{
					"text": "All of it is coming from Rin."
				},
				{
					"text": "She has her eyes closed."
				},
				{
					"text": "I follow her lead and do the same."
				},
				{
					"text": "The sensation of our lips together is heightened."
				},
				{
					"text": "She slowly breaks the kiss."
				},
				{
					"text": "Her sweet smiles spreads from ear to ear."
				},
				{
					"name": "Arishima",
					"text": "Rin, I..."
				},
				{
					"text": "She presses her index finger to my lips, sealing them."
				},
				{
					"text": "She smiles at me, picks up her bag, takes me by the hand, and leads me back to her apartment."
				},
				{
					"text": "I follow her in silence."
				},
				{
					"text": "When the door closes behind me, Rin turns around, flings her arms around my neck and kisses me fervently."
				},
				{
					"text": "I wrap my hands around her soft waist."
				},
				{
					"text": "When she stretches out, the movement does wonderful things to her waistline."
				},
				{
					"text": "I slide my hand over the pleasant curve and hold her tight."
				},
				{
					"name": "Rin",
					"text": "Mmh..."
				},
				{
					"text": "As I embrace her, she lets out a pleasant sigh."
				},
				{
					"name": "Rin",
					"text": "Professor... Haah..."
				},
				{
					"text": "She says my name as our lips come together."
				},
				{
					"text": "She bashfully licks along my lips with her small tongue, letting out breaths of pure need."
				},
				{
					"text": "In response, I stick out my tongue to meet hers."
				},
				{
					"text": "She timidly kisses it, like a little pecking bird."
				},
				{
					"name": "Arishima",
					"text": "Mm..."
				},
				{
					"name": "Rin",
					"text": "Do me. Right here, right now."
				},
				{
					"name": "Arishima",
					"text": "Rin, that's..."
				},
				{
					"name": "Rin",
					"text": "Mmh?"
				},
				{
					"text": "She breaks the kiss and, still clinging onto my neck, tilts her head to the side in confusion."
				},
				{
					"name": "Arishima",
					"text": "I didn't come prepared, and..."
				},
				{
					"name": "Rin",
					"text": "Prepared?"
				},
				{
					"name": "Arishima",
					"text": "And I need a bath..."
				},
				{
					"text": "She kisses me again, sealing my lips shut."
				},
				{
					"text": "This time she forcefully pushes her tongue into my mouth and explores every nook and cranny."
				},
				{
					"name": "Rin",
					"text": "I don't care. Just for today... it's our very first time. Stop thinking about everything else."
				},
				{
					"name": "Arishima",
					"text": "But..."
				},
				{
					"text": "She puts her hands on my head and pulls my ear closer to her mouth."
				},
				{
					"name": "Rin",
					"text": "Make love to me. Right now."
				},
				{
					"name": "Rin",
					"text": "If you don't, it won't ever happen again."
				},
				{
					"name": "Arishima",
					"text": "..."
				},
				{
					"text": "She stares into my eyes."
				},
				{
					"name": "Rin",
					"text": "Make love to me right now..."
				},
				{
					"text": "Something inside of me snaps."
				},
				{
					"text": "The little thread holding my reason in place is cut."
				},
				{
					"text": "Before she can even blink, I capture her mouth in a passionate kiss."
				},
				{
					"text": "I slide my tongue between her soft lips and taste her deeper than ever."
				},
				{
					"text": "I hug her body close to mine and push her down onto the entrance's wooden floor."
				},
				{
					"name": "Rin",
					"text": "There's only you and me here."
				},
				{
					"name": "Rin",
					"text": "Please..."
				},
				{
					"name": "Rin",
					"text": "Make love to me like we're the only ones in the world... I want you to fill me completely..."
				}
			]
		},
		{}
	]
}