{
	"scenes": [
		{},
		{
			"texts": [
				{
					"name": "Rob",
					"text": "Oi, where did Will go?"
				},
				{
					"name": "Olivia",
					"text": "We went to get some salt upstairs. He is taking long, isn't he?"
				},
				{
					"name": "Father",
					"text": "Maybe he's lazying around?"
				},
				{
					"name": "Olivia",
					"text": "We're closing already, so it's the same, but why is Will resting while I'm busting my arse here?"
				},
				{
					"text": "I grab the closed sign and walk to the entrance."
				},
				{
					"text": "But then..."
				},
				{
					"name": "Olivia",
					"text": "Oh..."
				},
				{
					"name": "Rob",
					"text": "Huh? Oh..."
				},
				{
					"text": "A woman walks into the pub."
				},
				{
					"text": "There's something familiar about her."
				},
				{
					"text": "I stare at her face for a moment."
				},
				{
					"text": "She gives me a small, timid smile."
				},
				{
					"text": "I remember that smile."
				},
				{
					"name": "Olivia",
					"text": "You're..."
				},
				{
					"text": "The woman from that night."
				},
				{
					"text": "The one I crossed paths with on my way to the manor."
				},
				{
					"text": "It's definitely her."
				},
				{
					"text": "I just know it."
				},
				{
					"text": "A rush of joy courses through me."
				},
				{
					"text": "Ever since then, I've been curious about what kind of person she is."
				},
				{
					"name": "Olivia",
					"text": "Are you alone?"
				},
				{
					"text": "She nods."
				},
				{
					"name": "Olivia",
					"text": "Are you okay with a bar seat? Please, come in."
				},
				{
					"text": "I watch the woman as she walks to the counter."
				},
				{
					"text": "She's no ordinary person."
				},
				{
					"text": "I realize that straight away."
				},
				{
					"text": "That's the gait of a person who stands upon the stage."
				},
				{
					"text": "Her movements are so graceful and ingrained that they blend into her everyday motions."
				},
				{
					"text": "It's something only another actor would notice."
				},
				{
					"text": "I want it."
				},
				{
					"text": "I want her in my troupe."
				},
				{
					"text": "Holding back my excitement, I go behind the counter."
				},
				{
					"name": "Olivia",
					"text": "What would you like to drink? I'll join you. We ladies should enjoy a cup or two together."
				},
				{
					"text": "Still silent, the woman points to a bottle of aqua vitae on the shelf."
				},
				{
					"text": "It's a strong spirit that we recently got in stock."
				},
				{
					"text": "She gracefully places a shilling on the counter."
				},
				{
					"name": "Olivia",
					"text": "You want to buy the whole bottle?"
				},
				{
					"text": "She nods."
				},
				{
					"text": "She manages to make even that nod look like the most beautiful thing."
				},
				{
					"name": "Olivia",
					"text": "I see you have good taste. Well then."
				},
				{
					"text": "I take two glasses and pour the thick tawny liquid into them."
				},
				{
					"name": "Olivia",
					"text": "Say, why don't we play a game? Whoever can drink the other under the counter has to do whatever the winner says."
				},
				{
					"text": "The woman's eyes glimmer with a mysterious light when I say that."
				},
				{
					"text": "A smile touches her lips."
				},
				{
					"text": "It seems like she finds the idea amusing."
				},
				{
					"text": "She takes her glass and raises it in front of me."
				},
				{
					"name": "Olivia",
					"text": "To our meeting tonight."
				},
				{
					"text": "We clink our glasses together."
				},
				{
					"text": "The hard spirit burns its way down my throat."
				},
				{
					"text": "It's stronger than I expected."
				},
				{
					"text": "I try to remember the number of cups of ale I shared with customers today."
				},
				{
					"text": "I stopped counting at some point."
				},
				{
					"text": "If I knew this was gonna happen, I would have stayed sober."
				},
				{
					"text": "I feel the tension mounting in me after the first drink."
				},
				{
					"text": "I take short, shallow breaths so the heat doesn't show in my face."
				},
				{
					"text": "The woman is already waiting for a refill, her glass set on the counter."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Rob",
					"text": "Heheh, talk about an elegant way to pick a quarrel."
				},
				{
					"name": "Olivia",
					"text": "This is not a quarrel, and I'd appreciate it if you kept your comments to yourself."
				},
				{
					"name": "Rob",
					"text": "Hey, Olivia! You're not looking so good, lass!"
				},
				{
					"name": "Olivia",
					"text": "I'll sew your mouth shut!"
				},
				{
					"text": "By the time I lose count of how many cups we've shared, my stomach is ready to regurgitate everything I forced into it."
				},
				{
					"text": "But I manage to suppress the impulse somehow."
				},
				{
					"text": "I'm at my limit."
				},
				{
					"text": "I can't control my breathing either."
				},
				{
					"text": "My breaths feel warm and damp."
				},
				{
					"text": "To think there's a woman alive who can drink more than me!"
				},
				{
					"text": "No..."
				},
				{
					"text": "If I was sober, it wouldn't even have been a contest."
				},
				{
					"name": "Olivia",
					"text": "You are..."
				},
				{
					"name": "Olivia",
					"text": "...pretty good."
				},
				{
					"text": "Olivia's eyes are still steady."
				},
				{
					"text": "I drain the liquor poured into my glass."
				},
				{
					"text": "When I put it down back to the counter, some liquid still remains in Olivia's glass."
				},
				{
					"text": "I smile, snatch that glass, and drink the remaining liquor in it."
				},
				{
					"name": "Olivia",
					"text": "Ah..."
				},
				{
					"text": "Olivia's face is a mix of bewilderment and frustration."
				},
				{
					"name": "Olivia",
					"text": "...I get it, I lost. I'm amazed by how much you can drink, truly."
				},
				{
					"name": "Olivia",
					"text": "And you're so beautiful... Please, would you tell me your name?"
				},
				{
					"text": "I stare right into her eyes."
				},
				{
					"text": "I can't take it anymore."
				},
				{
					"text": "I burst into laughter right in front of her face."
				},
				{
					"name": "Olivia",
					"text": "Huh?"
				},
				{
					"text": "Her eyes bulge out in absolute astonishment."
				},
				{
					"text": "Rob freezes in his seat as realization dawns upon him."
				},
				{
					"name": "Will",
					"text": "I don't think I need to give my name, do I?"
				},
				{
					"name": "Rob",
					"text": "Oh, Lord..."
				},
				{
					"name": "Olivia",
					"text": "Will?"
				},
				{
					"text": "I nod cheerfully."
				},
				{
					"text": "For a moment, joy and excitement flicker across her face."
				},
				{
					"text": "...Only to be replaced by absolute rage and an inferno in her eyes."
				},
				{
					"name": "Will",
					"text": "Ah..."
				},
				{
					"text": "Olivia raises her right arm slowly."
				},
				{
					"text": "And delivers the strongest slap yet, directly to my face."
				},
				{
					"text": "It takes but a second for the pain to spread throughout my skull."
				},
				{
					"name": "Will",
					"text": "Wh-What was that for?!"
				},
				{
					"name": "Olivia",
					"text": "You impertinent little runt!"
				},
				{
					"name": "Olivia",
					"text": "You, a bloody slave! How dare you deceive me! How dare you!"
				},
				{
					"name": "Rob",
					"text": "Ahahahah!"
				},
				{
					"name": "Father",
					"text": "What? What's happening?"
				},
				{
					"name": "Rob",
					"text": "Hear this, Boss! Thought we had a real beauty here, but they turned out to be your son!"
				},
				{
					"name": "Father",
					"text": "What in the world do you mean, Rob?"
				},
				{
					"name": "Rob",
					"text": "Exactly what I said, ahahah!"
				},
				{
					"name": "Olivia",
					"text": "You impertinent runt... Impudent rascal! You're my slave!"
				},
				{
					"name": "Olivia",
					"text": "But... But...."
				},
				{
					"name": "Olivia",
					"text": "That was splendid, Will. Well done, you performed most magnificently..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Rob",
					"text": "And she's wasted."
				},
				{
					"name": "Will",
					"text": "Hahah, this is new."
				},
				{
					"name": "Will",
					"text": "I wasn't joking when I said I wouldn't have lost if I was sober last time."
				},
				{
					"text": "I lay my hand on her head where it rests on the counter."
				},
				{
					"text": "It's surprisingly petite, I notice."
				},
				{
					"name": "Rob",
					"text": "Ah, those are the clothes you asked me for, right?"
				},
				{
					"name": "Will",
					"text": "Yeah, you didn't notice?"
				},
				{
					"name": "Rob",
					"text": "I didn't even look at them. Don't have any business looking at women's clothing."
				},
				{
					"name": "Father",
					"text": "My boy, are you crossdressing?"
				},
				{
					"name": "Will",
					"text": "Yeah."
				},
				{
					"name": "Father",
					"text": "Ahahah! How I wish my eyes could see this!"
				},
				{
					"name": "Rob",
					"text": "Boss, his beauty is no laughing matter, I tell you!"
				},
				{
					"name": "Rob",
					"text": "It's like we have two Olivias in here."
				},
				{
					"text": "I feel a bitter smile creep up on my face."
				},
				{
					"text": "That would only make sense."
				},
				{
					"text": "I stole from Olivia to create this woman."
				},
				{
					"name": "Father",
					"text": "Ahahahah! This only gets better and better! Are you embarrassed, son?"
				},
				{
					"name": "Will",
					"text": "It was embarrassing at first. But our troupe has to beat Marlowe, and this is what I need to do."
				},
				{
					"name": "Will",
					"text": "I can't afford to let myself be frozen into inaction by embarrassment."
				},
				{
					"name": "Rob",
					"text": "Heh..."
				},
				{
					"name": "Will",
					"text": "And..."
				},
				{
					"text": "I turn to Olivia, who's sleeping soundly, facedown on the counter."
				},
				{
					"name": "Will",
					"text": "Olivia has done nothing but help me since the day we met. I want to live up to her expectations at least once."
				},
				{
					"name": "Father",
					"text": "I see now."
				},
				{
					"name": "Rob",
					"text": "I don't even feel like making banter about it now, boohoo. Time to pour myself a drink."
				},
				{
					"name": "Father",
					"text": "Serve one for me too, good man!"
				},
				{
					"name": "Rob",
					"text": "Not a chance in hell, Boss! You stay put!"
				},
				{
					"name": "Father",
					"text": "Curses..."
				},
				{
					"text": "I lay the drunk Olivia on my bed and go to my desk."
				},
				{
					"text": "I can hear her peaceful, even breathing."
				},
				{
					"text": "I stare at her for a moment."
				},
				{
					"text": "Peacefully asleep like this, she looks like an entirely different person."
				},
				{
					"text": "It reminds me of watching my mother sleep in that same bed when I was a child."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "The script for Hamlet lies on top of my desk."
				},
				{
					"text": "His revenge is the mouthpiece for my anger."
				},
				{
					"text": "And now, he's aiming that anger against his own mother."
				},
				{
					"text": "I feel like something's off."
				},
				{
					"text": "The ghost of his father."
				},
				{
					"text": "His uncle, who stole his mother from him."
				},
				{
					"text": "And Hamlet himself."
				},
				{
					"text": "I don't feel like the mother should be at the center of this revenge story."
				},
				{
					"text": "But that same mother decided to start sleeping with the brother of her husband immediately following his death."
				},
				{
					"text": "Surely Hamlet would see that as the weakness of women manifested in her."
				},
				{
					"text": "But..."
				},
				{
					"text": "\"Being able to recognize your weakness is the first step in forgiving weakness in others.\""
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "I remember Ed's words."
				},
				{
					"text": "I feel like I finally understand what he meant by that now."
				},
				{
					"text": "Yes, Hamlet's obsessive self-questioning lays all his weaknesses bare."
				},
				{
					"text": "And at the end..."
				},
				{
					"name": "Will",
					"text": "He... forgives her?"
				},
				{
					"text": "His dead father."
				},
				{
					"text": "Murdered by his own uncle."
				},
				{
					"text": "He wants revenge for this injustice."
				},
				{
					"text": "It's simple."
				},
				{
					"text": "And in that mad rush for vengeance, his mother ends up dead."
				},
				{
					"text": "But that wasn't what he wanted."
				},
				{
					"text": "A sliver of forgiveness dwelt inside his heart."
				},
				{
					"text": "And that... is the biggest of tragedies."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "The deadline is creeping up on me."
				},
				{
					"text": "And the person who imposed that unreasonable deadline is snoring away on my bed right now."
				},
				{
					"name": "Will",
					"text": "No rest for the wicked, I guess."
				},
				{
					"text": "I mutter to myself as I let my quill flow across the paper."
				},
				{
					"text": "Next morning."
				},
				{
					"text": "Leaving Olivia to sleep, I go downstairs to arrange the chairs in the pub before taking a nap."
				},
				{
					"text": "I wake up feeling faint aches here and there."
				},
				{
					"text": "And here I thought I had completely healed from that savage beating the watchmen gave me."
				},
				{
					"text": "A wry smile on my face, I get up, slip behind the counter, and begin doing the morning prep."
				},
				{
					"text": "After a while, I hear the steps of someone coming down the stairs."
				},
				{
					"text": "It's Olivia, the color strangely drained from her face."
				},
				{
					"name": "Will",
					"text": "Good morning. How are you feeling?"
				},
				{
					"text": "She stares at me, her breathing ragged."
				},
				{
					"text": "Her pale complexion could be due to a hangover."
				},
				{
					"text": "Maybe her blood flow isn't so good."
				},
				{
					"text": "But somehow, I feel like that's not the whole story."
				},
				{
					"name": "Olivia",
					"text": "...What time is it?"
				},
				{
					"name": "Will",
					"text": "Huh? Almost noon, I think?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Olivia frowns, and her expression hardens."
				},
				{
					"name": "Will",
					"text": "Are you still mad at me? I know it was sneaky of me to deceive you, but I—"
				},
				{
					"name": "Olivia",
					"text": "I'm leaving. I can't help you with prep today, sorry."
				},
				{
					"name": "Will",
					"text": "Huh?"
				},
				{
					"text": "Olivia walks to the door at a swift pace and throws it open."
				},
				{
					"name": "Will",
					"text": "Hey! What about rehearsal?!"
				},
				{
					"text": "By the time the words leave my mouth, she's already gone."
				},
				{
					"name": "Will",
					"text": "What's her problem?"
				},
				{
					"name": "Olivia",
					"text": "Hah, hah..."
				},
				{
					"text": "I was careless."
				},
				{
					"text": "I relaxed my guard completely."
				},
				{
					"text": "I always have to be back before Spencer finishes having his fun for the night."
				},
				{
					"text": "And just when I finally saw a flicker of hope for the troupe."
				},
				{
					"text": "How could I have endured so scrupulously up until today..."
				},
				{
					"text": "Only to slip and fall now?"
				},
				{
					"text": "My head is throbbing."
				},
				{
					"text": "The drinks from yesterday pool heavily in my stomach."
				},
				{
					"text": "I can smell them on my breath."
				},
				{
					"text": "But there's no time for me to wait to sober up completely."
				},
				{
					"text": "Maybe Spencer decided to play around until noon today."
				},
				{
					"text": "I can but hope that's the case."
				},
				{
					"text": "I run down the streets to the manor while pulling up my messy hair and tying it into a ponytail."
				},
				{
					"name": "Olivia",
					"text": "Hah, hah..."
				},
				{
					"text": "Stepping into the entryway, I take a minute to get my breath back."
				},
				{
					"text": "A butler comes over with a cloth, and I use it to wipe my sweat."
				},
				{
					"name": "Olivia",
					"text": "Is Lord Spencer in his room?"
				},
				{
					"text": "The butler nods."
				},
				{
					"text": "I bite my lower lip in frustration."
				},
				{
					"text": "I didn't make it in time."
				},
				{
					"name": "Olivia",
					"text": "Okay, thank you."
				},
				{
					"text": "I take a deep breath and head to his room."
				},
				{
					"name": "Spencer",
					"text": "Hmm? Who goes there?"
				},
				{
					"name": "Olivia",
					"text": "Olivia. May I enter?"
				},
				{
					"name": "Spencer",
					"text": "Ah, Olive. Esta bien, come in."
				},
				{
					"text": "Upon entering, I see Spencer lying on the bed with a woman and a man snuggling up against him on each side."
				},
				{
					"text": "They're all undressed."
				},
				{
					"text": "The scent gives it away."
				},
				{
					"text": "He bought these two last night, and has been indulging in them the whole night long."
				},
				{
					"name": "Olivia",
					"text": "I am terribly sorry. I failed to perform my duties this morning."
				},
				{
					"name": "Spencer",
					"text": "Yes, you certainly did."
				},
				{
					"name": "Spencer",
					"text": "It's fine. This chico and chica kept me company in your stead."
				},
				{
					"name": "Spencer",
					"text": "It was quite pleasurable indeed. Especially this chico's little amigo..."
				},
				{
					"text": "Spencer reaches out to the handsome man on his left, pure ecstasy lacing his smile."
				},
				{
					"name": "Olivia",
					"text": "I'm glad to see you're enjoying yourself, my Lord."
				},
				{
					"name": "Spencer",
					"text": "Olive, I hear you're outside the manor a lot these days."
				},
				{
					"name": "Olivia",
					"text": "...Yes. I am focused on being selected for the court's performance, so all my time is going into theatrical training."
				},
				{
					"name": "Spencer",
					"text": "Your breath stinks."
				},
				{
					"name": "Olivia",
					"text": "I am terribly sorry. I drank a little too much with the other troupe members."
				},
				{
					"name": "Spencer",
					"text": "Drinking is fine, the problema arises when you stand before me completely drunk. Too much is too much, little Olive."
				},
				{
					"name": "Olivia",
					"text": "I will be more careful from now on."
				},
				{
					"name": "Spencer",
					"text": "I will forgive you, since I myself let my sentidos become drunk on these two. But there will be no mercy next time, are we in agreement?"
				},
				{
					"name": "Olivia",
					"text": "I understand very well."
				},
				{
					"name": "Spencer",
					"text": "Okay, then this conversation is over. Aah, but one more thing. I have decided on an abode in the Nuevo Mundo."
				},
				{
					"name": "Spencer",
					"text": "I will journey there this coming autumn. I will need to make new connections in social gatherings, thus I will need an esposa. You know where I'm going with this?"
				},
				{
					"name": "Olivia",
					"text": "...Yes."
				},
				{
					"name": "Spencer",
					"text": "Do make up your mind while there's tiempo. It will be meaningless if I don't own you while there is still beauty in you. Let one wrinkle appear on that linda face of yours, and I will dispose of you like the refuse you are, understood?"
				},
				{
					"text": "I bow silently."
				},
				{
					"text": "Then I proceed to leave the room swiftly."
				},
				{
					"text": "I can hear Spencer's lascivious moans from the other side of the door."
				},
				{
					"text": "He must still be trying to satiate that inexhaustible desire of his with those two."
				},
				{
					"text": "A sigh leaves my lips."
				},
				{
					"text": "My head is still above my shoulders, at least for now."
				},
				{
					"text": "But nothing has been solved, not really."
				},
				{
					"text": "There is only one way out for me."
				},
				{
					"text": "To be selected for the court performance, show our ability, and be put under the patronage of the Royal Household."
				},
				{
					"text": "If I am to continue acting..."
				},
				{
					"text": "I will have to speak into the ear of the Queen and influence the Royal Household, so that the laws themselves can be changed."
				},
				{
					"text": "I have no other choice."
				},
				{
					"text": "Now that we're being ruled by a Queen who is sympathetic towards theater, this is my chance."
				},
				{
					"text": "After finishing getting ready, I head to the theater."
				},
				{
					"text": "Olivia is there before me, and rehearsal starts as per usual, but..."
				},
				{
					"name": "Olivia",
					"text": "Stop! Will, you're good. You've improved a great deal. Thomas, Kiki, your performances are abhorrent!"
				},
				{
					"name": "Olivia",
					"text": "I struggle to find anything more crude and vulgar than seeing you flapping about on stage!"
				},
				{
					"name": "Olivia",
					"text": "Kiki, Helena has never wanted for food. She may not be popular with men, but it's not like she was raised in a barn."
				},
				{
					"name": "Kiki",
					"text": "Yes, ma'am..."
				},
				{
					"name": "Olivia",
					"text": "She's not a petty thief like you, so try to act the part!"
				},
				{
					"name": "Kiki",
					"text": "Yes, ma'am..."
				},
				{
					"name": "Olivia",
					"text": "You too, Thomas. Puck the fairy may be shrewd, but he's not evil."
				},
				{
					"name": "Olivia",
					"text": "Have you seen yourself in a mirror? You look like wickedness itself put on clothes and started walking around."
				},
				{
					"name": "Thomas",
					"text": "Yes, ma'am..."
				},
				{
					"name": "Olivia",
					"text": "You need to change your very way of life. Acting is not a bloody game! It's too late for you to pretend you're something else, so change your life instead."
				},
				{
					"name": "Kiki&Thomas",
					"text": "Yes, ma'am..."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "Her orders are more nonsensical and erratic than before."
				},
				{
					"text": "Her face is still pale, and her breath still stinks of alcohol if you're close enough."
				},
				{
					"text": "Sometimes she puts a hand to her head, no doubt nursing a headache."
				},
				{
					"text": "It feels like she's lashing out with her anger at the rest of the troupe members."
				},
				{
					"name": "Olivia",
					"text": "Will."
				},
				{
					"name": "Will",
					"text": "Yes?"
				},
				{
					"name": "Olivia",
					"text": "Your movements are good, they catch the eye. They fit with the overall flow of the scenes and don't disrupt them, though I would expect that from the play's author."
				},
				{
					"name": "Olivia",
					"text": "Practice your lines a little more. Keep imitating me if that's what you're going for."
				},
				{
					"name": "Olivia",
					"text": "It'd be good if you could make your voice a little higher, but try not to overdo it."
				},
				{
					"name": "Olivia",
					"text": "It'll get easier with practice."
				},
				{
					"name": "Will",
					"text": "All right."
				},
				{
					"text": "Surprisingly, her advice to me is far more constructive."
				},
				{
					"text": "It looks like she's capable of giving meaningful advice to those who surpass her standards."
				},
				{
					"text": "The problem, as I see it, is that those standards are too high."
				},
				{
					"name": "Olivia",
					"text": "We'll take a five minute break. When we're done, let's start this scene again from the top."
				},
				{
					"text": "No one says anything."
				},
				{
					"name": "Olivia",
					"text": "Understood?!"
				},
				{
					"name": "Kiki&Thomas",
					"text": "Yes, ma'am."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "I chase after Olivia as she walks backstage."
				},
				{
					"name": "Will",
					"text": "Olivia."
				},
				{
					"name": "Olivia",
					"text": "What?"
				},
				{
					"text": "Her rose irises shine from her narrowed eyes."
				},
				{
					"text": "Managing not to falter in the face of her piercing gaze, I voice my request."
				},
				{
					"name": "Will",
					"text": "Can I sit and watch the rehearsal today?"
				},
				{
					"name": "Olivia",
					"text": "You're not gonna participate?"
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Olivia",
					"text": "Why not? I know you've improved a fair bit, but you already took plenty time off when you got hurt."
				},
				{
					"name": "Olivia",
					"text": "You're already healed from that, aren't you? Are you hungover?"
				},
				{
					"name": "Will",
					"text": "No, I just want to see the troupe as a whole perform."
				},
				{
					"name": "Will",
					"text": "I want to see them as fully and objectively as possible from a distance. It's impossible to see everything properly while on the stage."
				},
				{
					"name": "Olivia",
					"text": "What for?"
				},
				{
					"name": "Will",
					"text": "We barely have any time until the premiere. What's gonna happen if things keep going as they are right now? I'm sure you're aware nothing good's gonna come of this."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Olivia sighs while holding her head."
				},
				{
					"text": "Looks like hangovers hit her hard."
				},
				{
					"text": "I know that pain well myself."
				},
				{
					"name": "Olivia",
					"text": "Just for today, then. Otherwise the rest of the troupe might try to pull the same move as an excuse to skip out on rehearsals."
				},
				{
					"name": "Will",
					"text": "That will be enough. Thanks."
				},
				{
					"name": "Olivia",
					"text": "Just try to actually come up with something useful from it, understood?"
				},
				{
					"text": "After the break, I move back from the group to a distance where I can watch them perform as a whole."
				},
				{
					"text": "As always, Olivia's watching in front of the stage, instructing everyone about their movements."
				},
				{
					"text": "If there's anything that deviates from her instructions, she stops the practice on the spot."
				},
				{
					"text": "The member that made the mistake is thoroughly scolded, while the others simply stare into the distance with vacant eyes."
				},
				{
					"text": "When she gets mad at Thomas, his eyes meet Kiki's and he makes a flippant gesture with his hand."
				},
				{
					"text": "For a moment, I shudder."
				},
				{
					"text": "But Olivia seems oblivious as she keeps shouting in his face."
				},
				{
					"name": "Will",
					"text": "I see."
				},
				{
					"text": "She finishes grilling Thomas after a while."
				},
				{
					"text": "He seems to have internalized the movements Olivia instructed, in his own way."
				},
				{
					"text": "After a long pause, they resume the rehearsal."
				},
				{
					"text": "Not from the beginning, but from the point where she stopped them."
				},
				{
					"text": "They can't possibly memorize the flow of the scene after an interruption like that."
				},
				{
					"text": "I try connecting the first half with the second in my head."
				},
				{
					"text": "It's all messed up even for me, so I imagine it must be worse for them."
				},
				{
					"name": "Olivia",
					"text": "Stop! Kiki! You're all over the place! Come here!"
				},
				{
					"name": "Kiki",
					"text": "Yes, ma'am."
				},
				{
					"name": "Thomas",
					"text": "Heheh, serves you right."
				},
				{
					"name": "Will",
					"text": "Goodness."
				},
				{
					"text": "The rehearsal is over, and the rest of the troupe leaves with sagged shoulders and tired expressions."
				},
				{
					"text": "Rather than relief at it being over, they all seem to be weighed down by the fact that they'll have to endure the same thing all over again tomorrow."
				},
				{
					"text": "...The play's supposed to be a comedy, mind you."
				},
				{
					"name": "Olivia",
					"text": "So, how did it look from afar? Learn anything?"
				},
				{
					"name": "Will",
					"text": "Yeah. Many things, in fact."
				},
				{
					"name": "Olivia",
					"text": "You don't say."
				},
				{
					"name": "Will",
					"text": "Let's talk at the pub. We still have time before we open up."
				},
				{
					"name": "Will",
					"text": "The first thing I learned is that if things continue this way, we don't have a hope of beating Marlowe come premiere day."
				},
				{
					"name": "Will",
					"text": "It's not about each actor as an individual; we're not organized as a group."
				},
				{
					"name": "Olivia",
					"text": "So?"
				},
				{
					"text": "Olivia's staring into my eyes."
				},
				{
					"name": "Will",
					"text": "Right now, most of the rehearsal time is eaten away by you scolding anyone that makes a mistake."
				},
				{
					"name": "Will",
					"text": "Not that your guidance isn't helping them."
				},
				{
					"name": "Will",
					"text": "There is always visible change in the members that you scold. That's quite remarkable."
				},
				{
					"name": "Olivia",
					"text": "I do have experience dealing with rebellious slaves. How ironic."
				},
				{
					"name": "Will",
					"text": "Yeah, ironic indeed."
				},
				{
					"name": "Will",
					"text": "Currently, the person who needs to change their attitude the most is..."
				},
				{
					"name": "Will",
					"text": "...you, Olivia."
				},
				{
					"text": "Her rose eyes flare with anger and indignation."
				},
				{
					"name": "Will",
					"text": "Ironic, isn't it?"
				},
				{
					"name": "Olivia",
					"text": "For your own well being, I hope this is not just some joke at my expense."
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Olivia",
					"text": "Explain yourself."
				},
				{
					"name": "Will",
					"text": "Let me go through some points. First of all, the way you're going about things right now is woefully inefficient."
				},
				{
					"name": "Will",
					"text": "Do you remember how many full scenes we rehearsed today?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "And it's not just today. It's been this way ever since the scripts were handed out. The only time we've been able to make it to the last line..."
				},
				{
					"name": "Will",
					"text": "...was during the first group reading."
				},
				{
					"name": "Olivia",
					"text": "But there are mistakes that can't be overlooked! I have no choice but to stop them!"
				},
				{
					"name": "Will",
					"text": "Let's exchange putting on a play for making clothes, and think of it from that perspective."
				},
				{
					"name": "Will",
					"text": "Right now, you're fussing over the placement of every single button on your blouse."
				},
				{
					"name": "Olivia",
					"text": "God is in the details. Isn't that a saying you bards like to invoke?"
				},
				{
					"name": "Will",
					"text": "But we haven't even started to work on the trousers! No matter how perfectly placed the buttons on your blouse are, everyone will laugh if you go out in your knickers!"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "In fact, the more beautiful the buttons are, the more ridiculous the whole situation appears."
				},
				{
					"name": "Olivia",
					"text": "I've had it with your damn analogies! Move on!"
				},
				{
					"name": "Will",
					"text": "No matter how ill-fitting or dirty the clothes we wear are, we must first be fully clothed before we can even step onto the stage."
				},
				{
					"name": "Olivia",
					"text": "I get what you're saying. Now tell me your solution."
				},
				{
					"name": "Will",
					"text": "We need time to run through the whole rehearsal without any interruptions. At the beginning of the day and at the end."
				},
				{
					"name": "Will",
					"text": "With this play, I think we can manage it. For scripts with longer acts, they can be separated by curtain calls."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "During the intermissions between acts, you can come in. You can grill them relentlessly for their mistakes as much as you want, just like always."
				},
				{
					"name": "Olivia",
					"text": "As things stand, I'll have to memorize so many things to point out that my head will explode."
				},
				{
					"name": "Olivia",
					"text": "You truly are an armchair critic, huh? Your ideas must sound so easy and obvious in your head."
				},
				{
					"name": "Will",
					"text": "Let's agree on a simple sign you can make for me to look out for. I'll remember for you."
				},
				{
					"name": "Olivia",
					"text": "I will have at least a hundred corrections to remember."
				},
				{
					"name": "Will",
					"text": "I'll memorize them all. I promise."
				},
				{
					"name": "Olivia",
					"text": "Can you truly do such a thing?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Will",
					"text": "I'm confident. Let's at least give it a try."
				},
				{
					"name": "Olivia",
					"text": "Suit yourself."
				},
				{
					"name": "Will",
					"text": "And..."
				},
				{
					"name": "Olivia",
					"text": "You still have more to say?!"
				},
				{
					"name": "Will",
					"text": "You're stunting the troupe members with your criticism. It's fine if you have to force yourself to do it, but please look for something good in each person's performance and praise them for it."
				},
				{
					"name": "Olivia",
					"text": "What?! Why must I be mindful of the egos of you bunch of rabble?!"
				},
				{
					"name": "Will",
					"text": "Because you're the leader of this troupe."
				},
				{
					"name": "Olivia",
					"text": "Then why don't they try obeying orders and acting as I instruct them to?!"
				},
				{
					"name": "Will",
					"text": "You're talking about what a slave would do."
				},
				{
					"name": "Olivia",
					"text": "Same thing! Why, you're all my bloody slaves!"
				},
				{
					"name": "Will",
					"text": "Even if that's true, I think you should forget that during rehearsals."
				},
				{
					"name": "Olivia",
					"text": "Why would I do such a thing?! Slaves get no rest!"
				},
				{
					"name": "Will",
					"text": "Does the audience come to see a troupe of slaves? I don't think so, do you?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "If there is no trust between the leader of the troupe and the actors, it'll all be for naught. Do you want the troupe to be chosen for the court performance or not?"
				},
				{
					"name": "Will",
					"text": "Do you want to whip slaves, or do you want to train actors? Think twice before answering that."
				},
				{
					"name": "Olivia",
					"text": "I've had enough of sitting here and hearing you prattle on and on."
				},
				{
					"name": "Will",
					"text": "I think you've interjected quite a lot, actually."
				},
				{
					"name": "Olivia",
					"text": "Silence!"
				},
				{
					"name": "Olivia",
					"text": "Trust, you say? Don't make me laugh! Do you think I don't know what all of them whisper behind my back?!"
				},
				{
					"name": "Olivia",
					"text": "If they want bloody trust, then how about they show themselves deserving of it first?! Do not demand what you don't give!"
				},
				{
					"name": "Will",
					"text": "Olivia."
				},
				{
					"name": "Olivia",
					"text": "What?!"
				},
				{
					"name": "Will",
					"text": "I could say those exact same words to you."
				},
				{
					"name": "Olivia",
					"text": "Ngh!"
				},
				{
					"name": "Will",
					"text": "Let's just give it a try tomorrow, please."
				},
				{
					"name": "Will",
					"text": "You want to do this for the last showing of the Jew of Malta, right? We have no time to lose."
				},
				{
					"name": "Olivia",
					"text": "I won't stand for this!"
				},
				{
					"name": "Will",
					"text": "Stand for what?"
				},
				{
					"name": "Olivia",
					"text": "You spouting rhetoric with that smug look on your face! I won't stand for you making me look like the irrational one here!"
				},
				{
					"name": "Olivia",
					"text": "Besides, how many times have you called me by name today?! Did you forget your due respect?! It's Lady Olivia to you!"
				},
				{
					"name": "Will",
					"text": "I forgot."
				},
				{
					"name": "Olivia",
					"text": "This is my bloody troupe! I will decide how we rehearse, and no one else! Don't get ahead of yourself."
				},
				{
					"name": "Will",
					"text": "Okay, what do you want to do?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Olivia's breathing is ragged, and her lips quiver from all the shouting."
				},
				{
					"name": "Olivia",
					"text": "Let's try the method you suggested."
				},
				{
					"text": "Olivia murmurs, each word physically paining her."
				},
				{
					"text": "After we close up the pub, I go upstairs to keep working on Hamlet's script."
				},
				{
					"text": "I can see the end already in sight."
				},
				{
					"text": "Hamlet's revenge tragedy begins from a dialogue with the ghost of his father."
				},
				{
					"text": "He plays the part of a madman while he plots his revenge."
				},
				{
					"text": "But the feigned madness gets a hold of him and consumes him. The line between sanity and madness blurs."
				},
				{
					"text": "He keeps questioning his sanity, but no answer is awarded to him."
				},
				{
					"text": "In the end, he loses both his mother and the woman he loved."
				},
				{
					"text": "And he himself is dragged to the eternal sleep."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "Hamlet is me."
				},
				{
					"text": "The parts of myself that want revenge."
				},
				{
					"text": "But..."
				},
				{
					"name": "Will",
					"text": "Your death shan't be in vain."
				},
				{
					"text": "This tragedy is indeed worth telling."
				},
				{
					"text": "Someone has to tell this story."
				},
				{
					"text": "For all those souls across the country that burn with the fire of hatred and the need for revenge, just like me."
				},
				{
					"text": "At death's door..."
				},
				{
					"text": "Hamlet entrusts it all to a friend."
				},
				{
					"text": "So that no one else repeats his selfsame mistakes."
				},
				{
					"text": "If you let yourself be consumed by revenge, you will lose sight of what matters most."
				},
				{
					"text": "That's why the closing line will be..."
				},
				{
					"text": "Thou livest; report me and my cause aright. In this harsh world draw thy breath in pain, to tell my story. Of carnal, bloody, and unnatural acts, of deaths put on by cunning and forced cause."
				},
				{
					"text": "I cannot live to hear the News from England. On you, he has my dying voice."
				},
				{
					"text": "The rest, is silence..."
				},
				{
					"name": "Olivia",
					"text": "Starting today, we'll be changing up how we do these rehearsals."
				},
				{
					"text": "At the start of the next day's rehearsal, Olivia addresses the troupe."
				},
				{
					"name": "Kiki",
					"text": "Huh?"
				},
				{
					"name": "Thomas",
					"text": "Why?"
				},
				{
					"name": "Olivia",
					"text": "Will, you explain."
				},
				{
					"name": "Will",
					"text": "Err, why me?"
				},
				{
					"name": "Olivia",
					"text": "This is your bright idea, is it not? Explain it yourself."
				},
				{
					"text": "Olivia says as she takes a step back."
				},
				{
					"text": "Everyone's eyes are on me."
				},
				{
					"name": "Will",
					"text": "So..."
				},
				{
					"name": "Kiki",
					"text": "So when we run through the play at the beginning and end of the day, the leader won't stop us in the middle of a scene, even if we make a mistake?"
				},
				{
					"name": "Thomas",
					"text": "Even if we fumble our lines? Even if we move wrong?"
				},
				{
					"name": "Will",
					"text": "Exactly. I just want you to focus on performing the full scenes until the end."
				},
				{
					"name": "Kiki",
					"text": "Are you serious?!"
				},
				{
					"name": "Thomas",
					"text": "We won't get yelled at even if we mess up?!"
				},
				{
					"name": "Will",
					"text": "Just remember that when the scene is over, she'll go over all the mistakes and correct you."
				},
				{
					"name": "Thomas",
					"text": "Almost had me there for a second. Go over mistakes? We're gonna get yelled at again."
				},
				{
					"name": "Kiki",
					"text": "We're still gonna get grilled at the end."
				},
				{
					"name": "Olivia",
					"text": "Of course. What's the point of rehearsal if you don't get told what to improve upon?"
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "Understood?"
				},
				{
					"name": "Kiki",
					"text": "Yes, ma'am."
				},
				{
					"name": "Olivia",
					"text": "You too."
				},
				{
					"name": "Thomas",
					"text": "Yes, ma'am."
				},
				{
					"name": "Will",
					"text": "Well, it's better than feeling like you're walking on eggshells the whole time. I want to see how the play comes together as a whole."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "...Lady Olivia wants to see how it comes together, I mean."
				},
				{
					"name": "Kiki",
					"text": "Oh well, we're just here to do as we're told."
				},
				{
					"name": "Kiki",
					"text": "If that's what you want, we'll do it."
				},
				{
					"name": "Thomas",
					"text": "Yeah, let's get it out of the way."
				},
				{
					"name": "Olivia",
					"text": "Okay, if everyone's on the same page, let's begin."
				},
				{
					"name": "Will",
					"text": "Yeah."
				},
				{
					"text": "Now, this approach is supposed to help us visualize exactly what we're working with..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Hermia",
					"text": "...Hey, Lysander."
				},
				{
					"name": "Lysander",
					"text": "Huh?"
				},
				{
					"name": "Hermia",
					"text": "Say your line."
				},
				{
					"name": "Lysander",
					"text": "There, gentle Hermia, my love for thee is eternal! May I marry thee?"
				},
				{
					"name": "Hermia",
					"text": "My good Lysander! I swear to thee, by Cupid's strongest bow. To-morrow truly will I meet with thine, and our eternal will become!"
				},
				{
					"name": "Puck",
					"text": "Phew, that's one pair down."
				},
				{
					"name": "Helena",
					"text": "Ah, Demetrius. Finally, my love for thee has made thee see the light!"
				},
				{
					"name": "Lysander",
					"text": "Good morrow, friends. Saint Valentine is past. Perhaps we were blessed with everlasting love by the summer's court over this midsummer night."
				},
				{
					"name": "Helena",
					"text": "Oh, Demetrius. Ne'er leave my side once more!"
				},
				{
					"name": "Lysander",
					"text": "Let us go, Hermia. Before the morrow our vows will be sealed!"
				},
				{
					"name": "Hermia",
					"text": "Y-Yes, my love!"
				},
				{
					"name": "Puck",
					"text": "Why, then, finally all are awake! No more yielding but a dream, a gift, they say! Truly, all they did was have a silly midsummer night's dream! Courtesy of yours truly!"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "...So, this is the end, right?"
				},
				{
					"name": "Kiki",
					"text": "Maybe?"
				},
				{
					"name": "Olivia",
					"text": "A break... We need a break. Will, you remember everything, right?"
				},
				{
					"name": "Will",
					"text": "Y-Yeah."
				},
				{
					"text": "Last night we agreed on a signal for her to make."
				},
				{
					"text": "She used it liberally during the performance."
				},
				{
					"name": "Olivia",
					"text": "Prepare yourselves. I will thoroughly whip you into shape even if it takes me until morning. Understood?"
				},
				{
					"name": "Kiki",
					"text": "Oh no..."
				},
				{
					"name": "Thomas",
					"text": "Are we gonna be okay?"
				},
				{
					"name": "Will",
					"text": "I'd say this is a big step for her. Not jumping on every single mistake she sees and all."
				},
				{
					"name": "Kiki",
					"text": "You think so? She was shivering with barely repressed anger just now, I think."
				},
				{
					"name": "Thomas",
					"text": "Her face looked like a tomato and all."
				},
				{
					"name": "Will",
					"text": "Well, at least we got through the whole thing to the end. Baby steps."
				},
				{
					"name": "Olivia",
					"text": "Never have I seen such a vulgar fairy before! Fix it right now!"
				},
				{
					"name": "Thomas",
					"text": "Yes, ma'am."
				},
				{
					"name": "Olivia",
					"text": "Kiki! Could your delivery get more deadpan?! Would it kill you to try to put some feeling into your lines?!"
				},
				{
					"name": "Olivia",
					"text": "And you're too short!"
				},
				{
					"name": "Kiki",
					"text": "Err, not much I can do about that. I drink my milk every day, but it doesn't make much difference."
				},
				{
					"name": "Olivia",
					"text": "Don't talk back!"
				},
				{
					"name": "Kiki",
					"text": "Yes, ma'am."
				},
				{
					"name": "Will",
					"text": "This is a mess..."
				},
				{
					"name": "Olivia",
					"text": "Your eyes are red, Will! You need to sleep! And I can still hear a boyish tone in your lines!"
				},
				{
					"name": "Will",
					"text": "I can't sleep because you told me to—"
				},
				{
					"name": "Olivia",
					"text": "Shut up! Everything's wrong! Absolutely everything!"
				},
				{
					"name": "Will",
					"text": "Ah, can I say something too?"
				},
				{
					"name": "Olivia",
					"text": "What?!"
				},
				{
					"text": "All the troupe members turn their anxious gazes on me."
				},
				{
					"name": "Will",
					"text": "Generally speaking, it's bad. Pretty damn bad. I can admit that."
				},
				{
					"name": "Will",
					"text": "But I've realized some things."
				},
				{
					"name": "Will",
					"text": "Perhaps the way you point out mistakes isn't the most constructive. Maybe you could stand to improve your approach."
				},
				{
					"name": "Kiki",
					"text": "Huh?"
				},
				{
					"name": "Thomas",
					"text": "Why would you pour oil onto the pyre?"
				},
				{
					"name": "Olivia",
					"text": "Oh, do enlighten me. But do know that I'll have you torn apart limb from limb if I don't like what you have to say."
				},
				{
					"name": "Will",
					"text": "In my scene, when Hermia and Lysander elope and spend the night in the forest."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "Remember what you told me about Hermia?"
				},
				{
					"name": "Olivia",
					"text": "Do you understand? Hermia has stood against her father for the first time. This naive, noble maiden has left her house to spend the night in the woods to be together with her beloved!"
				},
				{
					"name": "Olivia",
					"text": "She spends the night fretting over whether he'll hold her in his arms and return her love! She has never felt this strongly in her whole life! And, at dawn, this man tells her that he loves another woman!"
				},
				{
					"name": "Will",
					"text": "This is the first night she's spent outside her parents' home. You said she was a maiden assaulted by a mixture of expectation and anxiety over whether the man she loves will take her or not."
				},
				{
					"name": "Will",
					"text": "Do you remember?"
				},
				{
					"name": "Olivia",
					"text": "I do. Your point?"
				},
				{
					"name": "Will",
					"text": "If you look at this scene on its own, that's how it appears. And that certainly adds to its feel as a human drama."
				},
				{
					"name": "Will",
					"text": "But this is a comedy, is it not? If we try to emphasize that angle, won't Hermia look a little too pitiful to the audience?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "In other words, if we want to take into account how this scene contributes to the general flow of the play overall..."
				},
				{
					"name": "Will",
					"text": "Maybe it'd be better if we didn't focus the performance on her conflicted feelings, right?"
				},
				{
					"name": "Will",
					"text": "It may come across as too straightforward, but I think that Hermia being more confident and cocky in this scene will add to the hilarity of it later on."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"text": "Kiki and Thomas alternate between looking at me and at Olivia."
				},
				{
					"name": "Will",
					"text": "So maybe Hermia should be more confident. Make it clear that she thinks that she has her beloved Lysander in the palm of her hand."
				},
				{
					"name": "Will",
					"text": "And then, when the next day comes and she's confronted with Lysander's change of heart, Hermia loses her composure and goes into a fit of rage."
				},
				{
					"name": "Will",
					"text": "Wouldn't that be funnier and elicit the reaction we want out of the audience?"
				},
				{
					"name": "Thomas",
					"text": "Lose her composure? So... like our leader here today?"
				},
				{
					"name": "Kiki",
					"text": "Pfft!"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "Until now, we've been practicing each scene separately, so this is happening all over."
				},
				{
					"name": "Will",
					"text": "I think you and I, as troupe leader and playwright, need to discuss more about the characterization and how the performances will reflect it."
				},
				{
					"name": "Will",
					"text": "What do you think?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Thomas",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "We're..."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Thomas",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "...done for today."
				},
				{
					"text": "Kiki and Thomas' eyes bulge out in sheer surprise."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "We go back to the pub, exchanging nary a word on the way."
				},
				{
					"name": "Will",
					"text": "Are you okay?"
				},
				{
					"name": "Olivia",
					"text": "What do you mean?"
				},
				{
					"name": "Will",
					"text": "it's just that, well..."
				},
				{
					"name": "Olivia",
					"text": "I can't stand it."
				},
				{
					"name": "Will",
					"text": "Huh?"
				},
				{
					"name": "Olivia",
					"text": "It's like I'm talking to a different person. It's beyond vexing!"
				},
				{
					"name": "Will",
					"text": "Eh?"
				},
				{
					"name": "Olivia",
					"text": "If you had such good insights, how about coming out with them from the start instead of losing us time, you simpleton?!"
				},
				{
					"name": "Will",
					"text": "O-Oh, sorry?"
				},
				{
					"name": "Olivia",
					"text": "So, what now?!"
				},
				{
					"name": "Will",
					"text": "Huh?"
				},
				{
					"name": "Olivia",
					"text": "How do I direct them?! Tell me already! That's what you've been thinking about, right?!"
				},
				{
					"text": "We talk until it's time for the pub to open, and again when it's time to close."
				},
				{
					"text": "During those two intervals, I tell her my plan for the play's production."
				},
				{
					"name": "Olivia",
					"text": "I see. So this is how you envisioned the story inside your head."
				},
				{
					"name": "Olivia",
					"text": "I'm sorry, there were parts I honestly didn't grasp on my own. But yes, this is a much better way to go about it."
				},
				{
					"name": "Olivia",
					"text": "By simplifying the emotions of each character, the overall feeling of the play will become more intricate as a whole."
				},
				{
					"name": "Will",
					"text": "Making them laugh in the theater is our first priority. The ironic themes of the story..."
				},
				{
					"name": "Will",
					"text": "They'll come to them later in the night, when they're gathered at a pub just like this, discussing it over food and ale."
				},
				{
					"name": "Will",
					"text": "When you took me to the square to watch the plays of the shopping district..."
				},
				{
					"name": "Will",
					"text": "I realized I should imagine and take into account the kind of life the viewers lead and design a theater-going experience that speaks to them."
				},
				{
					"text": "Olivia stares at me, disbelief written all over her face, simply nodding in response."
				},
				{
					"name": "Olivia",
					"text": "I see..."
				},
				{
					"name": "Will",
					"text": "And..."
				},
				{
					"name": "Will",
					"text": "At this point, my script only consists of dialogue."
				},
				{
					"text": "Olivia nods."
				},
				{
					"name": "Will",
					"text": "Maybe I should start writing stage directions too. It'll make things easier for the actors."
				},
				{
					"name": "Will",
					"text": "It'll be clearer for everyone if I add instructions about movements and delivery in between the lines."
				},
				{
					"name": "Olivia",
					"text": "No, I think it's fine as it is."
				},
				{
					"name": "Olivia",
					"text": "By reading just the line first, I can create an unbiased image of how it should be in my mind."
				},
				{
					"name": "Olivia",
					"text": "Then we can amalgamate both our ideas to create something even better."
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Olivia",
					"text": "That way, even if our scripts happen to be stolen, no one will be able to produce the play quite like we will."
				},
				{
					"name": "Olivia",
					"text": "It can be a kind of assurance for us."
				},
				{
					"name": "Olivia",
					"text": "Our very own playwright is participating as an actor, so there's no need to bother writing it down."
				},
				{
					"name": "Olivia",
					"text": "We can keep the information to ourselves."
				},
				{
					"name": "Will",
					"text": "That's a good idea."
				},
				{
					"name": "Olivia",
					"text": "Now that we know about the discrepancies between our own personal visions for the play, from here on out we should make sure to discuss the direction from the very beginning."
				},
				{
					"text": "I nod again."
				},
				{
					"name": "Will",
					"text": "But everything I came up with is still just in my head, like you said."
				},
				{
					"name": "Olivia",
					"text": "I did? Me? Really?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Will",
					"text": "I haven't considered the individuality of each member of the troupe at all."
				},
				{
					"name": "Will",
					"text": "I don't know what kind of people they are. That's why I want to leave that judgement to you, leader."
				},
				{
					"name": "Olivia",
					"text": "I know them as much as you, which is to say, not much at all."
				},
				{
					"text": "I blink at her."
				},
				{
					"text": "She maintains a blank expression."
				},
				{
					"name": "Olivia",
					"text": "I don't even know where they live."
				},
				{
					"name": "Will",
					"text": "Why not?"
				},
				{
					"name": "Olivia",
					"text": "Why would I need to? I don't concern myself with the lives of my slaves. Isn't that natural?"
				},
				{
					"name": "Will",
					"text": "Wait a minute, then why have you wormed your way into my life to the point that you spend almost the entire day with me?"
				},
				{
					"name": "Olivia",
					"text": "You are irreplaceable. I can hardly keep you out of my sight, can I now?"
				},
				{
					"name": "Olivia",
					"text": "All the other members, I could replace anytime."
				},
				{
					"name": "Will",
					"text": "Err, I'm sure they can tell you feel that way."
				},
				{
					"name": "Olivia",
					"text": "Perhaps. I make no effort to hide my disdain."
				},
				{
					"name": "Will",
					"text": "Do you think that attitude will make them feel motivated to act? I'm asking you as the leader of this whole thing."
				},
				{
					"name": "Olivia",
					"text": "I mean, they're slaves. What? Are you gonna complain about that too?"
				},
				{
					"name": "Will",
					"text": "Didn't I already tell you that's the wrong way to deal with them? Have you ever gone for a drink with Kiki or Thomas or any of them?"
				},
				{
					"text": "Her eyes widen in surprise and her expression contorts in indignation."
				},
				{
					"name": "Olivia",
					"text": "Why would I ever spend time with that rabble?! Of course I've never done such a thing!"
				},
				{
					"name": "Will",
					"text": "Olivia."
				},
				{
					"name": "Olivia",
					"text": "What?!"
				},
				{
					"name": "Will",
					"text": "Summon them all here tomorrow, and treat them to drinks with your own money."
				},
				{
					"name": "Olivia",
					"text": "Why would I ever?!"
				},
				{
					"name": "Will",
					"text": "Because it'll benefit the troupe. Even if it doesn't, it can't get any worse than it already is."
				},
				{
					"name": "Will",
					"text": "We have no time, and you need to get to know your whole troupe. At the very least make an effort toward it."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "Understood?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "Lady Olivia?"
				},
				{
					"name": "Olivia",
					"text": "Damn it all! Fine!"
				},
				{
					"name": "Father",
					"text": "Heheh..."
				},
				{
					"text": "Sitting at his usual corner of the bar, my father simply listens to us with a pleasant smile on his face."
				}
			]
		},
		{},
		{
			"texts": [
				{
					"text": "Today, after rehearsal."
				},
				{
					"text": "Olivia's fidgeting while keeping her distance from Kiki and Thomas."
				},
				{
					"name": "Kiki",
					"text": "Phew!"
				},
				{
					"name": "Thomas",
					"text": "I'm beat."
				},
				{
					"name": "Kiki",
					"text": "Same. Let's go."
				},
				{
					"name": "Thomas",
					"text": "You stopping by the usual place today?"
				},
				{
					"name": "Kiki",
					"text": "You know it! Can't get by without a drink."
				},
				{
					"name": "Thomas",
					"text": "Hahah, same."
				},
				{
					"name": "Olivia",
					"text": "...Wait."
				},
				{
					"name": "Kiki&Thomas",
					"text": "Huh?"
				},
				{
					"name": "Olivia",
					"text": "Just, wait. Wait, all of you."
				},
				{
					"name": "Olivia",
					"text": "Wait... Stop right there and don't move."
				},
				{
					"name": "Kiki",
					"text": "We're waiting?"
				},
				{
					"text": "Come on!"
				},
				{
					"text": "You can do it, Olivia Berry!"
				},
				{
					"name": "Olivia",
					"text": "Y-Yes, I can see that. Y-You're not gonna get anything from me by standing there like a bunch of halfwits!"
				},
				{
					"text": "Olivia, no!"
				},
				{
					"name": "Kiki",
					"text": "Huh?!"
				},
				{
					"name": "Olivia",
					"text": "No, that's not what I want to say. Keep it together, Olivia."
				},
				{
					"name": "Thomas",
					"text": "Aren't we done here, ma'am?"
				},
				{
					"name": "Olivia",
					"text": "Yes, the rehearsal is over. But you still can't leave."
				},
				{
					"name": "Olivia",
					"text": "Because you're all my bloody slaves!"
				},
				{
					"text": "Noooooooo!"
				},
				{
					"name": "Olivia",
					"text": "No, that's not it! We're going today. You're coming with me to... drink."
				},
				{
					"name": "Thomas",
					"text": "Drink?"
				},
				{
					"name": "Kiki",
					"text": "Drink what?"
				},
				{
					"name": "Olivia",
					"text": "Ale, what else?!"
				},
				{
					"text": "Almost there!"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Olivia turns to me, her eyes blazing."
				},
				{
					"text": "I look away."
				},
				{
					"text": "This is her job as a leader."
				},
				{
					"text": "I pray you can find the strength within you, Olivia!"
				},
				{
					"name": "Olivia",
					"text": "Will's home is a small, dirty pub, you see. Today, you are all coming with me to pay a visit."
				},
				{
					"name": "Kiki",
					"text": "Uh, why?"
				},
				{
					"name": "Olivia",
					"text": "Silence!"
				},
				{
					"name": "Thomas",
					"text": "But..."
				},
				{
					"name": "Olivia",
					"text": "No buts!"
				},
				{
					"name": "Kiki&Thomas",
					"text": "..."
				},
				{
					"text": "Kiki and Thomas exchange glances, completely flabbergasted."
				},
				{
					"text": "The scene makes me titter."
				},
				{
					"name": "Olivia",
					"text": "...!"
				},
				{
					"text": "Olivia's head snaps back to me, and she walks up to me with her arm held high."
				},
				{
					"name": "Will",
					"text": "No, you're doing well, Oli—"
				},
				{
					"text": "She slaps me across the face with the force of a thousand suns."
				},
				{
					"name": "Will",
					"text": "Why?!"
				},
				{
					"name": "Olivia",
					"text": "Because I felt like it! Hurry and guide us there. It's your bloody pub."
				},
				{
					"name": "Will",
					"text": "O-Okay."
				},
				{
					"name": "Kiki",
					"text": "Well, we have no choice but to go, right?"
				},
				{
					"name": "Thomas",
					"text": "Certainly looks that way."
				},
				{
					"text": "With the rest of the troupe in tow, Olivia and I walk to the pub."
				},
				{
					"name": "Kiki",
					"text": "Whoa!"
				},
				{
					"name": "Thomas",
					"text": "This ain't half bad."
				},
				{
					"name": "Kiki",
					"text": "Yeah! This looks cozy! I love it when a place looks like trash but the food is actually good!"
				},
				{
					"name": "Olivia",
					"text": "Don't be stupid. It may be good now, but it was barely edible when I set foot in here for the first time."
				},
				{
					"name": "Will",
					"text": "That hurts."
				},
				{
					"name": "Kiki",
					"text": "Huh? This is Will's home, right?"
				},
				{
					"name": "Will",
					"text": "Yeah, but Olivia's the one who cooks."
				},
				{
					"name": "Thomas",
					"text": "Huh?"
				},
				{
					"name": "Kiki",
					"text": "Why?"
				},
				{
					"name": "Thomas",
					"text": "You live here together?"
				},
				{
					"name": "Olivia",
					"text": "You really think I could live in a rat hole like this? The bed is hard, and the pillows could pass as sandbags."
				},
				{
					"name": "Kiki",
					"text": "So you have stayed the night, then."
				},
				{
					"name": "Thomas",
					"text": "Whoa, color me surprised."
				},
				{
					"name": "Kiki",
					"text": "Right?"
				},
				{
					"name": "Olivia",
					"text": "It just happened, okay?! Stop gossiping and come help! Take down the chairs, wipe the tables and the counter! Make it quick!"
				},
				{
					"name": "Kiki&Thomas",
					"text": "Aye, ma'am."
				},
				{
					"name": "Will",
					"text": "Olivia, don't make them work. We brought them here to drink."
				},
				{
					"text": "After a while, my dad comes down the stairs."
				},
				{
					"name": "Father",
					"text": "Hm? Busy early today, eh?"
				},
				{
					"name": "Kiki",
					"text": "Someone came down the stairs!"
				},
				{
					"name": "Will",
					"text": "That's my dad. He's the owner of this place, kinda."
				},
				{
					"name": "Father",
					"text": "Will, who are these people?"
				},
				{
					"name": "Will",
					"text": "Troupe friends."
				},
				{
					"name": "Thomas",
					"text": "Friends?"
				},
				{
					"name": "Kiki",
					"text": "We are?"
				},
				{
					"text": "Kiki and Thomas exchange glances."
				},
				{
					"name": "Olivia",
					"text": "He can't see very well. Don't just stand there, Thomas!"
				},
				{
					"name": "Thomas",
					"text": "Ah, my bad."
				},
				{
					"text": "Olivia shouts at Thomas, and he quickly gets out of Dad's usual route to his seat."
				},
				{
					"name": "Olivia",
					"text": "Kiki, help him walk."
				},
				{
					"name": "Kiki",
					"text": "Ah, yes, ma'am."
				},
				{
					"name": "Father",
					"text": "Oh, sorry to bother you all."
				},
				{
					"name": "Kiki",
					"text": "Don't you worry!"
				},
				{
					"name": "Father",
					"text": "What a lovely lass. Truly, it's a shame my eyes can't see."
				},
				{
					"name": "Kiki",
					"text": "I'm a boy, though?"
				},
				{
					"name": "Father",
					"text": "Huh? A boy?! With that voice?!"
				},
				{
					"name": "Kiki",
					"text": "Yes, I have a dingle dangle as well."
				},
				{
					"name": "Father",
					"text": "Dingle Dangle? What does that mean?!"
				},
				{
					"name": "Kiki",
					"text": "Yes, see?"
				},
				{
					"text": "Kiki puts my father's hand over his crotch."
				},
				{
					"name": "Father",
					"text": "Hah, I'd say you are simply dangling my chain, lass."
				},
				{
					"name": "Kiki",
					"text": "How rude! Have a touch and see for yourself!"
				},
				{
					"name": "Kiki",
					"text": "Come on, feel it now?!"
				},
				{
					"name": "Will",
					"text": "For the love of God, Kiki, what are you doing to my father?!"
				},
				{
					"text": "When the pub opens, Olivia's regulars are quick to fill the remaining seats."
				},
				{
					"text": "The members of the troupe sit at the counter together."
				},
				{
					"text": "All of them look on in pure disbelief as Olivia serves the customers."
				},
				{
					"name": "Kiki",
					"text": "So kind..."
				},
				{
					"name": "Thomas",
					"text": "She's not shouting..."
				},
				{
					"name": "Kiki",
					"text": "It looks like she's having fun."
				},
				{
					"name": "Thomas",
					"text": "She looks so friendly too."
				},
				{
					"name": "Kiki&Thomas",
					"text": "Like she's a different person..."
				},
				{
					"name": "Will",
					"text": "Shocking, isn't it?"
				},
				{
					"name": "Thomas",
					"text": "Shocking doesn't do this justice."
				},
				{
					"name": "Kiki",
					"text": "I think this may be the first time I've actually seen her smile."
				},
				{
					"name": "Rob",
					"text": "Whoa, we're full up, eh?"
				},
				{
					"name": "Olivia",
					"text": "We kept one spot for you at the bar. That's your seat, right?"
				},
				{
					"name": "Rob",
					"text": "Oh, considerate as always, I see!"
				},
				{
					"name": "Will",
					"text": "Ale, right?"
				},
				{
					"name": "Rob",
					"text": "Aye. Hey, what's with these people?"
				},
				{
					"name": "Father",
					"text": "Will and Olivia's friends, it seems."
				},
				{
					"name": "Rob",
					"text": "Oh? So that means..."
				},
				{
					"text": "Rob stares at Kiki, who's seated next to him."
				},
				{
					"name": "Kiki",
					"text": "Yes, I'm a boy. Thank you."
				},
				{
					"name": "Rob",
					"text": "This adorable lass is a boy?!"
				},
				{
					"name": "Kiki",
					"text": "Yes, I have a dingle dangle."
				},
				{
					"name": "Rob",
					"text": "Dingle dangle? The dangly bits?! You have those?! It can't be!"
				},
				{
					"name": "Father",
					"text": "She'll let you touch if you ask nicely."
				},
				{
					"name": "Kiki",
					"text": "Yes, feel free to see for yourself. I'm happy to quell your doubts."
				},
				{
					"name": "Rob",
					"text": "Uh, I think I'll take your word for it."
				},
				{
					"name": "Rob",
					"text": "I am actually, uh, scared of how much I want to take him up on that offer."
				},
				{
					"name": "Father",
					"text": "It was a rather cute dingle dangle, I'll have you know."
				},
				{
					"name": "Rob",
					"text": "You went and touched it, you senile old dog?!"
				},
				{
					"name": "Father",
					"text": "Indeed. It felt like not a dangle at all. Truly a mysterious experience."
				},
				{
					"name": "Kiki",
					"text": "It was a dingle dangle, though?!"
				},
				{
					"text": "The pub stays busy for a while, but as the night rolls on, vacant seats start opening up."
				},
				{
					"name": "Will",
					"text": "Come join us, Olivia."
				},
				{
					"name": "Olivia",
					"text": "Mm, okay, I'm coming."
				},
				{
					"text": "Olivia stands beside the counter."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Thomas",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "How about we all share a toast together?"
				},
				{
					"name": "Kiki",
					"text": "Yeah, good idea!"
				},
				{
					"name": "Father",
					"text": "This can be on the house, Will. You all worked hard today, so I'd say you deserve it."
				},
				{
					"name": "Olivia",
					"text": "While I'm grateful for your consideration, I know the pub can't afford to hand out free drinks."
				},
				{
					"name": "Olivia",
					"text": "It's my troupe, so I'll pay."
				},
				{
					"name": "Rob",
					"text": "Are you the patron of the troupe, Olivia?"
				},
				{
					"name": "Will",
					"text": "Yeah, something like that."
				},
				{
					"text": "I can hardly say that Olivia's a fellow performer."
				},
				{
					"name": "Will",
					"text": "Right, everyone?"
				},
				{
					"name": "Thomas",
					"text": "Ah, yes."
				},
				{
					"name": "Kiki",
					"text": "Of course. Olivia has no dingle dangle, after all. You took a look between her legs already, didn't you, Will?"
				},
				{
					"name": "Rob",
					"text": "I see, so you're the patron together with Spencer, then. Are you two married, perchance?"
				},
				{
					"name": "Olivia",
					"text": "We are not married."
				},
				{
					"name": "Rob",
					"text": "Huh. Engaged, then?"
				},
				{
					"name": "Olivia",
					"text": "...Perhaps."
				},
				{
					"name": "Will",
					"text": "Everyone's good with ale, right?"
				},
				{
					"name": "Kiki",
					"text": "Yes!"
				},
				{
					"name": "Thomas",
					"text": "No problem here!"
				},
				{
					"name": "Will",
					"text": "How long have you two known each other?"
				},
				{
					"name": "Kiki",
					"text": "That's a good question."
				},
				{
					"name": "Thomas",
					"text": "Ever since we began burgling together in London, remember? It's been what, fifteen years since then?"
				},
				{
					"name": "Kiki",
					"text": "Whoa, that's a long time."
				},
				{
					"name": "Olivia",
					"text": "Fifteen years?! Wait a moment, how old are you, Kiki?!"
				},
				{
					"name": "Kiki",
					"text": "Tehehee!"
				},
				{
					"name": "Thomas",
					"text": "Older than me, right?"
				},
				{
					"name": "Will",
					"text": "Excuse me?!"
				},
				{
					"name": "Olivia",
					"text": "You can't be human..."
				},
				{
					"name": "Rob",
					"text": "What, you two are thieves?"
				},
				{
					"name": "Thomas",
					"text": "Ex-thieves, mind you."
				},
				{
					"name": "Kiki",
					"text": "And we made a point to steal only from noblemen."
				},
				{
					"name": "Thomas",
					"text": "Along the way, we realized that deceiving nobles was easier than stealing from them."
				},
				{
					"name": "Kiki",
					"text": "Yeah, so we started selling them shiny baubles and rocks. Fake jewels."
				},
				{
					"name": "Thomas",
					"text": "And they flew out of our hands. Those nobles are a bunch of damn fools!"
				},
				{
					"name": "Kiki",
					"text": "But Spencer busted us."
				},
				{
					"name": "Olivia",
					"text": "His aesthetic sense is a level above that of your average aristocrat. If there's one person who can see that everything which glitters is not gold, it's him."
				},
				{
					"name": "Olivia",
					"text": "When he sees something he deems beautiful, he loses sight of everything else. In a sense, he's pretty pure."
				},
				{
					"name": "Olivia",
					"text": "But he has no mercy for anything he doesn't deem beautiful. Bringing such crudely fashioned fake jewels before him was the same as asking to have your heads cut off."
				},
				{
					"name": "Kiki",
					"text": "Now, that was scary."
				},
				{
					"name": "Thomas",
					"text": "It was more creepy than scary. He didn't make any sense."
				},
				{
					"name": "Kiki",
					"text": "Yeah, I didn't even know what he was talking about."
				},
				{
					"name": "Will",
					"text": "So, Olivia paid for you two before he could have your heads cut off?"
				},
				{
					"name": "Olivia",
					"text": "Don't most stories have characters like these two? A pair of bumbling fools tripping their way into trouble."
				},
				{
					"name": "Father",
					"text": "Hahahah, right you are!"
				},
				{
					"name": "Thomas",
					"text": "If we got roles like that, we'd hardly need to act!"
				},
				{
					"name": "Kiki",
					"text": "We'd fit right in, eh?"
				},
				{
					"name": "Will",
					"text": "Fit right in..."
				},
				{
					"text": "I see, so you can put people in roles that fit them so it's easier for them to adapt."
				},
				{
					"text": "I fold my arms and think."
				},
				{
					"text": "Perhaps we're doing something fundamentally wrong in that regard?"
				},
				{
					"name": "Rob",
					"text": "Is the play you guys are rehearsing the same one I had Will write the script for?"
				},
				{
					"name": "Will",
					"text": "Huh? Ah, yes. The same one."
				},
				{
					"name": "Rob",
					"text": "It's based on that real life rumor I heard on my travels through Italy, is it not?"
				},
				{
					"name": "Kiki",
					"text": "Rumor?"
				},
				{
					"name": "Rob",
					"text": "This lad here has a downright scary memory."
				},
				{
					"name": "Rob",
					"text": "More than a good memory, I believe he's incapable of forgetting stuff."
				},
				{
					"name": "Will",
					"text": "I suppose that's fair to say."
				},
				{
					"name": "Rob",
					"text": "So, the peddlers who come here aren't only locals from Tenbridge; there are also those who travel around different countries, like me."
				},
				{
					"name": "Rob",
					"text": "And this lad here remembers every single offhand story they tell."
				},
				{
					"name": "Will",
					"text": "Some are talkative fellows like Rob who like to gossip over a drink, and others are booksellers."
				},
				{
					"name": "Will",
					"text": "Books are too expensive for me to buy, but while they're here, I memorize the contents of all the books they bring with them to sell to the nobles."
				},
				{
					"name": "Rob",
					"text": "Now that you're using them as material to write your own plays, it feels kind of suspect, eh?"
				},
				{
					"name": "Kiki",
					"text": "That's one heck of a story!"
				},
				{
					"name": "Thomas",
					"text": "That's one type of stealing no one will bust you for."
				},
				{
					"name": "Olivia",
					"text": "Don't be foolish. It's not something just anyone could replicate."
				},
				{
					"name": "Olivia",
					"text": "Besides, only someone with Will's talent would be able to take all the elements that work from so many sources and put them together to create a wholly new story. He's the only one capable of that."
				},
				{
					"name": "Father",
					"text": "If only he had the same competence for running a pub."
				},
				{
					"name": "Olivia",
					"text": "It beggars belief, truly."
				},
				{
					"name": "Rob",
					"text": "So, what kind of story did you end up making from my silly rumor?"
				},
				{
					"name": "Olivia",
					"text": "Come see it for yourself. The premiere is next week."
				},
				{
					"name": "Rob",
					"text": "Eh? That's so soon!"
				},
				{
					"name": "Father",
					"text": "Theater, eh? I sure wish I could go see Will's play."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "I glance at my dad."
				},
				{
					"text": "Olivia also directs a sympathetic look his way."
				},
				{
					"name": "Father",
					"text": "Ah, worry not. I don't need anything more from life after touching Kiki's dingle dangle."
				},
				{
					"name": "Kiki",
					"text": "Yes! My dingle dangle is a lot cuter than Will's crossdressing."
				},
				{
					"name": "Will",
					"text": "Can you stop saying that word? It's gonna give me nightmares."
				},
				{
					"name": "Olivia",
					"text": "...You all remember your lines, right?"
				},
				{
					"name": "Kiki",
					"text": "Huh?"
				},
				{
					"name": "Thomas",
					"text": "S-Somewhat?"
				},
				{
					"name": "Will",
					"text": "Why?"
				},
				{
					"name": "Olivia",
					"text": "Let's recite our lines. It'll be good practice to focus only on the words."
				},
				{
					"name": "Rob",
					"text": "Oh! We get a sneak peek?!"
				},
				{
					"name": "Olivia",
					"text": "Just a little public practice. Don't expect much, though—most of us are ham actors, sadly."
				},
				{
					"name": "Rob",
					"text": "You hear that, Boss? Looks like we get to hear Will's play!"
				},
				{
					"name": "Lysander",
					"text": "There, gentle Hermia, my love for thee is eternal! May I marry thee?"
				},
				{
					"name": "Hermia",
					"text": "My good Lysander! I swear to thee, by Cupid's strongest bow. To-morrow truly will I meet with thine, and our eternal will become!"
				},
				{
					"name": "Puck",
					"text": "Phew, that's one pair down."
				},
				{
					"name": "Helena",
					"text": "Ah, Demetrius. Finally, my love for thee has made thee see the light!"
				},
				{
					"name": "Lysander",
					"text": "Good morrow, friends. Saint Valentine is past. Perhaps we were blessed with everlasting love by the summer's court over this midsummer night."
				},
				{
					"name": "Helena",
					"text": "Oh, Demetrius. Ne'er leave my side once more!"
				},
				{
					"name": "Lysander",
					"text": "Let us go, Hermia. Before the morrow our vows will be sealed!"
				},
				{
					"name": "Hermia",
					"text": "Y-Yes, my love!"
				},
				{
					"name": "Puck",
					"text": "Why, then, finally all are awake! No more yielding but a dream, a gift, they say! Truly, all they did was have a silly midsummer night's dream! Courtesy of yours truly!"
				},
				{
					"name": "Rob",
					"text": "Hahah, I see now."
				},
				{
					"name": "Father",
					"text": "So that's how the play goes. It's a fun story, yes."
				},
				{
					"text": "We hold an impromptu recitation of the lines for my blind father."
				},
				{
					"text": "Olivia decided to fill in the role of one of the actors who couldn't come to the pub."
				},
				{
					"text": "Or that's the excuse we gave, since she's the main character."
				},
				{
					"name": "Rob",
					"text": "But Thomas and Kiki, you're definitely not very good at this acting thing, eh?"
				},
				{
					"name": "Thomas",
					"text": "I've got no talent, that's for sure."
				},
				{
					"name": "Kiki",
					"text": "I can't do much else than stand around and look cute."
				},
				{
					"name": "Rob",
					"text": "Hey, Will! You based this Puck fairy on that mischievous kid, right?"
				},
				{
					"name": "Will",
					"text": "Yeah."
				},
				{
					"name": "Rob",
					"text": "What did you think, Boss?"
				},
				{
					"name": "Father",
					"text": "Hm? During the whole thing, I was thinking..."
				},
				{
					"name": "Father",
					"text": "...that Kiki should be playing Puck."
				},
				{
					"name": "Rob",
					"text": "I agree."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Kiki",
					"text": "B-But, me? A mischievous kid? But I'm so cuuute!"
				},
				{
					"name": "Rob",
					"text": "But he's a bloke, right?"
				},
				{
					"name": "Father",
					"text": "How about we coin the word femboy? You know, as in a femme-like boy?"
				},
				{
					"name": "Rob",
					"text": "Boss, the day a sinful word like that catches on, it'll be the end of the world as we know it."
				},
				{
					"name": "Father",
					"text": "Heh, indeed."
				},
				{
					"name": "Will",
					"text": "Yeah... Puck the fairy should have a cuteness that transcends gender."
				},
				{
					"name": "Will",
					"text": "If Puck becomes the main attraction of the play with Kiki in the role, I'm sure it'll get the audience talking and excited."
				},
				{
					"name": "Olivia",
					"text": "But then what do we do about Helena?"
				},
				{
					"name": "Will",
					"text": "Thomas will be Helena."
				},
				{
					"name": "Thomas",
					"text": "Huh? I gotta crossdress?!"
				},
				{
					"name": "Olivia",
					"text": "Isn't that going to seem a little forced?"
				},
				{
					"name": "Will",
					"text": "It's the same thing we were talking about earlier. If we have Thomas dress up as Helena, her serious scenes won't feel so heavy."
				},
				{
					"name": "Will",
					"text": "Hermia's beloved is stolen from her by Helena, remember? What if Helena looks like Thomas?"
				},
				{
					"name": "Olivia",
					"text": "It would be the biggest of jokes."
				},
				{
					"name": "Thomas",
					"text": "Yeah... Wait, isn't that an insult?!"
				},
				{
					"name": "Kiki",
					"text": "Me as Puck? I wonder if it could work..."
				},
				{
					"name": "Olivia",
					"text": "Will, can you write down Puck and Helena's lines?"
				},
				{
					"name": "Will",
					"text": "Sure can."
				},
				{
					"name": "Olivia",
					"text": "It's okay if you have to read from the script, Thomas, Kiki. Let's give it one more try."
				},
				{
					"name": "Lysander",
					"text": "There, gentle Hermia, my love for thee is eternal! May I marry thee?"
				},
				{
					"name": "Hermia",
					"text": "My good Lysander! I swear to thee, by Cupid's strongest bow. To-morrow truly will I meet with thine, and our eternal will become!"
				},
				{
					"name": "Puck",
					"text": "Phew, that's one pair down."
				},
				{
					"name": "Helena",
					"text": "Ah, Demetrius. Finally, my love for thee has made thee see the light!"
				},
				{
					"name": "Rob",
					"text": "Pffft!"
				},
				{
					"name": "Father",
					"text": "Ahahahah!"
				},
				{
					"name": "Lysander",
					"text": "Good morrow, friends. Saint Valentine is past. Perhaps we were blessed with everlasting love by the summer's court over this midsummer night."
				},
				{
					"name": "Helena",
					"text": "Oh, Demetrius. Ne'er leave my side once more!"
				},
				{
					"name": "Father",
					"text": "Hah, ahahahah! *Cough*!"
				},
				{
					"name": "Rob",
					"text": "This is a bloody riot! Keep it coming! Ahahahah!"
				},
				{
					"name": "Lysander",
					"text": "Let us go, Hermia. Before the morrow our vows will be sealed!"
				},
				{
					"name": "Hermia",
					"text": "Y-Yes, my love!"
				},
				{
					"name": "Puck",
					"text": "Why, then, finally all are awake! No more yielding but a dream, a gift, they say! Truly, all they did was have a silly midsummer night's dream! Courtesy of yours truly!"
				},
				{
					"name": "Father",
					"text": "*Cough* Hah, hahahah! Yes, that's great!"
				},
				{
					"name": "Rob",
					"text": "This is a damn spectacle! Way better than before!"
				},
				{
					"name": "Will",
					"text": "Olivia."
				},
				{
					"name": "Olivia",
					"text": "Yes."
				},
				{
					"text": "Olivia turns to Kiki and Thomas."
				},
				{
					"name": "Olivia",
					"text": "While I can't in good conscience praise your acting, Thomas..."
				},
				{
					"name": "Olivia",
					"text": "I can at least tell you for certain that your acting will make the audience feel something."
				},
				{
					"name": "Olivia",
					"text": "It wasn't bad. Let's keep this change of roles."
				},
				{
					"text": "Kiki and Thomas flush in embarrassment."
				},
				{
					"name": "Kiki",
					"text": "We got praised?"
				},
				{
					"name": "Thomas",
					"text": "Us? By the leader?"
				},
				{
					"name": "Rob",
					"text": "Hey, Helena! The blush doesn't suit you!"
				},
				{
					"name": "Father",
					"text": "Ahahahah!"
				},
				{
					"name": "Will",
					"text": "How was it? Did you have fun?"
				},
				{
					"text": "Both of them seem stunned by the sudden words of encouragement."
				},
				{
					"name": "Kiki",
					"text": "Yeah, it kind of felt like the lines came naturally to me."
				},
				{
					"name": "Thomas",
					"text": "Me too!"
				},
				{
					"name": "Father",
					"text": "Damn liar!"
				},
				{
					"name": "Will",
					"text": "I'm glad. When I wrote the lines, I was imagining the two of you and how you usually are."
				},
				{
					"name": "Kiki",
					"text": "I see."
				},
				{
					"name": "Will",
					"text": "You're not playing Puck; Puck was modeled after you."
				},
				{
					"name": "Will",
					"text": "So this Puck can only be played by you. These lines are for your Puck."
				},
				{
					"name": "Kiki",
					"text": "For me, huh?"
				},
				{
					"name": "Will",
					"text": "It's the same for Helena, of course."
				},
				{
					"name": "Thomas",
					"text": "..."
				},
				{
					"text": "Thomas' cheeks flush a rosy pink."
				},
				{
					"text": "Oddly enough, Thomas is a lot more feminine than I thought. I'm honestly surprised."
				},
				{
					"name": "Olivia",
					"text": "You can take these new scripts. Have them memorized by tomorrow. You can manage that, right?"
				},
				{
					"name": "Kiki",
					"text": "Yeah!"
				},
				{
					"name": "Thomas",
					"text": "I'll try most valiantly!"
				},
				{
					"name": "Olivia",
					"text": "Good boys."
				},
				{
					"text": "Olivia smiles, keeping her eyes fixed on the happy group."
				},
				{
					"text": "I stare at her profile for a while."
				},
				{
					"text": "After a moment, she notices my gaze and turns to me with a displeased expression on her face."
				},
				{
					"name": "Olivia",
					"text": "What are you staring at?"
				},
				{
					"name": "Will",
					"text": "Nothing."
				},
				{
					"name": "Olivia",
					"text": "You're getting too big for your boots as of late."
				},
				{
					"name": "Will",
					"text": "Sorry about that. I am but a lowly slave, Lady Olivia."
				},
				{
					"name": "Olivia",
					"text": "Yeah, you're the image of subservience, all right. There's no need to 'lady' me."
				},
				{
					"name": "Will",
					"text": "You honor me, my lady."
				},
				{
					"name": "Olivia",
					"text": "Oh, shut up."
				},
				{
					"text": "I break into pure laughter."
				},
				{
					"text": "She pouts, but her lips settle into a sweet smile after a few seconds."
				},
				{
					"name": "Will",
					"text": "One more thing."
				},
				{
					"name": "Olivia",
					"text": "Mm?"
				},
				{
					"name": "Will",
					"text": "I finished the first draft."
				},
				{
					"text": "Her eyes widen upon hearing that."
				},
				{
					"text": "Then her rose-colored irises light up in expectation."
				},
				{
					"name": "Will",
					"text": "It's called..."
				},
				{
					"name": "Will",
					"text": "...Hamlet."
				},
				{
					"text": "We leave everyone making merry in the pub and head to my room together."
				},
				{
					"text": "Olivia reads the manuscript in silence."
				},
				{
					"text": "Her eyes sparkle with interest."
				},
				{
					"text": "It's enough to tell me that I was able to meet her expectations."
				},
				{
					"name": "Olivia",
					"text": "Will."
				},
				{
					"name": "Will",
					"text": "Yes?"
				},
				{
					"name": "Olivia",
					"text": "You're a bloody genius. I love you."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "It makes my heart skip a beat, but there is no feeling behind the words. An aggressive smile spreads from ear to ear on her face, as if something has taken possession of her."
				},
				{
					"name": "Olivia",
					"text": "Your dialogues have improved. This is a far cry from the first draft of A Midsummer Night's Dream. Reading this, I can clearly envision how it'll look on stage."
				},
				{
					"name": "Olivia",
					"text": "You now have a good grasp of how actors move around the stage."
				},
				{
					"name": "Will",
					"text": "Thanks to you."
				},
				{
					"name": "Olivia",
					"text": "However..."
				},
				{
					"text": "Olivia looks at the last page of the manuscript."
				},
				{
					"name": "Olivia",
					"text": "The final climax is somewhat weak. Killing everyone with poisoned wine feels like a waste."
				},
				{
					"name": "Olivia",
					"text": "Kill only one with the poison. It'll have more of an impact that way."
				},
				{
					"name": "Will",
					"text": "The mother, then."
				},
				{
					"name": "Olivia",
					"text": "I think that's the best, yes. She could drink from the wine while being aware there's poison in it. Perhaps a shred of maternal instinct drives her to choose suicide."
				},
				{
					"name": "Will",
					"text": "I see."
				},
				{
					"text": "In the last scene, Hamlet's uncle tries to take his nephew's life. That is to say, the man who killed his father and married his mother poisons Hamlet's wine."
				},
				{
					"text": "Upon becoming aware of this, his mother drinks the wine to protect him."
				},
				{
					"text": "It's a good idea for a proper end to the tragedy."
				},
				{
					"name": "Olivia",
					"text": "Because Ophelia loved Hamlet, she's swallowed by his madness and loses her life, right?"
				},
				{
					"text": "I nod."
				},
				{
					"name": "Olivia",
					"text": "Then, I think the finale should be a duel between Hamlet and Laertes."
				},
				{
					"name": "Olivia",
					"text": "The story can't end until the man who loved Ophelia as a woman and the man who loved her as a sister confront one another."
				},
				{
					"name": "Will",
					"text": "...Right."
				},
				{
					"name": "Olivia",
					"text": "Mm?"
				},
				{
					"name": "Will",
					"text": "I did consider that, but we don't have much time to rehearse. The Admiral's Men are the only troupe who can really pull off sword play scenes, right?"
				},
				{
					"name": "Olivia",
					"text": "And they're our biggest rivals, remember? Are we supposed to simply cower before them?"
				},
				{
					"name": "Will",
					"text": "But we only have ten days to rehearse this. The sword play would make it flashier, but we can make do with it as it is, no?"
				},
				{
					"name": "Olivia",
					"text": "We're doing it. Rewrite the scene."
				},
				{
					"name": "Will",
					"text": "You're gonna be Hamlet, right?"
				},
				{
					"text": "Olivia nods."
				},
				{
					"name": "Will",
					"text": "You may be able to handle yourself, but you need two for a sword fight. If the other person lacks training, you could get seriously hurt."
				},
				{
					"name": "Olivia",
					"text": "There is no play without pain, Will. Write it in. This scene will go down in history."
				},
				{
					"name": "Olivia",
					"text": "I guarantee so."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "You would ruin this story over a few flesh wounds for the actors?"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "I will bear the responsibility as your troupe leader. I've no intention of getting sloppy with the training, so just write it. I want no hesitation on your part."
				},
				{
					"name": "Olivia",
					"text": "Understood?"
				},
				{
					"text": "I blow a sigh of resignation."
				},
				{
					"name": "Will",
					"text": "All right."
				},
				{
					"name": "Olivia",
					"text": "Good boy."
				},
				{
					"text": "I take my quill and sit at the desk."
				},
				{
					"text": "It's been a week since we adjusted the cast roles."
				},
				{
					"text": "We've finished rehearsing."
				},
				{
					"text": "As the quality of rehearsals improved, so too did the quality of the play."
				},
				{
					"text": "And now, at last, it's premiere day."
				},
				{
					"text": "A mood of excited tension can be felt in the faces of all the troupe members."
				},
				{
					"text": "The theater is full."
				},
				{
					"text": "But there's a certain feeling of unequivocal hostility that makes it hard to believe this is our own theater."
				},
				{
					"text": "The news of my scuffle with Marlowe spread not only among the theater crowd, but across all of Tenbridge."
				},
				{
					"text": "A feud between the best of Tenbridge, the Admiral's Men."
				},
				{
					"text": "And Spencer's troupe, led by Olivia and infamous for their shoddy acting."
				},
				{
					"text": "The Globe theater is filled with sneers and loud mocking comments."
				},
				{
					"text": "We all form a small circle behind the stage."
				},
				{
					"name": "Olivia",
					"text": "It's a full house out there. Feels exhilarating, doesn't it?"
				},
				{
					"name": "Kiki",
					"text": "Hahah..."
				},
				{
					"name": "Thomas",
					"text": "Are we gonna be okay?"
				},
				{
					"name": "Olivia",
					"text": "Oh, are you mayhaps nervous, you two?"
				},
				{
					"name": "Kiki",
					"text": "Yeah..."
				},
				{
					"name": "Thomas",
					"text": "Can't deny that."
				},
				{
					"name": "Olivia",
					"text": "Yes, and I will tell you why. You cannot wait to overturn this tense atmosphere and make the stage yours."
				},
				{
					"name": "Olivia",
					"text": "Acting is no longer simply about killing time for you."
				},
				{
					"name": "Olivia",
					"text": "You want to show off all the effort you've put into it these past weeks. But you're afraid about whether or not you'll be able to pull it off perfectly, like so many times during rehearsal."
				},
				{
					"name": "Olivia",
					"text": "That's why you're nervous."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Thomas",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "Congratulations, my friends. Today is the day you walk onto that stage as true actors for the first time."
				},
				{
					"name": "Olivia",
					"text": "That goes for you as well, Will."
				},
				{
					"name": "Will",
					"text": "...Yeah."
				},
				{
					"name": "Olivia",
					"text": "Worry not, I will masterfully cover for all of your mistakes. Thankfully for you, the leader of this troupe was born to stand on the stage."
				},
				{
					"name": "Olivia",
					"text": "We can do it, understood?"
				},
				{
					"name": "Kiki&Thomas",
					"text": "Yes!"
				},
				{
					"name": "Olivia",
					"text": "Good boys."
				},
				{
					"name": "Kiki",
					"text": "Welcome one and all! Today, I, the fairy Puck, have the pleasure of presenting this foolish night of love between two men and women to you!"
				},
				{
					"name": "Spectator 1",
					"text": "Blimey, how cute!"
				},
				{
					"name": "Spectator 2",
					"text": "I can barely believe me eyes! Hark at that cutie!"
				},
				{
					"name": "Kiki",
					"text": "Love... As ephemeral and luscious as a Midsummer Night's Dream."
				},
				{
					"name": "Spectator 1",
					"text": "By my fay! This must be folly! How can such cuteness be contained in a body?!"
				},
				{
					"name": "Kiki",
					"text": "These four love-seeking souls lose themselves in the forest on a May night."
				},
				{
					"name": "Spectator 2",
					"text": "But only men can act, right? What is the meaning of this?"
				},
				{
					"name": "Spectator 1",
					"text": "Huh? You mean to say the lass is a bloke with dangly bits? Thou art cupshot, friend!"
				},
				{
					"name": "Kiki",
					"text": "In their hearts, a love for each other burns."
				},
				{
					"text": "Yesterday, I added some introduction lines for Kiki to recite."
				},
				{
					"text": "The plan is to hook them in with Kiki and hold their interest by making them look forward to him appearing again."
				},
				{
					"text": "After the introduction, we can feel the attention of the whole venue converged on us."
				},
				{
					"text": "The next part seems to be over in the blink of an eye."
				},
				{
					"text": "I go up on the stage and play the Hermia I based off Olivia's mannerisms. I can immediately tell my performance takes the audience's breath away."
				},
				{
					"text": "Breath that Thomas, as Helena, proceeds to turn into laughter in mere seconds."
				},
				{
					"text": "It's a series of up and downs between tension and loud laughter."
				},
				{
					"text": "Olivia's performance pulls it all together so the interest doesn't fizzle out at any point."
				},
				{
					"text": "The Midsummer Night's Dream that we created ended up as a play with a wide range of emotional fluctuations."
				},
				{
					"name": "Lysander",
					"text": "Good morrow, friends. Saint Valentine is past. Perhaps we were blessed with everlasting love by the summer's court over this midsummer night."
				},
				{
					"name": "Helena",
					"text": "Oh, Demetrius. Ne'er leave my side once more!"
				},
				{
					"name": "Spectator 1",
					"text": "Ahahahah! Helena, you look like a dried cow's tongue!"
				},
				{
					"name": "Spectator 2",
					"text": "Don't wiggle near me!"
				},
				{
					"name": "Lysander",
					"text": "Let us go, Hermia. Before the morrow our vows will be sealed!"
				},
				{
					"name": "Hermia",
					"text": "Yes, my love!"
				},
				{
					"text": "Then, Kiki pops up from the wing of the stage."
				},
				{
					"text": "The audience immediately begins cheering for him."
				},
				{
					"name": "Puck",
					"text": "Why, then, finally all are awake! No more yielding but a dream, a gift, they say! Truly, all they did was have a silly midsummer night's dream! Courtesy of yours truly!"
				},
				{
					"name": "Spectator 1",
					"text": "Puck, me love!"
				},
				{
					"name": "Spectator 2",
					"text": "Look over here! Let us see that smile!"
				},
				{
					"name": "Puck",
					"text": "Eheheh!"
				},
				{
					"name": "Spectators 1&2",
					"text": "Ah, be still me beatin' heart!"
				},
				{
					"name": "Kiki",
					"text": "Wasn't that incredible?!"
				},
				{
					"name": "Thomas",
					"text": "They liked it that much?!"
				},
				{
					"name": "Olivia",
					"text": "Of course they did. We put in the work, didn't we?"
				},
				{
					"text": "Even Olivia looks besides herself with joy."
				},
				{
					"text": "To be quite honest, I'm relieved."
				},
				{
					"text": "While we were still rehearsing, I dreamed several times that all our jokes fell flat."
				},
				{
					"text": "But the audience liked the play more than I ever dared to imagine."
				},
				{
					"name": "Kiki",
					"text": "It's amazing. They're still cheering."
				},
				{
					"name": "Thomas",
					"text": "It just doesn't stop."
				},
				{
					"name": "Olivia",
					"text": "Will."
				},
				{
					"name": "Will",
					"text": "Huh?"
				},
				{
					"name": "Olivia",
					"text": "They're waiting for you. Get out there."
				},
				{
					"name": "Kiki",
					"text": "Yeah, they're not gonna calm down until the bard shows his face!"
				},
				{
					"name": "Thomas",
					"text": "Looks like you got more work to do, pretty boy."
				},
				{
					"name": "Will",
					"text": "Are you sure I should go?"
				},
				{
					"name": "Olivia",
					"text": "Who else but you? Go now. Make sure this audience won't forget your face for as long as they live."
				},
				{
					"name": "Olivia",
					"text": "This part is yours to play too, William Shakespeare."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "As I step onto the stage, the cheers come louder, like a gust lifting me up into the air."
				},
				{
					"text": "I can't help but smile at them."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "Oh, are you watching me from up there, Ed?"
				},
				{
					"text": "It's just as you said."
				},
				{
					"text": "Our story reached the hearts of so many tonight."
				},
				{
					"text": "You can see it from where you are, can't you?"
				},
				{
					"text": "I raise my hands to acknowledge their jubilant applause."
				},
				{
					"text": "Which only makes the cheering grow even more intense."
				},
				{
					"text": "I regard the audience on the ground floor."
				},
				{
					"text": "Then I turn to salute the ones in the second and third floors."
				},
				{
					"text": "Someone calls my name."
				},
				{
					"text": "My name is now engraved in the memories of all the audience members as the author of this play."
				},
				{
					"text": "The Globe buzzes with the pure excitement emanating from the crowd."
				},
				{
					"text": "And here I am, basking in their unbridled adoration."
				},
				{
					"text": "Olivia was right..."
				},
				{
					"text": "Surely, a man can grow addicted to such a thing."
				},
				{
					"text": "A pleasure that overshadows even making love to a woman."
				},
				{
					"text": "...Not that I would know."
				},
				{
					"text": "I can't tell for certain, sadly."
				},
				{
					"text": "But..."
				},
				{
					"text": "It certainly is the best moment of my life."
				},
				{
					"text": "I turn backstage."
				},
				{
					"text": "Olivia is clapping, a pleased smile gracing her face from ear to ear."
				},
				{
					"text": "Looking at that smile..."
				},
				{
					"text": "I realize that perhaps it's the reason I have been writing stories up to this day."
				},
				{
					"text": "When the realization dawns upon me, all the sounds become muted around me."
				},
				{
					"text": "She's beaming, smiling with her whole face. Her bright rose eyes shimmer like jewels in the shadows behind the stage."
				},
				{
					"text": "I stare right into her eyes."
				},
				{
					"text": "She gives me a short nod."
				},
				{
					"text": "In a daze, I lose myself in her eyes."
				},
				{
					"text": "Olivia keeps clapping her hands joyfully."
				},
				{
					"text": "After a while, she explodes in laughter."
				},
				{
					"text": "With an amused smile on her face, she points me to the audience with her chin."
				},
				{
					"text": "But looking at anything but her smile would be the gravest of sins for me."
				},
				{
					"text": "I want to stay in this mute world, watching her smile for all eternity."
				},
				{
					"text": "There is no wish more fervent in my heart."
				},
				{
					"text": "Alas, the roaring cheer pulls me back to reality."
				},
				{
					"text": "I turn back to the audience."
				},
				{
					"text": "And I raise my arms towards them again."
				},
				{
					"text": "They keep calling my name in standing ovation."
				},
				{
					"text": "I'm glad to be able to write."
				},
				{
					"text": "I'm happy I joined this troupe."
				},
				{
					"text": "I'm infinitely thankful to Olivia for showing me the world beyond my narrow counter."
				},
				{
					"text": "I'm glad we met that night. Of that, I am certain."
				},
				{
					"name": "Will",
					"text": "And that's what happened."
				},
				{
					"name": "Kiki",
					"text": "Our premiere was a smashing success!"
				},
				{
					"name": "Rob",
					"text": "Ooh!"
				},
				{
					"name": "Will",
					"text": "And it's time to celebrate, of course."
				},
				{
					"text": "...But I don't see Olivia anywhere."
				},
				{
					"name": "Kiki",
					"text": "Where's the leader? Oh, I don't see Thomas around either."
				},
				{
					"name": "Will",
					"text": "Thomas sure takes a long time to take off the make up. He's not used to dealing with dresses yet either."
				},
				{
					"name": "Rob",
					"text": "Ahahaha! He could give a show to our customers here!"
				},
				{
					"name": "Father",
					"text": "Hah, it really went that well tonight?"
				},
				{
					"name": "Kiki",
					"text": "It was the best night ever! There were even some members of the audience looking for me after it was all said and done! They wanted to drown me with praise personally!"
				},
				{
					"name": "Rob",
					"text": "Ahahaha! And you're happy about that?!"
				},
				{
					"name": "Will",
					"text": "It's fine. I'm sure the audience will talk Kiki up all around town."
				},
				{
					"name": "Will",
					"text": "And the ones who get attached to him will keep coming back for more."
				},
				{
					"name": "Father",
					"text": "But won't people get bored of seeing the same play all the time?"
				},
				{
					"name": "Will",
					"text": "In the meantime, we'll rehearse for a tragedy to change up the mood from today's comedy."
				},
				{
					"name": "Will",
					"text": "That'll shake up the audience and get the whole city talking about us."
				},
				{
					"name": "Will",
					"text": "It seems that the Queen decides which troupe will perform for the court next based on what plays people in town are talking about, so we're trying to get our name out there."
				},
				{
					"name": "Will",
					"text": "We don't have a huge repertoire of plays to draw from like the Admiral's Men just yet, so that's our best shot."
				},
				{
					"name": "Rob",
					"text": "I see."
				},
				{
					"name": "Father",
					"text": "If you used a tenth of that sagacity to run this pub, I bet we'd have a branch in the middle of the fountain square by now."
				},
				{
					"name": "Will",
					"text": "I'm not made for this kind of work, and you know that."
				},
				{
					"name": "Father",
					"text": "Better than anyone."
				},
				{
					"name": "Rob",
					"text": "Can't deny it."
				},
				{
					"name": "Kiki",
					"text": "Do you know what this tragedy will be about already?"
				},
				{
					"name": "Will",
					"text": "Yeah, I finished writing it. Actually, I wanted to talk about it tonight."
				},
				{
					"name": "Will",
					"text": "But they're taking so long. Should we begin without them?"
				},
				{
					"name": "Kiki",
					"text": "It'd feel wrong to begin without our leader here."
				},
				{
					"text": "Kiki says, his shoulders drooping a little."
				},
				{
					"text": "Seeing his disappointment brings a smile to my face. We're a real team now, I feel."
				},
				{
					"name": "Will",
					"text": "I'll go fetch them. They must still be at the theater. Let's see if she doesn't bite my head off for trying to give her orders."
				},
				{
					"name": "Kiki",
					"text": "See you in the other life, just in case!"
				},
				{
					"name": "Father",
					"text": "No more deer stealing attempts, you hear me?"
				},
				{
					"name": "Will",
					"text": "I won't, thanks for the concern. You can wait here for us. Drink all you want, just don't get drunk."
				},
				{
					"name": "Kiki",
					"text": "Nah, I think I'll wait."
				},
				{
					"name": "Olivia",
					"text": "Hah..."
				},
				{
					"text": "At last."
				},
				{
					"text": "Finally, I made it."
				},
				{
					"text": "The ear splitting cheers."
				},
				{
					"text": "The satisfaction painted on the faces of the audience."
				},
				{
					"text": "As soon as I close my eyes, they come back to me as clear as the light of day."
				},
				{
					"text": "The stars look so near, as if I could reach out and touch them."
				},
				{
					"text": "Will kept his promise."
				},
				{
					"text": "I wanted him to do whatever it took to move me to tears."
				},
				{
					"text": "That's what I ordered him to do when we met."
				},
				{
					"text": "And he kept his promise, and did so much more."
				},
				{
					"text": "On the day of our first performance."
				},
				{
					"text": "He's a great man."
				},
				{
					"text": "No, he became a great man."
				},
				{
					"text": "He overcame all the challenges I had him face these last few days."
				},
				{
					"text": "I remember the day he tried to steal the deer."
				},
				{
					"text": "The way his eyes resembled those of a lost child brings a smile to my face."
				},
				{
					"text": "That sheen of anxiety is gone from them now."
				},
				{
					"text": "Today, he stood on the stage as a man, imposing and respectable."
				},
				{
					"text": "I need to be careful around him from now on, or he might very well end up stealing my breath away."
				},
				{
					"text": "His Hermia was beautiful beyond words."
				},
				{
					"text": "I wipe away the tears pooling at the corners of my eyes."
				},
				{
					"text": "I can't be seen by the other troupe members being this sentimental."
				},
				{
					"text": "We merely took our first step."
				},
				{
					"text": "With them by my side, I am sure we can aim for the moon."
				},
				{
					"name": "??",
					"text": "Leader."
				},
				{
					"name": "Olivia",
					"text": "Ah!"
				},
				{
					"name": "Olivia",
					"text": "Oh, Thomas. Don't sneak up on me like that. What is it?"
				},
				{
					"name": "Thomas",
					"text": "It takes me so long to take off the make up. It just won't come off!"
				},
				{
					"name": "Olivia",
					"text": "Get used to it. You'd just sweat it away if we didn't cake it on like that."
				},
				{
					"name": "Thomas",
					"text": "Yes, ma'am. We're going to Will's pub now, right?"
				},
				{
					"name": "Olivia",
					"text": "Ah, yes, yes. I need to change first. You go on ahead."
				},
				{
					"name": "Thomas",
					"text": "Yes, ma'am."
				},
				{
					"name": "Olivia",
					"text": "Don't you go starting the party without me."
				},
				{
					"name": "Thomas",
					"text": "Understood, ma'am."
				},
				{
					"name": "Olivia",
					"text": "Mm..."
				},
				{
					"text": "I watch the lanky man scratching his face as he walks away."
				},
				{
					"text": "I still find it hard to believe that he can perform a comical role so well."
				},
				{
					"text": "We could add a jester like him to any play we make."
				},
				{
					"text": "Even in a tragedy, you need to a character to add some levity to the proceedings."
				},
				{
					"text": "I never imagined the day would come when he would become an invaluable asset to our troupe."
				},
				{
					"text": "When Thomas is gone, I turn to the wings of the stage."
				},
				{
					"name": "??",
					"text": "Olive."
				},
				{
					"name": "Olivia",
					"text": "*Sigh* What now?!"
				},
				{
					"text": "When I turn around..."
				},
				{
					"text": "I find myself staring at the person who I want to see the least in the world."
				},
				{
					"text": "Why? Why now?"
				},
				{
					"text": "I bite my lip and repress the shudders threatening to rack my body."
				},
				{
					"name": "Olivia",
					"text": "...Lord Spencer."
				},
				{
					"name": "Spencer",
					"text": "I saw it all, Olive. It was a most curiously exciting display."
				},
				{
					"name": "Olivia",
					"text": "I suppose..."
				},
				{
					"name": "Spencer",
					"text": "That deer loving chico is the one who wrote that? What was his name? Ah, yes, Shakespeare."
				},
				{
					"name": "Olivia",
					"text": "Yes."
				},
				{
					"name": "Spencer",
					"text": "You were absolutely right. He certainly was able to show something more hermoso than his head on a pike."
				},
				{
					"name": "Olivia",
					"text": "Your words honor me."
				},
				{
					"name": "Spencer",
					"text": "And that girl was quite nice as well. Puck the fairy, was it? They were extremely linda."
				},
				{
					"name": "Spencer",
					"text": "Is she like you? A chica pretending to have a cute little amigo down there?"
				},
				{
					"name": "Olivia",
					"text": "No, he's a man, Lord Spencer."
				},
				{
					"name": "Spencer",
					"text": "Hoo! Bellisimo! So that means that the chico has an amigo dangling between his legs?"
				},
				{
					"name": "Spencer",
					"text": "Pecking at it like a lindo pajaro would be most exciting, wouldn't you say?"
				},
				{
					"name": "Spencer",
					"text": "Do bring him along so he can entertain me one of these days."
				},
				{
					"name": "Olivia",
					"text": "Yes... If circumstances allow..."
				},
				{
					"name": "Spencer",
					"text": "But, I do believe the one that brillo the brightest..."
				},
				{
					"name": "Spencer",
					"text": "...was you, Olive."
				},
				{
					"name": "Olivia",
					"text": "Again, your words honor me."
				},
				{
					"name": "Spencer",
					"text": "Watching you dress as a chico was most thrilling... Ah, I want to hold you in my arms. Defile that otherworldly beauty that is neither man nor woman."
				},
				{
					"name": "Spencer",
					"text": "Ahora mismo, right now."
				},
				{
					"name": "Olivia",
					"text": "Please, Lord Spencer, not here..."
				},
				{
					"name": "Spencer",
					"text": "Que? What did you say, Olive?"
				},
				{
					"name": "Olivia",
					"text": "I am quite fatigued from the intensive rehearsals, and the troupe members are always coming and going—"
				},
				{
					"name": "Spencer",
					"text": "Para, stop. Olive, who am I?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "I can feel a building ire behind his words."
				},
				{
					"text": "Even now..."
				},
				{
					"text": "Hearing that tone makes my body tense reflexively."
				},
				{
					"text": "I'm so pathetic."
				},
				{
					"text": "I hate that I yield to this man out of fear. Hate it with every fiber of my being."
				},
				{
					"name": "Spencer",
					"text": "Quien soy yo? Who am I?"
				},
				{
					"name": "Olivia",
					"text": "Lord Harold Spencer."
				},
				{
					"name": "Spencer",
					"text": "Si, and you are Olivia Berry. You are my...?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Spencer",
					"text": "Answer, Olive. I want to hear it from your labios."
				},
				{
					"name": "Olivia",
					"text": "...Your slave."
				},
				{
					"name": "Spencer",
					"text": "That's what I thought. Don't you ever forget our reglas, our rules. This theater also belongs to me."
				},
				{
					"name": "Spencer",
					"text": "What happens to MY esclava inside of MY theater is for ME to decide."
				},
				{
					"name": "Spencer",
					"text": "ME, ME, ME, y nadie mas que ME!"
				},
				{
					"name": "Olivia",
					"text": "I beg you. Please spare me, just for today."
				},
				{
					"name": "Olivia",
					"text": "My troupe members are waiting for me. I beg for lenience, my Lord."
				},
				{
					"text": "I lower my head to him."
				},
				{
					"text": "I don't want this."
				},
				{
					"text": "Not today."
				},
				{
					"text": "Just this one day."
				},
				{
					"text": "I want to enjoy this happiness Will gave me."
				},
				{
					"text": "I don't want it to be crumpled and broken like this."
				},
				{
					"text": "Not like this..."
				},
				{
					"text": "I don't want my memories of this day to be marred by this man. I don't want to remember this day as yet another one where I was violated."
				},
				{
					"name": "Olivia",
					"text": "Please, I beg you..."
				},
				{
					"name": "Spencer",
					"text": "Let's go inside, Olive."
				},
				{
					"text": "Spencer yanks my arm and drags me backstage."
				},
				{
					"name": "Olivia",
					"text": "Ah!"
				},
				{
					"name": "Spencer",
					"text": "Didn't I tell you that there would be no mercy next time?"
				},
				{
					"name": "Spencer",
					"text": "Go inside and take off your trousers. Keep the top on. I feel like doing it with a chico today."
				},
				{
					"name": "Spencer",
					"text": "That's an order."
				},
				{
					"text": "His whisper freezes me to the core."
				},
				{
					"text": "This man's voice is a curse."
				},
				{
					"text": "A curse that robs my body of its freedom."
				},
				{
					"name": "Olivia",
					"text": "...Yes."
				},
				{
					"text": "Doing as he says, I turn on my heels and walk to the antechamber."
				},
				{
					"name": "Will",
					"text": "Hah... Hah..."
				},
				{
					"text": "I run back to the theater."
				},
				{
					"text": "By all accounts, I should be tired, but I feel strangely light on my feet."
				},
				{
					"text": "Even my labored breaths feel wonderful in my chest."
				},
				{
					"text": "I notice another figure running down the street, heading in my direction."
				},
				{
					"text": "I can't help but smile."
				},
				{
					"name": "Thomas",
					"text": "Oh, is that you, Will?"
				},
				{
					"text": "The familiar lanky man swaggers his way down the street."
				},
				{
					"name": "Will",
					"text": "Where's the leader?"
				},
				{
					"name": "Thomas",
					"text": "Still at the theater. She was spacing out back there."
				},
				{
					"text": "My smile turns a little bitter."
				},
				{
					"text": "Is she still basking in today's success?"
				},
				{
					"text": "That's the Olivia I know."
				},
				{
					"name": "Thomas",
					"text": "Where's everyone else?"
				},
				{
					"name": "Will",
					"text": "Waiting at the pub. You go on ahead, I'll bring her over."
				},
				{
					"name": "Thomas",
					"text": "Got that, my good man. See you there."
				},
				{
					"text": "The theater comes into view."
				},
				{
					"text": "It's hard to believe that this quiet place was full of cheer and joy until not so long ago."
				},
				{
					"text": "I hurry through the gates, impatient to see her."
				},
				{
					"name": "Will",
					"text": "Huh?"
				},
				{
					"text": "But she's nowhere to be seen."
				},
				{
					"text": "It's a little late to be changing clothes."
				},
				{
					"text": "I know for a fact that she more than any of us wanted today's play to be a success."
				},
				{
					"text": "I was certain she'd be standing by herself on the stage getting sentimental."
				},
				{
					"text": "I'm sure she doesn't want the others to see her like that."
				},
				{
					"text": "That's why I thought to come alone."
				},
				{
					"text": "I look over the stage."
				},
				{
					"text": "The time I spent on it was the best of my life."
				},
				{
					"text": "All eyes were on us."
				},
				{
					"text": "The audience laughed at our jokes and applauded until their hands were sore."
				},
				{
					"text": "That moment was so special that I forgot all about my contest with Marlowe."
				},
				{
					"text": "The first day she brought me here..."
				},
				{
					"text": "Olivia must have been looking at the stage with the same feeling I have now."
				},
				{
					"text": "When I remember that night, a smile comes to my lips."
				},
				{
					"text": "Step by step, I approach the stage."
				},
				{
					"text": "I stand where Olivia stood during rehearsals."
				},
				{
					"text": "A position from which you can overlook one end of the stage to the other."
				},
				{
					"text": "And then..."
				},
				{
					"text": "From backstage, I hear the thud of something falling."
				},
				{
					"name": "Will",
					"text": "Olivia? Are you there?"
				},
				{
					"text": "The backstage area is separated by a thick curtain."
				},
				{
					"text": "I reach for the cloth and..."
				},
				{
					"name": "Spencer",
					"text": "Oh?"
				},
				{
					"name": "Will",
					"text": "You..."
				},
				{
					"name": "Spencer",
					"text": "You are... Shakespeare!"
				},
				{
					"name": "Will",
					"text": "Spencer."
				},
				{
					"name": "Spencer",
					"text": "Mm? What is it?"
				},
				{
					"name": "Will",
					"text": "Uh, nothing."
				},
				{
					"name": "Spencer",
					"text": "I saw your hermosa performance today."
				},
				{
					"name": "Spencer",
					"text": "It was truly magnifico. Are you going to keep writing and exercise that creativo brain of yours? I mean, it would be a waste not to."
				},
				{
					"name": "Will",
					"text": "I will. I was planning to from the beginning."
				},
				{
					"name": "Spencer",
					"text": "Oh, and your dress, it was simply sublime. If you ever grow weary of being Olivia's esclavo, come to me."
				},
				{
					"name": "Will",
					"text": "No, uh, thanks..."
				},
				{
					"name": "Spencer",
					"text": "Though you're still not as hermoso as Olivia. That said, you are quite precioso indeed."
				},
				{
					"name": "Spencer",
					"text": "A precioso, shining chico. I do believe you have room to grow and spread your wings."
				},
				{
					"name": "Will",
					"text": "Okay?"
				},
				{
					"name": "Spencer",
					"text": "Bien, muy bien."
				},
				{
					"text": "What's bien?"
				},
				{
					"name": "Spencer",
					"text": "I shall come to watch you act again, buenas noches."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "Spencer walks past me and leaves the theater swiftly."
				},
				{
					"name": "Will",
					"text": "What was he doing here?"
				},
				{
					"text": "After watching him leave, I go backstage."
				},
				{
					"name": "Will",
					"text": "Olivia?"
				},
				{
					"text": "When I call out to her, Olivia's shoulders twitch in the dark."
				},
				{
					"name": "Olivia",
					"text": "Will?"
				},
				{
					"text": "She's changed into her usual dress."
				},
				{
					"text": "But her clothes look a bit disheveled."
				},
				{
					"text": "Maybe she was in the middle of changing."
				},
				{
					"name": "Will",
					"text": "Ah, sorry. I wasn't peeping on you or anything."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Her eyes are swimming about."
				},
				{
					"name": "Will",
					"text": "It's late, so I was wondering where you were."
				},
				{
					"name": "Will",
					"text": "Everyone's waiting for you."
				},
				{
					"name": "Olivia",
					"text": "Right..."
				},
				{
					"name": "Will",
					"text": "We can't celebrate without our leader, can we?"
				},
				{
					"text": "She doesn't respond."
				},
				{
					"text": "Something's off."
				},
				{
					"text": "I stare at her for a moment."
				},
				{
					"text": "She turns away from me and speaks with her back to me."
				},
				{
					"name": "Olivia",
					"text": "Did you see that?"
				},
				{
					"name": "Will",
					"text": "See what?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Her gaze still wanders."
				},
				{
					"name": "Will",
					"text": "I didn't see you changing clothes."
				},
				{
					"name": "Olivia",
					"text": "...Right."
				},
				{
					"text": "Then, I notice her costume scattered on the floor."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "She follows my gaze and goes to pick it up in a hurry."
				},
				{
					"name": "Will",
					"text": "What's wrong? You're acting strange."
				},
				{
					"text": "Olivia keeps her head down, refusing to look at me."
				},
				{
					"name": "Will",
					"text": "Did something happen with Spencer? Did he do something to you?"
				},
				{
					"text": "Her head snaps back to me, and I see fear in her eyes."
				},
				{
					"name": "Olivia",
					"text": "Why?"
				},
				{
					"name": "Will",
					"text": "Huh? We just passed each other on the stage."
				},
				{
					"name": "Olivia",
					"text": "...Oh."
				},
				{
					"text": "Silence falls."
				},
				{
					"text": "An awkward, pregnant silence."
				},
				{
					"name": "Will",
					"text": "What's wrong? Did something happen?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "Olivia? What happened?"
				},
				{
					"name": "Olivia",
					"text": "Nothing at all."
				},
				{
					"name": "Will",
					"text": "Don't lie to me. I can't do anything if you don't talk to me."
				},
				{
					"name": "Olivia",
					"text": "You want to know? You're gonna make me say it?"
				},
				{
					"text": "Olivia sniggers."
				},
				{
					"name": "Will",
					"text": "Huh?"
				},
				{
					"name": "Olivia",
					"text": "Right, you won't understand unless I spell it out, will you?"
				},
				{
					"name": "Will",
					"text": "What?"
				},
				{
					"text": "Olivia turns to me, clearly at her wit's end."
				},
				{
					"name": "Olivia",
					"text": "I was just sharing an intimate moment with my fiance backstage. You have a problem with that?"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "I look at the bundle of clothes she's holding."
				},
				{
					"text": "It's the Lysander costume she wore on stage."
				},
				{
					"name": "Will",
					"text": "Here? Just now?"
				},
				{
					"name": "Olivia",
					"text": "Yes, that's what I said."
				},
				{
					"text": "Olivia answers my question without blinking."
				},
				{
					"text": "Like she's just swatting down a fly."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "I see."
				},
				{
					"name": "Olivia",
					"text": "What, you have something to say?"
				},
				{
					"name": "Will",
					"text": "No..."
				},
				{
					"text": "Olivia glares at me, still holding the costume in her arms."
				},
				{
					"text": "At a loss, I hang my head and look down at the floor."
				},
				{
					"text": "For a moment I picture them doing that here, but I quickly push the thought from my mind."
				},
				{
					"text": "It has nothing to do with me. It's between the two of them."
				},
				{
					"text": "I don't have the right to say anything."
				},
				{
					"text": "The silence extends."
				},
				{
					"name": "Olivia",
					"text": "I do it for my own benefit. No one has the right to belittle me over it."
				},
				{
					"text": "She murmurs slowly, each word more marked than the last."
				},
				{
					"text": "I raise my face and look at her."
				},
				{
					"text": "Her eyes seem out of focus."
				},
				{
					"name": "Olivia",
					"text": "I couldn't keep on living otherwise. I couldn't own the stage I saw for myself."
				},
				{
					"name": "Olivia",
					"text": "You've no reason to find fault with my actions. I have no regrets."
				},
				{
					"text": "Olivia says, staring into my eyes."
				},
				{
					"text": "Silent tears trail down her face."
				},
				{
					"name": "Will",
					"text": "You..."
				},
				{
					"name": "Olivia",
					"text": "What?"
				},
				{
					"name": "Will",
					"text": "...are no good at acting this role."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "I'm not going to find fault or belittle you. If this is what you want to do, that's all there is to it."
				},
				{
					"name": "Will",
					"text": "It's just as you say. If you have no regrets and are satisfied with this, I won't say a word."
				},
				{
					"text": "She bites down on her lower lip."
				},
				{
					"text": "The tears keep on rolling with no sign of stopping."
				},
				{
					"name": "Will",
					"text": "But..."
				},
				{
					"name": "Will",
					"text": "It doesn't seem like that's the case."
				},
				{
					"name": "Olivia",
					"text": "How would you even know such a thing?"
				},
				{
					"name": "Will",
					"text": "Then let me ask you this."
				},
				{
					"name": "Will",
					"text": "Why are you crying?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "It seems like she's about to say something, but she chokes on the words."
				},
				{
					"text": "Instead, she just bites her lip and says nothing."
				},
				{
					"name": "Will",
					"text": "If you truly have no regrets..."
				},
				{
					"name": "Will",
					"text": "Why do you look so terribly miserable?"
				},
				{
					"name": "Olivia",
					"text": "Silence!"
				},
				{
					"text": "Olivia throws her costume at me and storms out onto the stage."
				},
				{
					"name": "Olivia",
					"text": "*Sob*"
				},
				{
					"text": "The tears won't stop."
				},
				{
					"text": "I ran away from him in the heat of the moment."
				},
				{
					"text": "His steady gaze, his words of concern."
				},
				{
					"text": "I simply can't bear it."
				},
				{
					"text": "I can still feel Spencer in me."
				},
				{
					"text": "It's revolting. I detest it with every fiber of my being."
				},
				{
					"text": "I want to scratch at my body until my skin tears and I can scrub out the lingering feeling from within."
				},
				{
					"text": "But I can't rid myself of the sensation."
				},
				{
					"text": "I don't want to face Will like this, dirtied and sullied."
				},
				{
					"text": "The tears keep falling down my face."
				},
				{
					"text": "They create streaks down my cheeks and run down my neck."
				},
				{
					"text": "Normally, I could stop at the drop of a hat."
				},
				{
					"text": "I could conjure up a bold smile to hide behind."
				},
				{
					"text": "But this time, I can't."
				},
				{
					"text": "Even though I know I can't afford even one second of not being an actress in front of others."
				},
				{
					"text": "I know this, and yet..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "I can't force my face muscles to make any expression."
				},
				{
					"text": "I can't do anything but cry like a little girl."
				},
				{
					"text": "All the faces I practiced just aren't coming to me."
				},
				{
					"text": "I'm supposed to be a bloody actress."
				},
				{
					"text": "I hear Will's footsteps from behind."
				},
				{
					"text": "They grow closer, then stop."
				},
				{
					"name": "Will",
					"text": "Olivia."
				},
				{
					"name": "Olivia",
					"text": "Go away. I don't want to see you right now."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "I... I'm dirty now..."
				},
				{
					"name": "Olivia",
					"text": "I don't want you to see me like this."
				},
				{
					"name": "Will",
					"text": "Dirty how?"
				},
				{
					"text": "Will's tone is calm, gentle."
				},
				{
					"name": "Olivia",
					"text": "All of me, everything. My body. My heart."
				},
				{
					"text": "I say, closing my eyes."
				},
				{
					"text": "I manage hold back the overwhelming sob threatening to force its way out of my throat."
				},
				{
					"name": "Olivia",
					"text": "I was the one who decided that I was okay with this."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "I would do anything I needed to be an actress, to stand on the stage!"
				},
				{
					"name": "Olivia",
					"text": "Sleep with my patron, and make the whole troupe my slaves."
				},
				{
					"text": "My voice comes out like a shivering whimper."
				},
				{
					"text": "That's what I hear as it reaches my ears."
				},
				{
					"name": "Olivia",
					"text": "I have no other means, no way other than that."
				},
				{
					"name": "Will",
					"text": "I see."
				},
				{
					"name": "Olivia",
					"text": "Even so..."
				},
				{
					"text": "I look down at my feet."
				},
				{
					"text": "Tears patter onto the dry wood below."
				},
				{
					"text": "One after the other."
				},
				{
					"text": "The tears fall like rain on the ground."
				},
				{
					"name": "Olivia",
					"text": "You're the only one I didn't want to know."
				},
				{
					"text": "I can hear Will's steady breathing from behind me."
				},
				{
					"text": "What kind of expression is on his face as he watches me?"
				},
				{
					"text": "I am deathly afraid to look."
				},
				{
					"name": "Olivia",
					"text": "I didn't want you to know. You're the last person I wanted to see me like this."
				},
				{
					"name": "Will",
					"text": "Why?"
				},
				{
					"name": "Olivia",
					"text": "I don't know!"
				},
				{
					"text": "If we met under different circumstances..."
				},
				{
					"text": "If I were from a different background..."
				},
				{
					"text": "If I were born to a family of nobles from the beginning..."
				},
				{
					"text": "Perhaps I could have honestly told him that I wanted him to hold me, to love me."
				},
				{
					"text": "I would have been able to express my feelings, tell him about this love for him that burns more intensely inside my chest with every passing day."
				},
				{
					"text": "But it's too late now."
				},
				{
					"text": "I am too late."
				},
				{
					"text": "It's been too late since the moment I was born."
				},
				{
					"text": "Will takes another step closer."
				},
				{
					"text": "I can feel his faint warmth on my back."
				},
				{
					"text": "And then..."
				},
				{
					"text": "He gently wraps his arms around me."
				},
				{
					"text": "I can feel his cheek brushing against my hair."
				},
				{
					"name": "Olivia",
					"text": "What are you doing?"
				},
				{
					"name": "Will",
					"text": "I don't know either."
				},
				{
					"text": "I hear his voice near to my ear."
				},
				{
					"name": "Olivia",
					"text": "Stop. Let go of me."
				},
				{
					"name": "Will",
					"text": "No."
				},
				{
					"name": "Olivia",
					"text": "You never think about the consequences of your actions."
				},
				{
					"name": "Olivia",
					"text": "You haven't learned a thing since the day we met."
				},
				{
					"name": "Will",
					"text": "I like to think I wear my heart on my sleeve."
				},
				{
					"name": "Will",
					"text": "But I still won't let you go."
				},
				{
					"name": "Olivia",
					"text": "Why?"
				},
				{
					"name": "Will",
					"text": "Because the woman I love is crying in front of me."
				},
				{
					"name": "Olivia",
					"text": "Are you stupid? Did you lose your mind?"
				},
				{
					"text": "I muster the courage to snap back at him."
				},
				{
					"text": "But I can't summon the will to move away from him."
				},
				{
					"text": "His warm, gentle embrace..."
				},
				{
					"text": "I can't bring myself to leave it."
				},
				{
					"text": "He's holding me tenderly, lovingly."
				},
				{
					"text": "I can feel his resolve, his force, his scent, the beat of his heart against my back."
				},
				{
					"text": "His everything is trying to heal me."
				},
				{
					"text": "Now that I know how this feels, there is no way back."
				},
				{
					"name": "Olivia",
					"text": "What do you mean to accomplish by doing this?"
				},
				{
					"name": "Will",
					"text": "I won't let you go to that man anymore."
				},
				{
					"name": "Olivia",
					"text": "Impossible."
				},
				{
					"name": "Will",
					"text": "Don't go."
				},
				{
					"name": "Olivia",
					"text": "I can't."
				},
				{
					"name": "Will",
					"text": "I will save you."
				},
				{
					"name": "Olivia",
					"text": "You don't have that power, sadly."
				},
				{
					"name": "Will",
					"text": "No, I do. In fact, I am the only one who can do it."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Will holds me a little closer to himself."
				},
				{
					"text": "He envelops me with more force."
				},
				{
					"name": "Will",
					"text": "The only person who can make you shine on the stage..."
				},
				{
					"name": "Will",
					"text": "...is me. No one else in the world."
				},
				{
					"name": "Will",
					"text": "And for that we only need you and me."
				},
				{
					"name": "Will",
					"text": "We don't need this big theater."
				},
				{
					"name": "Will",
					"text": "Even if we don't have a stage..."
				},
				{
					"name": "Will",
					"text": "I'll make you the actress of my stories."
				},
				{
					"name": "Will",
					"text": "I will be the only man in the world to do it."
				},
				{
					"name": "Will",
					"text": "I'll make you an actress."
				},
				{
					"name": "Will",
					"text": "So, please..."
				},
				{
					"text": "I continue crying as I listen to his speech."
				},
				{
					"text": "Each of his words seem to permeate my body like a sweet perfume."
				},
				{
					"name": "Will",
					"text": "Don't go to that man anymore."
				},
				{
					"text": "I shake my head limply."
				},
				{
					"name": "Olivia",
					"text": "The actors of a troupe without a patron are the same as vagrants."
				},
				{
					"name": "Olivia",
					"text": "That's what the whole troupe will become, and so will you."
				},
				{
					"name": "Will",
					"text": "We were all tramps from the beginning. All of us but you."
				},
				{
					"name": "Olivia",
					"text": "Heh, I'd like to know what Kiki and the others think about that."
				},
				{
					"name": "Will",
					"text": "Don't go back to that manor again. Stay with me."
				},
				{
					"name": "Olivia",
					"text": "Will, I can't just..."
				},
				{
					"name": "Will",
					"text": "I won't let you go until you promise."
				},
				{
					"text": "He's holding me tightly."
				},
				{
					"text": "When did I become this indulgent?"
				},
				{
					"text": "Since when have I been this weak a person?"
				},
				{
					"text": "Reality always disappoints."
				},
				{
					"text": "I know that better than anyone, and yet..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Instead of shaking my head, I sigh."
				},
				{
					"name": "Olivia",
					"text": "Perhaps fools attract one another."
				},
				{
					"text": "I mutter with a self-deprecating chuckle."
				},
				{
					"text": "Will doesn't laugh."
				},
				{
					"name": "Will",
					"text": "Olivia."
				},
				{
					"text": "I..."
				},
				{
					"text": "...nod weakly."
				},
				{
					"name": "Olivia",
					"text": "All right. I promise."
				},
				{
					"text": "I place my hand over his."
				},
				{
					"text": "His hands are bigger and stronger than I realized."
				},
				{
					"name": "Will",
					"text": "Good girl."
				},
				{
					"text": "Our steps are the only sound in the quiet city street."
				},
				{
					"text": "I walk in front, holding Olivia's hand tight."
				},
				{
					"text": "She stays silent, clasping my hand in return."
				},
				{
					"text": "A stream of thoughts flow through my mind one after another."
				},
				{
					"text": "But there is something I notice in me. A feeling I've never had before."
				},
				{
					"text": "Back then, I couldn't protect Ed."
				},
				{
					"text": "This time, I will protect the people I love."
				},
				{
					"text": "I grip Olivia's hand with even more force."
				},
				{
					"name": "Olivia",
					"text": "No need to crush my hand, I'm not going anywhere."
				},
				{
					"name": "Will",
					"text": "Ah, sorry."
				},
				{
					"name": "Olivia",
					"text": "Nervous just from holding hands? You can be quite adorable sometimes."
				},
				{
					"name": "Will",
					"text": "Says the woman who was crying just now."
				},
				{
					"name": "Olivia",
					"text": "Mention that in front of anyone and I'll kill you."
				},
				{
					"name": "Will",
					"text": "As if I would."
				},
				{
					"name": "Olivia",
					"text": "I had to make sure, since you have as much tact as a cow."
				},
				{
					"name": "Will",
					"text": "That goes for you too."
				},
				{
					"name": "Olivia",
					"text": "Hah, indeed."
				},
				{
					"text": "Olivia bashes me verbally but doesn't let go of my hand."
				},
				{
					"name": "Olivia",
					"text": "Maybe we should tell everyone."
				},
				{
					"name": "Will",
					"text": "What do you mean?"
				},
				{
					"name": "Olivia",
					"text": "That we're going to lose Spencer's support."
				},
				{
					"name": "Olivia",
					"text": "I may not be able to pay for the living expenses I was giving them."
				},
				{
					"name": "Olivia",
					"text": "The Globe belongs to him as well."
				},
				{
					"name": "Will",
					"text": "Let's decide what to do tomorrow, when we're all together."
				},
				{
					"name": "Will",
					"text": "Today, everyone's waiting to enjoy a good time with you and make merry."
				},
				{
					"name": "Olivia",
					"text": "Yes."
				},
				{
					"name": "Will",
					"text": "I'll have to tell my father what's happening."
				},
				{
					"name": "Will",
					"text": "For now, you can live with us."
				},
				{
					"name": "Olivia",
					"text": "Yes, I'd like that."
				},
				{
					"name": "Will",
					"text": "Do you have any belongings to bring with you?"
				},
				{
					"name": "Olivia",
					"text": "I have few things. Most of what I need, I keep at the theater."
				},
				{
					"name": "Olivia",
					"text": "I only went to the manor to play the role of a decoration for him."
				},
				{
					"name": "Will",
					"text": "I see."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "We'll manage."
				},
				{
					"name": "Will",
					"text": "Our pub isn't going out of business any time soon. The troupe will be fine."
				},
				{
					"name": "Olivia",
					"text": "Yes, right."
				},
				{
					"text": "I can feel her tightening her hand around mine."
				},
				{
					"name": "Will",
					"text": "Are you nervous?"
				},
				{
					"name": "Olivia",
					"text": "Do you have a death wish? How dare you imply that. Don't lump me in with nervous wrecks like you."
				},
				{
					"name": "Will",
					"text": "That's the spirit."
				},
				{
					"text": "I smile at her sullen face."
				},
				{
					"name": "Olivia",
					"text": "Will."
				},
				{
					"name": "Will",
					"text": "Yeah?"
				},
				{
					"name": "Olivia",
					"text": "Thank you for accepting me."
				},
				{
					"name": "Olivia",
					"text": "It means a lot."
				},
				{
					"name": "Will",
					"text": "Okay, who are you, and what did you do with Olivia?"
				},
				{
					"name": "Olivia",
					"text": "Oh, will you shut up!"
				},
				{
					"text": "I squeeze her hand again."
				},
				{
					"text": "She returns it with a squeeze of her own."
				},
				{
					"text": "Slowly, we walk side by side through the night."
				},
				{
					"name": "Kiki",
					"text": "Whoa, took you long enough!"
				},
				{
					"name": "Rob",
					"text": "Do you enjoy making us wait?!"
				},
				{
					"name": "Will",
					"text": "Sorry, all! We thought it'd be good to prepare for tomorrow while we were at the theater."
				},
				{
					"name": "Olivia",
					"text": "I hope no one started drinking without us."
				},
				{
					"name": "Rob",
					"text": "Look at this lass! Who does she think we've been waiting for?!"
				},
				{
					"name": "Thomas",
					"text": "We didn't have a single drop. No one's brave enough to cross our leader."
				},
				{
					"name": "Olivia",
					"text": "Ahahah, good boys. Well done."
				},
				{
					"name": "Will",
					"text": "Okay, let me get us all some drinks."
				},
				{
					"name": "Olivia",
					"text": "I'll help."
				},
				{
					"text": "I pour ale into the cups, and Olivia gets the cups into people's hands."
				},
				{
					"text": "Eventually everyone has a cup of ale, except for my father."
				},
				{
					"text": "He's looks miffed, sitting in his corner holding a cup of water."
				},
				{
					"name": "Olivia",
					"text": "Everyone, you did most magnificently today. Good work. I think it was a very good performance, but there's always room for improvement."
				},
				{
					"name": "Olivia",
					"text": "We will rehearse before raising the curtains tomorrow, so don't drink too much."
				},
				{
					"name": "Kiki",
					"text": "Eep!"
				},
				{
					"name": "Olivia",
					"text": "Kiki, you became the troupe's main draw today. Hold your head high."
				},
				{
					"name": "Kiki",
					"text": "Me? The main draw?"
				},
				{
					"name": "Olivia",
					"text": "You were very popular too, Thomas. Brace yourself, the public still has a lot more of you to see."
				},
				{
					"name": "Thomas",
					"text": "Yes, ma'am!"
				},
				{
					"name": "Olivia",
					"text": "We have many challenges ahead of us, but..."
				},
				{
					"text": "Olivia trails off and looks at me."
				},
				{
					"name": "Olivia",
					"text": "We'll be chosen for the court performance no matter what. Isn't that right, Will?"
				},
				{
					"name": "Will",
					"text": "Naturally. My scripts are the best in the world."
				},
				{
					"name": "Olivia",
					"text": "Well said, William Shakespeare."
				},
				{
					"text": "A satisfied smile touches her lips as she turns back to the others."
				},
				{
					"text": "Looking at her profile, I see the usual Olivia."
				},
				{
					"text": "She's a great actress."
				},
				{
					"name": "Olivia",
					"text": "To this fleeting moment that will stay with us forever, like a midsummer night's dream..."
				},
				{
					"name": "Olivia",
					"text": "Cheers, my friends."
				},
				{
					"name": "Kiki&Thomas",
					"text": "Cheers!"
				},
				{
					"name": "Rob",
					"text": "Heheh. Boss, let's do a little toast of our own."
				},
				{
					"name": "Father",
					"text": "Toasting with water would be the saddest thing."
				},
				{
					"name": "Rob",
					"text": "Who cares? Will's talent is finally blossoming. No happier occasion than this."
				},
				{
					"name": "Father",
					"text": "Yes, you are right indeed."
				},
				{
					"text": "Rob raises his cup."
				},
				{
					"name": "Rob",
					"text": "To the ones we lost. To Ed."
				},
				{
					"name": "Father",
					"text": "To friendship everlasting."
				},
				{
					"text": "Dad and Rob clink their cups together."
				},
				{
					"text": "Olivia's eyes meet with mine."
				},
				{
					"text": "She raises her cup as well."
				},
				{
					"text": "I follow her lead and lift mine."
				},
				{
					"text": "We share a personal toast from behind the bar."
				},
				{
					"text": "We eat, drink, and make merry with the rest of the troupe members as the night rolls on."
				},
				{
					"text": "When it's time to go, we see everyone off until it's just me, Olivia, Rob, and Dad left in the pub."
				},
				{
					"name": "Father",
					"text": "Well then, it's about time for this old dog to hit the hay."
				},
				{
					"name": "Father",
					"text": "You're not going home yet, Rob?"
				},
				{
					"name": "Rob",
					"text": "I'll be on my way after I finish this drink."
				},
				{
					"name": "Father",
					"text": "All right. See you all on the morrow, then."
				},
				{
					"name": "Will",
					"text": "Dad."
				},
				{
					"name": "Father",
					"text": "How may I help you, Lord Playwright?"
				},
				{
					"name": "Will",
					"text": "I need to tell you something."
				},
				{
					"name": "Father",
					"text": "Huh? What is it?"
				},
				{
					"text": "Dad looks up in my direction."
				},
				{
					"text": "I let my gaze linger over the counter for a moment."
				},
				{
					"name": "Rob",
					"text": "Huh? Family matter? Want me to leave so you can talk?"
				},
				{
					"text": "I exchange glances with Olivia."
				},
				{
					"text": "She shakes her head firmly."
				},
				{
					"name": "Olivia",
					"text": "You're a peddler who visits the manor frequently enough. I'm sure you'd come to know sooner or later, so it may as well be now."
				},
				{
					"name": "Rob",
					"text": "Mm?"
				},
				{
					"name": "Will",
					"text": "All right."
				},
				{
					"text": "I step out from behind the counter and face both Rob and my dad."
				},
				{
					"name": "Will",
					"text": "I'd like Olivia to live here from now on."
				},
				{
					"name": "Father",
					"text": "Huh?"
				},
				{
					"name": "Rob",
					"text": "Why?"
				},
				{
					"name": "Will",
					"text": "Err, why, you ask?"
				},
				{
					"name": "Rob",
					"text": "I mean, aren't you Spencer's fiancee?"
				},
				{
					"name": "Rob",
					"text": "Don't you have to go back to him?"
				},
				{
					"name": "Olivia",
					"text": "There is no engagement between us."
				},
				{
					"name": "Olivia",
					"text": "External pressures and expectations made everyone assume so, and it's true that's what he wants from me, but there is nothing set in stone."
				},
				{
					"name": "Rob",
					"text": "Wait, what? What do you mean?"
				},
				{
					"name": "Father",
					"text": "Olivia, are you truly turning down a rich man to settle down for this lousy cook?"
				},
				{
					"name": "Rob",
					"text": "Hahahah, you're gonna regret it later!"
				},
				{
					"name": "Will",
					"text": "That's not what this is about, Dad."
				},
				{
					"name": "Olivia",
					"text": "I will never regret it. That, I can assure you."
				},
				{
					"name": "Rob",
					"text": "Oh..."
				},
				{
					"text": "I stare at Olivia's profile in disbelief."
				},
				{
					"text": "She gives me a small smile then turns back to my dad and Rob."
				},
				{
					"text": "The two of them look from one to the other of us."
				},
				{
					"text": "Olivia blows out a small sigh, and speaks."
				},
				{
					"name": "Olivia",
					"text": "I was bought too."
				},
				{
					"text": "The two of them look at her."
				},
				{
					"text": "I also turn to her."
				},
				{
					"name": "Will",
					"text": "Bought? What do you mean?"
				},
				{
					"name": "Olivia",
					"text": "I wasn't born in this country."
				},
				{
					"name": "Rob",
					"text": "So you're from the island out west, eh?"
				},
				{
					"text": "Olivia nods."
				},
				{
					"name": "Olivia",
					"text": "I was brought here, and my siblings were taken to the New World to work as slaves. I was auctioned off on account of my looks."
				},
				{
					"name": "Olivia",
					"text": "A story as old as time, is it not?"
				},
				{
					"name": "Will",
					"text": "You..."
				},
				{
					"name": "Will",
					"text": "...were a slave too?"
				},
				{
					"name": "Olivia",
					"text": "Yes."
				},
				{
					"text": "Rob and Dad simply look up at her in silence."
				},
				{
					"name": "Rob",
					"text": "Why?"
				},
				{
					"name": "Olivia",
					"text": "Because of where I was born, that's all."
				},
				{
					"name": "Olivia",
					"text": "What other reason do \"civilized\" people need to make slaves out of others?"
				},
				{
					"name": "Olivia",
					"text": "Ah, perhaps trying to steal a deer would have been a better reason?"
				},
				{
					"text": "Olivia says, quirking up a smile."
				},
				{
					"name": "Will",
					"text": "That's an exception."
				},
				{
					"name": "Olivia",
					"text": "Yes, that's right. I'll have you know that I wouldn't have failed; I never did. Failing was the difference between life and death."
				},
				{
					"name": "Olivia",
					"text": "Just as people are born into noble houses on no merit of their own, people are also born as slaves through no fault of their own."
				},
				{
					"name": "Olivia",
					"text": "I did what I needed to stay alive. Whatever job, no matter what it was."
				},
				{
					"name": "Olivia",
					"text": "And when I had no job, I simply stole from others."
				},
				{
					"name": "Olivia",
					"text": "For better of worse, I never had to kill a person, but I believe I would have done so should the situation have called for it."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "I am speechless after hearing about Olivia's life."
				},
				{
					"text": "But at the same time, a lot of things make sense now."
				},
				{
					"text": "Why her manner of speech is different from all the other nobles."
				},
				{
					"text": "Why a noble like her would know how to cook and clean."
				},
				{
					"text": "Ed and Rob picked up on all that as soon as she started helping in the pub."
				},
				{
					"text": "Olivia was always different from the image I had of the aristocracy."
				},
				{
					"text": "I feel like all those incongruities are coming together now."
				},
				{
					"text": "So she wasn't born a noble."
				},
				{
					"text": "No, even now she doesn't truly have the freedom of the ruling classes."
				},
				{
					"name": "Olivia",
					"text": "When I was ripped away from my family and auctioned off, Spencer was the one who bid on me."
				},
				{
					"name": "Father",
					"text": "Auctioned off? Then where does all this fiancee talk come from?"
				},
				{
					"name": "Olivia",
					"text": "He said he wanted to marry me. Even though I'm his slave? That man is strange, not normal at all."
				},
				{
					"name": "Rob",
					"text": "Yeah, I can see that."
				},
				{
					"name": "Father",
					"text": "Is that Spencer man such a strange noble?"
				},
				{
					"name": "Will",
					"text": "He's a deviant. I can never see any rhyme or reason to what he says or does."
				},
				{
					"text": "Olivia nods in agreement, and so does Rob as he downs his cup of ale."
				},
				{
					"name": "Olivia",
					"text": "Because of where I come from..."
				},
				{
					"name": "Olivia",
					"text": "My situation resembles yours, in a sense."
				},
				{
					"name": "Rob",
					"text": "Yes, that island..."
				},
				{
					"text": "I hear that Catholics account for more than eighty percent of the population."
				},
				{
					"name": "Olivia",
					"text": "During the Ulster rebellion 16 years ago, my siblings and I were imprisoned and sent to this country."
				},
				{
					"name": "Olivia",
					"text": "Back when we were still in our own country, almost starving to death, a kind man in scarlet robes took notice and fed us from his bread."
				},
				{
					"name": "Father",
					"text": "Scarlet robes?"
				},
				{
					"name": "Rob",
					"text": "A cardinal of the church, you mean?"
				},
				{
					"text": "A meaningful smiles crosses her face."
				},
				{
					"name": "Olivia",
					"text": "We thought so at the time. We were overjoyed, thinking that believers truly extended a helping hand to others."
				},
				{
					"name": "Olivia",
					"text": "But we realized as soon as we came closer—the man's mantle stank."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "It was dyed red with blood. By the time we realized he was a slave dealer, it was already too late."
				},
				{
					"name": "Olivia",
					"text": "My sister and I were sold off to different houses. They would use me as they saw fit, and I would escape, only to repeat that cycle until I got to Tenbridge."
				},
				{
					"name": "Olivia",
					"text": "The day I was bought by Spencer and told I was going to be his slave, I didn't have the energy to resist my rotten fortune anymore."
				},
				{
					"name": "Olivia",
					"text": "Until I was taken to a court performance by Spencer and saw the resplendent beauty of theater with my own two eyes. Until then, my world was gray, quite literally."
				},
				{
					"text": "No one dares say a word."
				},
				{
					"text": "Olivia continues talking."
				},
				{
					"name": "Olivia",
					"text": "So, to clarify. I am not his fiancee."
				},
				{
					"name": "Olivia",
					"text": "But it is true that I used that as bait to get him to become the patron of my acting troupe."
				},
				{
					"name": "Father",
					"text": "..."
				},
				{
					"name": "Rob",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "I did that to keep this troupe doing."
				},
				{
					"text": "She falls silent, having finished her tale."
				},
				{
					"name": "Rob",
					"text": "Can I ask a question? Why are you going so far for this? You're the owner of the troupe, right?"
				},
				{
					"name": "Rob",
					"text": "But it almost sounds as if you..."
				},
				{
					"text": "We've finally come to the heart of the matter."
				},
				{
					"text": "Until now, we've kept the fact that she acts on stage hidden."
				},
				{
					"text": "The idea of a woman dressing as a man is looked down upon and decried even among Catholics."
				},
				{
					"text": "I would have liked to sidestep this topic if at all possible."
				},
				{
					"text": "But..."
				},
				{
					"name": "Olivia",
					"text": "I..."
				},
				{
					"name": "Olivia",
					"text": "...stand on the stage, as a man."
				},
				{
					"text": "Olivia tells them the truth, resolute and decisive."
				},
				{
					"name": "Olivia",
					"text": "I think it's wrong that a woman can't act on stage. That's why my goal is to be chosen for a court performance."
				},
				{
					"text": "Rob squints at her."
				},
				{
					"name": "Rob",
					"text": "What do you mean?"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "I haven't heard about this from her either."
				},
				{
					"name": "Olivia",
					"text": "If we are selected and our abilities are recognized, we can become the Lord Chamberlain's Men."
				},
				{
					"name": "Olivia",
					"text": "The troupe closest to the Queen's ear."
				},
				{
					"name": "Olivia",
					"text": "And being near the only person with the power to change the law means we can—"
				},
				{
					"name": "Father",
					"text": "You are aiming to endear yourself to the theater loving Queen, then."
				},
				{
					"text": "Olivia nods."
				},
				{
					"name": "Rob",
					"text": "That is one tough battle you're fighting, lass."
				},
				{
					"name": "Olivia",
					"text": "But that's what gives my life meaning."
				},
				{
					"name": "Olivia",
					"text": "It's an injustice that a woman can't stand on the stage that bestows dreams and hopes onto people's lives. Why do we decide who can act or not based on something as arbitrary as gender?"
				},
				{
					"text": "Rob and dad simply stare at her in silence."
				},
				{
					"name": "Olivia",
					"text": "The dazzling world of theater gave my drab life color."
				},
				{
					"name": "Olivia",
					"text": "I can't even remember what the play that inspired me was about anymore. I just cried at the end, not even knowing why."
				},
				{
					"name": "Olivia",
					"text": "From that moment on, I wanted to stand on the stage too. I had no choice but to take back my own life."
				},
				{
					"name": "Olivia",
					"text": "That's why I desperately searched for a way to do so, and brought this troupe together."
				},
				{
					"text": "Now she turns to me."
				},
				{
					"name": "Olivia",
					"text": "And finally, I obtained the talent I needed from Will's hand."
				},
				{
					"name": "Olivia",
					"text": "For me, acting in this troupe is what gives my life hope."
				},
				{
					"name": "Rob",
					"text": "..."
				},
				{
					"name": "Father",
					"text": "I see now."
				},
				{
					"text": "Silence fills the room."
				},
				{
					"text": "A long, heavy silence."
				},
				{
					"text": "I imagine a young Olivia in my mind."
				},
				{
					"text": "Hearing her talk, I understood immediately that she has many more bitter memories locked away inside of her."
				},
				{
					"text": "Compared to her, I certainly am a pampered, blessed boy."
				},
				{
					"text": "I pitied myself and thought of myself as the center of the world. It was all about me and not getting what I perceived as my right."
				},
				{
					"text": "But..."
				},
				{
					"text": "That was before I met her."
				},
				{
					"name": "Will",
					"text": "Now..."
				},
				{
					"name": "Will",
					"text": "This troupe isn't just yours. Kiki, Thomas, and everyone else are desperate to improve."
				},
				{
					"name": "Will",
					"text": "I want to do everything I can for this troupe as well."
				},
				{
					"name": "Will",
					"text": "Now that I know about all the sacrifices you had to make."
				},
				{
					"name": "Will",
					"text": "I need to do something about it."
				},
				{
					"name": "Father",
					"text": "So you want to rescue her from her predicament and let her live with us?"
				},
				{
					"name": "Will",
					"text": "Yes."
				},
				{
					"name": "Father",
					"text": "I see."
				},
				{
					"name": "Rob",
					"text": "But didn't you just finish your first performance today?"
				},
				{
					"name": "Rob",
					"text": "What happens now?"
				},
				{
					"name": "Will",
					"text": "Well..."
				},
				{
					"name": "Will",
					"text": "I figured I'd cross those bridges as I come to them."
				},
				{
					"name": "Rob",
					"text": "Hah! You're going off the cuff, eh?"
				},
				{
					"name": "Olivia",
					"text": "The Globe is Spencer's property, but even if we're kicked out tomorrow, I don't think he would find a new tenant anytime soon."
				},
				{
					"name": "Olivia",
					"text": "Thankfully, our premiere was well received, and I think we'll have full seats going forward."
				},
				{
					"name": "Olivia",
					"text": "Spencer may be a noble, but his rank is only that of a landed gentry. And he needs funds to prepare for his move to the New World."
				},
				{
					"name": "Olivia",
					"text": "If we use the admission fees to pay him rent, I think he'll let us rent the place like a business."
				},
				{
					"name": "Olivia",
					"text": "When it comes to money, that's the only matter where he actually makes sensible decisions."
				},
				{
					"name": "Rob",
					"text": "He has a rather gaudy life to be part of the gentry."
				},
				{
					"name": "Olivia",
					"text": "Perhaps he has both an eye for aesthetics and another one for business."
				},
				{
					"name": "Olivia",
					"text": "You can take what comes out of his mouth at face value. He is no schemer, at the very least."
				},
				{
					"name": "Rob",
					"text": "I see. So as someone who sells to him, that must make me a purveyor of the finest goods, yes?"
				},
				{
					"name": "Olivia",
					"text": "I don't know about that."
				},
				{
					"name": "Father",
					"text": "So, Will, what is it that you wanted to ask me about?"
				},
				{
					"name": "Will",
					"text": "Huh? I wanted your permission to let Olivia live here with us for now."
				},
				{
					"text": "My dad looks up at me while I trip over my words."
				},
				{
					"text": "Even if there's no light in his eyes, I still feel like he can see right through me."
				},
				{
					"name": "Will",
					"text": "I wanted to know if you're okay with it."
				},
				{
					"name": "Father",
					"text": "So what if I were to say no? You'd give up?"
				},
				{
					"name": "Will",
					"text": "...No."
				},
				{
					"name": "Father",
					"text": "After listening to her story, I don't think Olivia's a woman who you can approach without having a made up mind and an iron will."
				},
				{
					"name": "Father",
					"text": "Isn't that right, Rob?"
				},
				{
					"name": "Rob",
					"text": "Well, she is a tough woman, that's for sure."
				},
				{
					"name": "Olivia",
					"text": "This is not about my personality, is it?"
				},
				{
					"text": "Olivia interjects, but my dad keeps his eyes on me."
				},
				{
					"name": "Father",
					"text": "Son, you won't take Olivia from that noble by fretting over every single thing."
				},
				{
					"name": "Father",
					"text": "This isn't like stealing a deer."
				},
				{
					"name": "Olivia",
					"text": "Heheh. You may be right, good sir."
				},
				{
					"name": "Will",
					"text": "All right."
				},
				{
					"text": "Dad's absolutely right."
				},
				{
					"text": "I take a deep breath."
				},
				{
					"name": "Will",
					"text": "Olivia will be living in our house from now on. I'm sorry if that's a bother for you, but I hope you'll be understanding."
				},
				{
					"name": "Father",
					"text": "Heard you loud a clear."
				},
				{
					"name": "Rob",
					"text": "Ah, to be young."
				},
				{
					"text": "I turn to Olivia."
				},
				{
					"name": "Will",
					"text": "You can sleep in my room today. I'll sleep on the floor."
				},
				{
					"text": "Olivia nods in response."
				},
				{
					"name": "Will",
					"text": "I will go and negotiate with Spencer, so..."
				},
				{
					"name": "Will",
					"text": "Tell me the costs we'll incur to keep the troupe going and our projected income."
				},
				{
					"name": "Will",
					"text": "If we need new works to keep afloat, I'll write as much as we need."
				},
				{
					"name": "Olivia",
					"text": "But I should be the one to talk to him."
				},
				{
					"text": "I hold up my hand in front of her."
				},
				{
					"name": "Will",
					"text": "This is my job. You don't need to see that man ever again."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Rob",
					"text": "Boss, our little lad's done some growing up, eh?"
				},
				{
					"name": "Father",
					"text": "Mhm."
				},
				{
					"name": "Rob",
					"text": "Shall we toast to that?"
				},
				{
					"name": "Father",
					"text": "With water once more, I suppose."
				},
				{
					"name": "Rob",
					"text": "Who cares about what's in the cup? Come on now."
				},
				{
					"name": "Father",
					"text": "Yeah, you're right."
				},
				{
					"name": "Olivia",
					"text": "We have some space on the first floor, don't you think? We could pack more people in there if we get more seats."
				},
				{
					"name": "Olivia",
					"text": "We sold out of meals today, so let's prepare more for tomorrow. If we make as much as we can, we could earn about thirty percent more, right?"
				},
				{
					"name": "Will",
					"text": "Is that all of the proceeds?"
				},
				{
					"name": "Olivia",
					"text": "Yes."
				},
				{
					"name": "Will",
					"text": "How about the expenses?"
				},
				{
					"name": "Olivia",
					"text": "I give the troupe members a weekly salary. This is the minimum we need."
				},
				{
					"text": "Olivia writes down the amount she's giving each person."
				},
				{
					"name": "Will",
					"text": "Hey, why didn't I ever get money like this?"
				},
				{
					"name": "Olivia",
					"text": "I pay you in kind, don't I? How much do you think I contribute to this pub's sales? You bold-faced, greedy fox."
				},
				{
					"name": "Will",
					"text": "I know, I'm just kidding."
				},
				{
					"name": "Will",
					"text": "How much should we estimate for the Globe's rent?"
				},
				{
					"name": "Olivia",
					"text": "Mm, for a theater that size..."
				},
				{
					"text": "Olivia writes down the amount."
				},
				{
					"name": "Will",
					"text": "Are you serious?"
				},
				{
					"name": "Olivia",
					"text": "The place can hold two hundred times the capacity of this pub. It's just how it is."
				},
				{
					"name": "Olivia",
					"text": "And..."
				},
				{
					"text": "Olivia writes another amount of money below that."
				},
				{
					"name": "Will",
					"text": "What's that?"
				},
				{
					"name": "Olivia",
					"text": "Payment to get out of bondage. Slaves have to pay their owners for their freedom."
				},
				{
					"name": "Will",
					"text": "Owner..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Her mouth becomes a hard line, and she hangs her head."
				},
				{
					"name": "Will",
					"text": "Okay, I'll pay. I'll negotiate it so we can pay in installments."
				},
				{
					"text": "We finish calculating all the expenses."
				},
				{
					"text": "And considering our current admission fees..."
				},
				{
					"name": "Will",
					"text": "We need a full house every day, huh?"
				},
				{
					"name": "Olivia",
					"text": "Yes, we do."
				},
				{
					"name": "Will",
					"text": "No holidays for us, it seems."
				},
				{
					"name": "Olivia",
					"text": "That was the plan from the start, but what I'm worried about is audience fatigue setting in."
				},
				{
					"name": "Olivia",
					"text": "We may have the play down, but it's still only one play."
				},
				{
					"name": "Olivia",
					"text": "It may be difficult to keep pulling in an audience every day for a whole month with just the one."
				},
				{
					"name": "Will",
					"text": "Let's begin rehearsing the tragedy's first draft as as soon as we can. How much time do you want to spend rehearsing Midsummer Night's Dream before the performance tomorrow?"
				},
				{
					"name": "Olivia",
					"text": "Hmm. I'd like to take about an hour for it, but I don't think we'll need as much time after that."
				},
				{
					"name": "Will",
					"text": "Rather than keep tweaking a work to perfection, I want to get the audience excited and give them something new."
				},
				{
					"name": "Olivia",
					"text": "But I really want at least an hour for it tomorrow. We can rehearse the new play as much as you want after that."
				},
				{
					"name": "Will",
					"text": "How much time do you think it'll take to have Hamlet in a good place? All five acts, I mean."
				},
				{
					"name": "Olivia",
					"text": "To be honest, it should take about a month. But we obviously don't have that much time."
				},
				{
					"name": "Will",
					"text": "Two weeks. No, one."
				},
				{
					"name": "Olivia",
					"text": "Ten days. Let's spend the first five days on each act, and the other five running through the whole thing each day."
				},
				{
					"name": "Olivia",
					"text": "We'll be rushing, but we hardly have a choice."
				},
				{
					"name": "Will",
					"text": "But we could maybe announce we're presenting a new play on the seventh day, and premiere it on the eighth if we feel the troupe is ready for it."
				},
				{
					"name": "Olivia",
					"text": "That is, if we strike upon a miracle every single day and everything goes well. We shouldn't try to push it any sooner than ten days."
				},
				{
					"name": "Olivia",
					"text": "Remember, we're gonna be practicing while also performing every single day."
				},
				{
					"name": "Will",
					"text": "...Right."
				},
				{
					"text": "Ten days from now, we'll add Hamlet to our repertoire."
				},
				{
					"name": "Will",
					"text": "Even if we have two plays to perform, we can't have two showings every day, can we?"
				},
				{
					"name": "Olivia",
					"text": "Not likely. It would be night by the time we started the second showing."
				},
				{
					"name": "Will",
					"text": "How about we start at noon?"
				},
				{
					"name": "Olivia",
					"text": "Then we'll be unable to practice new plays."
				},
				{
					"name": "Will",
					"text": "Mmh..."
				},
				{
					"name": "Olivia",
					"text": "And if we have to perform five acts every single day, it'll wear out the actors' focus."
				},
				{
					"name": "Olivia",
					"text": "You realized that today too, didn't you?"
				},
				{
					"name": "Will",
					"text": "So, for the next ten days, we'll continue with A Midsummer Night's Dream."
				},
				{
					"name": "Will",
					"text": "And then we premiere Hamlet. Do we want to add another one before the court selection?"
				},
				{
					"name": "Olivia",
					"text": "We'll need a new play by then."
				},
				{
					"name": "Olivia",
					"text": "So after than tenth day, we need to start rehearsing a new play in the mornings while performing Hamlet in the evenings."
				},
				{
					"name": "Olivia",
					"text": "Once we have Hamlet in our repertoire, we could alternate between it and Midsummer Night's Dream."
				},
				{
					"name": "Olivia",
					"text": "If we can get a new play out every ten days, we'll definitely get the audience to come back to the theater every ten days too, at the very least."
				},
				{
					"name": "Will",
					"text": "I see. In that case..."
				},
				{
					"name": "Will",
					"text": "We'll be able to pay."
				},
				{
					"text": "A smile touches her lips."
				},
				{
					"name": "Olivia",
					"text": "Can you write a new play after this?"
				},
				{
					"name": "Will",
					"text": "I will. I must."
				},
				{
					"name": "Olivia",
					"text": "Yes."
				},
				{
					"text": "Silence falls over the room."
				},
				{
					"text": "Olivia's looking out at the moon outside the window."
				},
				{
					"text": "The shine of the moonlight makes her porcelain skin glow with an almost magical sheen."
				},
				{
					"text": "I feel something inside my chest swell as I watch her."
				},
				{
					"text": "Staying here alone with her isn't good for my sanity."
				},
				{
					"text": "I feel like some kind of beast inside me is struggling to break loose."
				},
				{
					"text": "I get up and shake my head."
				},
				{
					"name": "Olivia",
					"text": "What's wrong?"
				},
				{
					"name": "Will",
					"text": "I'll go talk to Spencer."
				},
				{
					"name": "Olivia",
					"text": "Right now?"
				},
				{
					"name": "Will",
					"text": "Today is the last day this troupe has a patron."
				},
				{
					"name": "Will",
					"text": "If we don't do things properly, nothing will change."
				},
				{
					"name": "Will",
					"text": "I'll be back."
				},
				{
					"name": "Olivia",
					"text": "You're going alone?"
				},
				{
					"name": "Will",
					"text": "Yes."
				},
				{
					"name": "Will",
					"text": "Spencer and I have to reach a settlement regarding your situation."
				},
				{
					"text": "Her expression darkens."
				},
				{
					"name": "Olivia",
					"text": "Okay."
				},
				{
					"name": "Will",
					"text": "It'll be fine."
				},
				{
					"name": "Olivia",
					"text": "I'll wait up for you."
				},
				{
					"text": "I nod, take one last look at the balance figures, and leave the room."
				},
				{
					"text": "The huge manor looms over me as I stand in the vast patch of land that belongs to the estate."
				},
				{
					"text": "I take a deep breath as I look over its gigantic, opulent presence."
				},
				{
					"text": "I need to face Spencer."
				},
				{
					"text": "I look back on our two previous encounters."
				},
				{
					"text": "Has he ever really listened to anything I said? It always feels like he's talking at me, instead of to me."
				},
				{
					"text": "Somehow, it doesn't even feel like we're speaking the same language."
				},
				{
					"text": "But I must do this."
				},
				{
					"text": "For Olivia."
				},
				{
					"text": "After bracing myself and taking a deep breath, I knock on the door."
				},
				{
					"text": "An elderly butler opens the door, and I inform him that I've come to speak to Spencer about Olivia."
				},
				{
					"text": "After giving me a glance over, he ushers me inside."
				},
				{
					"text": "This is the hall I was brought to when I tried to steal the deer."
				},
				{
					"text": "The butler seems to remember me."
				},
				{
					"text": "Which means he remembers that day when I became Olivia's slave."
				},
				{
					"text": "The butler goes up a big flight of stairs and knocks on one of the many doors."
				},
				{
					"text": "He says something to the person behind the door, then comes down the stairs again."
				},
				{
					"text": "He informs me that Spencer will be with me shortly, then wanders off somewhere."
				},
				{
					"text": "My palms are sweaty."
				},
				{
					"text": "After a while, the door the butler knocked on opens, and Spencer comes out of the room."
				},
				{
					"text": "He comes down the stairs with relaxed, light steps."
				},
				{
					"name": "Spencer",
					"text": "Hi, chico."
				},
				{
					"name": "Will",
					"text": "Good evening."
				},
				{
					"name": "Spencer",
					"text": "I am told you wish to talk about my little Olive? What is it? Did you get fed up of being her esclavo?"
				},
				{
					"name": "Will",
					"text": "No."
				},
				{
					"name": "Will",
					"text": "From today, Olivia is no longer your slave."
				},
				{
					"name": "Spencer",
					"text": "Hmm?"
				},
				{
					"name": "Will",
					"text": "If you want money to settle this, I'll pay it. I also want to rent the Globe theater."
				},
				{
					"name": "Will",
					"text": "Since Olivia won't be your slave anymore, it wouldn't make sense for you to patron the troupe. That's why I've come to rent it."
				},
				{
					"name": "Spencer",
					"text": "You mean to pay for her, you mean? You are Olivia's esclavo, are you not?"
				},
				{
					"name": "Spencer",
					"text": "What is the meaning of this? Are you making an esclava out of her now?"
				},
				{
					"text": "I shake my head."
				},
				{
					"name": "Will",
					"text": "Olivia will be a free woman from now on. She won't be anyone's property anymore."
				},
				{
					"name": "Spencer",
					"text": "Hmm, so you will foot the costo for that?"
				},
				{
					"name": "Spencer",
					"text": "There is no chica as beautiful as Olive. She's quite expensive."
				},
				{
					"name": "Will",
					"text": "State your price."
				},
				{
					"name": "Spencer",
					"text": "Hm..."
				},
				{
					"text": "The price Spencer tells me is the exact amount Olivia wrote down."
				},
				{
					"text": "Spencer's eyes widen in surprise as I nod and accept the offer."
				},
				{
					"name": "Will",
					"text": "I'll pay. I just need to pay in instalments."
				},
				{
					"name": "Spencer",
					"text": "Instalments?"
				},
				{
					"name": "Will",
					"text": "I'll pay for it together with the Globe's monthly rent. You can attach an interest rate to the payments if you want."
				},
				{
					"name": "Will",
					"text": "You can't really rent that big theater to anyone but people making plays, can you?"
				},
				{
					"name": "Spencer",
					"text": "You are correcto. Yes, I would not mind renting it to you, Shakespeare."
				},
				{
					"name": "Spencer",
					"text": "But can you pay? You're not coming to me without a plan, right?"
				},
				{
					"name": "Will",
					"text": "The premiere of the play I wrote for the troupe was today. We filled the whole theater and the sales were good."
				},
				{
					"name": "Spencer",
					"text": "Felicitaciones. Good for you."
				},
				{
					"name": "Will",
					"text": "I will write two more plays this month. If we keep the seats full and attract the audience back every ten days, we'll be able to pay you."
				},
				{
					"name": "Spencer",
					"text": "And after that?"
				},
				{
					"name": "Will",
					"text": "Our troupe..."
				},
				{
					"name": "Will",
					"text": "...will be selected for the court performance. After that we'll have a new patron and pay off the remainder of our debts."
				},
				{
					"name": "Spencer",
					"text": "I see. You aim for the Lord Chamberlain to shoulder the cost."
				},
				{
					"text": "Spencer nods to himself."
				},
				{
					"name": "Spencer",
					"text": "Good, chicos must be ambitious. I don't dislike your enthusiasm."
				},
				{
					"name": "Spencer",
					"text": "I find such lofty aspirations very calientes indeed in people with the capacity. As for you..."
				},
				{
					"text": "Spencer looks me up and down slowly, sizing me up."
				},
				{
					"name": "Spencer",
					"text": "Yes, you are a chico with the talent to meet your goals. I think you will achieve it."
				},
				{
					"name": "Will",
					"text": "...Thanks."
				},
				{
					"name": "Spencer",
					"text": "Okay, we have a trato. Do with Olive as you please. She is tuya now."
				},
				{
					"name": "Will",
					"text": "What?"
				},
				{
					"name": "Spencer",
					"text": "Huh? Isn't that what you came here for?"
				},
				{
					"name": "Will",
					"text": "Yeah, but..."
				},
				{
					"name": "Will",
					"text": "I heard that you asked Olivia to marry you, so..."
				},
				{
					"text": "Spencer looks genuinely curious about my confusion."
				},
				{
					"name": "Will",
					"text": "You would let go of her that easily?"
				},
				{
					"name": "Spencer",
					"text": "No problema. There's no problem at all. Tell Olive she is free to come back to me if she ever needs help."
				},
				{
					"name": "Spencer",
					"text": "She can become my esclava once again whenever she likes. I look after my esclavos, that's my personal policy."
				},
				{
					"name": "Will",
					"text": "She's not a slave."
				},
				{
					"name": "Spencer",
					"text": "Olive became my esclava out of her own volition. It is her choice, not to be made by you."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Spencer",
					"text": "But I do not dislike change. Me gusta, to be honest."
				},
				{
					"name": "Spencer",
					"text": "Well, do try your best, playwright. Let us hope it goes well for you."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Spencer",
					"text": "And one more thing. I will need a guarantee in the case your plan doesn't go, well, as planned."
				},
				{
					"name": "Will",
					"text": "What?"
				},
				{
					"name": "Spencer",
					"text": "A garantia. Collateral."
				},
				{
					"name": "Will",
					"text": "What do you want?"
				},
				{
					"name": "Spencer",
					"text": "You shall become my esclavo. Oh, how I would love for you to wear that Hermia costume for me at night."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Spencer",
					"text": "Not a bad deal, if I do say so myself."
				},
				{
					"name": "Will",
					"text": "...All right."
				},
				{
					"name": "Spencer",
					"text": "*Shudder* Hoooh! Yes, what a great deal. Yes, me encanta!"
				},
				{
					"name": "Will",
					"text": "...Good for you."
				},
				{
					"name": "Spencer",
					"text": "So your new obra will be unveiled in ten days, yes? May I go see it?"
				},
				{
					"name": "Will",
					"text": "Do as you like."
				},
				{
					"name": "Will",
					"text": "I don't have the luxury of choosing my clients."
				},
				{
					"name": "Spencer",
					"text": "Ah, how lindo. That open hostility, that fuego in your soul. That erect determination, haah..."
				},
				{
					"name": "Spencer",
					"text": "I can't wait to see the fruits of your trabajo. Would you like to stay the night? You are always welcome in this manor of mine with open arms, and legs."
				},
				{
					"name": "Will",
					"text": "No, thank you. Olivia's waiting for me."
				},
				{
					"name": "Spencer",
					"text": "You and Olive?! Ah, what a match made in los cielos! Oh, I do want to see... May I?"
				},
				{
					"name": "Will",
					"text": "No. See you at the theatre. And don't come near the stage."
				},
				{
					"name": "Spencer",
					"text": "Ah, the tragedy, it is so very triste. Oh no!"
				},
				{
					"text": "I leave the manor with Spencer's moans echoing behind me."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "The talks went as well as they could have gone."
				},
				{
					"text": "I'm stunned at how smoothly it went, actually."
				},
				{
					"text": "Now all I have to do is write."
				},
				{
					"text": "But..."
				},
				{
					"text": "The problem is I have no material."
				},
				{
					"text": "To be honest, I have nothing in my head left that could surpass Hamlet."
				},
				{
					"text": "As I wrote the play, I felt the boundary between Hamlet and myself crumble."
				},
				{
					"text": "If I hadn't written it down, perhaps I would have ended up consumed up by my own vengeful thoughts."
				},
				{
					"text": "The act of writing itself can be a form of salvation for the writer."
				},
				{
					"text": "Now that I've finished writing it, I can look back and realize that's the truth."
				},
				{
					"text": "That's why I'm able to keep myself in check as I work to improve the troupe so people can see and hear what I have to say."
				},
				{
					"text": "All of my hatred for Marlowe..."
				},
				{
					"text": "The sense of loss and impotence..."
				},
				{
					"text": "I mixed it all together in my internal melting pot, and Hamlet came out."
				},
				{
					"text": "If I want to paint it in a positive light, I could say that I've cleaned out all of those emotions."
				},
				{
					"text": "But if I want to be negative, I would say that I'm completely empty and out of ideas."
				},
				{
					"text": "I've come to understand the important points and beats a play must hit upon."
				},
				{
					"text": "And now I'm familiar with the movements of the actors bringing these characters to life on stage."
				},
				{
					"text": "I feel that my technique has improved significantly."
				},
				{
					"text": "I am, by all means, a better writer now than I was a month ago."
				},
				{
					"text": "Yet now I wonder, what should I even write?"
				},
				{
					"text": "What can I write?"
				},
				{
					"text": "What would make Olivia happy?"
				},
				{
					"name": "Olivia",
					"text": "Will!"
				},
				{
					"text": "As soon as I open the door, Olivia leaps out of the bed and onto me."
				},
				{
					"text": "I can see the worry clear as day in her eyes."
				},
				{
					"text": "I smile reassuringly at her."
				},
				{
					"name": "Will",
					"text": "It's fine. Spencer accepted our conditions."
				},
				{
					"name": "Will",
					"text": "All we have to do is pay the money we promised."
				},
				{
					"name": "Will",
					"text": "It'll be all right. We just have to focus on the plays."
				},
				{
					"text": "Olivia heaves a sigh of relief."
				},
				{
					"name": "Olivia",
					"text": "I never thought this day would ever come."
				},
				{
					"name": "Olivia",
					"text": "I'm so thankful that you tried to steal a deer that night."
				},
				{
					"name": "Will",
					"text": "I guess we can thank the deer indirectly."
				},
				{
					"text": "Olivia smiles, and so do I."
				},
				{
					"text": "Gazing into her face from up close like this, I feel full of happiness."
				},
				{
					"text": "But I feel tense at the same time."
				},
				{
					"text": "This is naught but the starting point."
				},
				{
					"name": "Will",
					"text": "We're just getting started. We won't achieve true freedom without putting in the work."
				},
				{
					"text": "Olivia nods."
				},
				{
					"name": "Will",
					"text": "It'll become much easier if—when we're selected for the court performance."
				},
				{
					"name": "Will",
					"text": "I don't know how much the Lily Theater makes, but I don't think any other troupe is raising that much money."
				},
				{
					"name": "Will",
					"text": "We have work to do."
				},
				{
					"name": "Olivia",
					"text": "Yes, but..."
				},
				{
					"name": "Olivia",
					"text": "When I'm with you, I feel like we can do anything."
				},
				{
					"text": "Olivia says, putting a hand to my cheek."
				},
				{
					"text": "I put my hand over hers and hold it there."
				},
				{
					"name": "Olivia",
					"text": "Will..."
				},
				{
					"name": "Will",
					"text": "I'll write."
				},
				{
					"text": "Her eyes go wide for a moment."
				},
				{
					"name": "Olivia",
					"text": "Now?"
				},
				{
					"text": "I nod in response."
				},
				{
					"name": "Olivia",
					"text": "Have you decided what the next theme will be?"
				},
				{
					"name": "Will",
					"text": "No, actually."
				},
				{
					"name": "Will",
					"text": "But I feel like I need to be at my desk right now. I don't think I'll be able to sleep for a while yet."
				},
				{
					"name": "Olivia",
					"text": "We have a performance tomorrow, remember?"
				},
				{
					"name": "Will",
					"text": "I know. I'll catch a few winks."
				},
				{
					"name": "Will",
					"text": "You should go to bed though. You're the head of this troupe. You need your sleep."
				},
				{
					"name": "Olivia",
					"text": "But..."
				},
				{
					"name": "Will",
					"text": "I'll be fine, I'm used to this."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "I need to write something that can bring tears to the eye of our discerning leader. It's not an easy job."
				},
				{
					"name": "Olivia",
					"text": "You're the best boy."
				},
				{
					"text": "Olivia whispers into my ear and plants a kiss on my forehead."
				},
				{
					"name": "Olivia",
					"text": "You can write it, I'm certain."
				},
				{
					"text": "I sit at my desk, and Olivia watches me for a while."
				},
				{
					"text": "I barely move my quill."
				},
				{
					"text": "I'm just sitting there, staring at a blank sheet of parchment."
				},
				{
					"text": "I hear Olivia turn over on the bed a few times and sneak a glance over at her."
				},
				{
					"text": "She's sleeping soundly."
				},
				{
					"text": "I can hear her little sighs."
				},
				{
					"text": "Even while asleep..."
				},
				{
					"text": "...she's as lovely as ever."
				},
				{
					"text": "I can't help feeling that I'm not man enough to be worth the love of such a magnificent person."
				},
				{
					"text": "I just learned of her origins, but she's still spent half of her life among nobility."
				},
				{
					"text": "Even if she made a wrong turn, she would never end up in a run down pub like this one."
				},
				{
					"text": "Suddenly, I feel terribly distant from her."
				},
				{
					"text": "Even though we're in the same room."
				},
				{
					"text": "She's so near, yet seemingly so far out of reach."
				},
				{
					"text": "I realize that I've always had this feeling in my heart, ever since the day we met."
				},
				{
					"text": "Although I'm right beside her, I can't quite reach her."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "How can I make that into a play?"
				},
				{
					"text": "How can I express this mental wall I feel between us?"
				},
				{
					"text": "I need to turn this into something symbolic, something everyone can sympathize with."
				},
				{
					"text": "First of all..."
				},
				{
					"text": "Perhaps I should start with the people we saw one another as when we first met."
				},
				{
					"text": "A love between a young bartender and a beautiful noblewoman."
				},
				{
					"text": "When the young man sneaks into the mansion, he falls in love with the woman at first sight."
				},
				{
					"text": "He approaches the woman, as if feeling the pull of destiny itself."
				},
				{
					"text": "And the two speak of love."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "I blush fiercely when I read over what I wrote in the heat of the moment."
				},
				{
					"text": "It's too obvious and frank."
				},
				{
					"text": "This is a personal poem meant for the two of us."
				},
				{
					"text": "It's too embarrassing to even reread it."
				},
				{
					"text": "I may have gotten a little too sentimental."
				},
				{
					"text": "I crumple the piece of manuscript and throw it away."
				},
				{
					"text": "It's no good. There is no way I can surpass Hamlet with such a simple story."
				},
				{
					"text": "Think, Will, think."
				},
				{
					"text": "I look at my shelves, recall Rob's rumors, and search through my old notes, but nothing catches my eye."
				},
				{
					"text": "When dawn starts to break, I go down to the pub and take a short nap."
				}
			]
		},
		{},
		{
			"texts": [
				{
					"name": "Olivia",
					"text": "Everyone, can I have your attention before we begin the rehearsal?"
				},
				{
					"name": "Kiki",
					"text": "Huh?"
				},
				{
					"name": "Thomas",
					"text": "What is it?"
				},
				{
					"name": "Olivia",
					"text": "I have good news and bad news, which one do you want to hear first?"
				},
				{
					"name": "Kiki",
					"text": "Uhhh, how about just the good news?"
				},
				{
					"name": "Thomas",
					"text": "Agreed."
				},
				{
					"text": "The rest of the troupe members nod in agreement."
				},
				{
					"name": "Olivia",
					"text": "All right. The good news is that Will finished his new play. We'll start rehearsing today."
				},
				{
					"name": "Kiki",
					"text": "T-Today?!"
				},
				{
					"name": "Thomas",
					"text": "Huh? We got the second performance today, don't we?"
				},
				{
					"name": "Kiki",
					"text": "The Midsummer Night's Dream one!"
				},
				{
					"name": "Olivia",
					"text": "Yes, but we will be premiering the new one in ten days."
				},
				{
					"name": "Olivia",
					"text": "Its title is Hamlet. It's a story about the Danish royal family."
				},
				{
					"name": "Olivia",
					"text": "The melancholic, indecisive, shilly-shallying nature of the protagonist is simply the best. Why, it even reminds me of how a certain someone used to be."
				},
				{
					"text": "Olivia glances my way with a mocking grin."
				},
				{
					"name": "Olivia",
					"text": "The leading role, Hamlet, will be mine. As part of my research for the character, I'd like to keep a close eye on a questionable man such as him."
				},
				{
					"name": "Will",
					"text": "I may not be able to help you there."
				},
				{
					"name": "Olivia",
					"text": "Oh, what a tragedy."
				},
				{
					"name": "Olivia",
					"text": "Will, you will be Ophelia. Hamlet's lover, a girl who goes mad because of Hamlet's thirst for revenge."
				},
				{
					"name": "Will",
					"text": "Right."
				},
				{
					"name": "Olivia",
					"text": "Thomas, you will be Ophelia's father, the Lord Chamberlain Polonius. He's an incompetent man who boasts of his strong prejudice. You can play him as a comical character."
				},
				{
					"name": "Olivia",
					"text": "So, just be your usual self."
				},
				{
					"name": "Thomas",
					"text": "That stings!"
				},
				{
					"name": "Olivia",
					"text": "Kiki, you will be Horatio, Hamlet's best friend. It's the role of a man, but the audience wants more of you, so let's keep it androgynous."
				},
				{
					"name": "Olivia",
					"text": "You can manage, right? You are the main attraction of A Midsummer Night's Dream. We may still make some adjustments to Puck's lines, so be ready."
				},
				{
					"name": "Kiki",
					"text": "Huh? We're premiering this new play in ten days, right?"
				},
				{
					"name": "Olivia",
					"text": "We'll perform the new Hamlet for a while, and after that, we'll alternate between A Midsummer Night's Dream and Hamlet."
				},
				{
					"name": "Kiki&Thomas",
					"text": "Whaaaa?!"
				},
				{
					"name": "Kiki",
					"text": "Isn't that a bit much?"
				},
				{
					"name": "Thomas",
					"text": "We'll all have to perform both, right? My head's gonna burst!"
				},
				{
					"name": "Olivia",
					"text": "I'm very sorry about the suddenness of all this. To be honest, I know you all should be focusing on A Midsummer Night's Dream right now."
				},
				{
					"name": "Olivia",
					"text": "I think that sticking to a single role and getting comfortable in it brings the best out in you as actors."
				},
				{
					"name": "Olivia",
					"text": "But we can't afford the luxury of time anymore."
				},
				{
					"name": "Kiki",
					"text": "Oh, is this..."
				},
				{
					"name": "Thomas",
					"text": "The bad news?"
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "Olivia turns to me, her eyes pleading."
				},
				{
					"text": "I give her a small nod."
				},
				{
					"text": "She nods back."
				},
				{
					"name": "Olivia",
					"text": "Starting today, this troupe is on its own. Spencer ended his patronage yesterday."
				},
				{
					"name": "Kiki",
					"text": "WHAT?!"
				},
				{
					"name": "Thomas",
					"text": "But didn't yesterday go well?!"
				},
				{
					"name": "Kiki",
					"text": "Did the patron dislike something about our performance?"
				},
				{
					"text": "Olivia shakes her head."
				},
				{
					"name": "Kiki",
					"text": "Then why?"
				},
				{
					"name": "Thomas",
					"text": "Actually, are we even allowed to use the theater now?"
				},
				{
					"text": "Olivia looks down, her lips quivering, but says nothing."
				},
				{
					"text": "Everyone's looking anxiously at her, but the silence only makes the situation more tense."
				},
				{
					"name": "Will",
					"text": "We withdrew from his patronage. At my request."
				},
				{
					"text": "Everyone looks at me."
				},
				{
					"name": "Kiki",
					"text": "You turned down his support?"
				},
				{
					"name": "Will",
					"text": "Yes."
				},
				{
					"name": "Kiki",
					"text": "But why?"
				},
				{
					"text": "I search for the right words."
				},
				{
					"text": "If we become independent before striking success, we'll receive a larger share of our earnings later."
				},
				{
					"text": "After seeing yesterday's enthusiasm from the crowd, I became certain we could be selected for a court performance."
				},
				{
					"text": "I want to write new plays without worrying about the patron's stifling conditions."
				},
				{
					"text": "None of these things would be a lie."
				},
				{
					"text": "And yet, it wouldn't be the truth either."
				},
				{
					"text": "I see the worry and unease in the eyes of the other troupe members."
				},
				{
					"text": "It wouldn't be fair to lie to them."
				},
				{
					"text": "..."
				},
				{
					"text": "My father's words come back to me."
				},
				{
					"text": "Yes, if I start telling white lies, it won't be long before things collapse under the weight of truth."
				},
				{
					"text": "I can't afford to be a lesser man."
				},
				{
					"text": "This all started because of me and my impulses."
				},
				{
					"text": "And I need to see it through."
				},
				{
					"text": "I have no choice but to do so."
				},
				{
					"name": "Will",
					"text": "Because I had no choice."
				},
				{
					"name": "Will",
					"text": "I had no other choice if I wanted to take Olivia away from that man."
				},
				{
					"text": "Olivia's eyes bulge out and her jaw drops."
				},
				{
					"name": "Olivia",
					"text": "Of all the ways you could have worded that..."
				},
				{
					"name": "Kiki",
					"text": "Ah..."
				},
				{
					"name": "Thomas",
					"text": "You mean, take the leader from Spencer?"
				},
				{
					"name": "Kiki",
					"text": "But wasn't she his fiancee?"
				},
				{
					"name": "Will",
					"text": "Yes. I couldn't let Olivia remain under Spencer's thumb for the sake of keeping this troupe afloat."
				},
				{
					"name": "Kiki",
					"text": "Huh? Is that true?"
				},
				{
					"name": "Olivia",
					"text": "Well..."
				},
				{
					"name": "Kiki",
					"text": "Wait, so that means..."
				},
				{
					"name": "Thomas",
					"text": "You stole both the troupe and his fiancee?"
				},
				{
					"name": "Will",
					"text": "No, I went to his manor yesterday and informed him of the change."
				},
				{
					"name": "Kiki",
					"text": "How lily livered!"
				},
				{
					"name": "Thomas",
					"text": "Ain't much of a damn theft, then!"
				},
				{
					"name": "Will",
					"text": "You know how messed up in the head that man is. We have to do things properly."
				},
				{
					"name": "Kiki&Thomas",
					"text": "A-Agreed."
				},
				{
					"name": "Will",
					"text": "I am aware of the strain my decision puts on all of you. I'd like to apologize, first of all."
				},
				{
					"text": "I bow my head."
				},
				{
					"text": "The shock and confusion is apparent in everyone's countenance."
				},
				{
					"name": "Will",
					"text": "After you left the pub yesterday, I heard that you were all receiving a monthly payment from Olivia."
				},
				{
					"name": "Will",
					"text": "Taking those expenses into account, this is the only way to keep using the Globe without Spencer's help until we're selected for the court performance."
				},
				{
					"name": "Kiki",
					"text": "So a new play in ten days."
				},
				{
					"name": "Olivia",
					"text": "And a second one after that."
				},
				{
					"name": "Thomas",
					"text": "Excuse moi?!"
				},
				{
					"name": "Kiki",
					"text": "What? You have another script?! Can you really write all that, Will?!"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "Everyone turns back to me, clearly astonished."
				},
				{
					"name": "Olivia",
					"text": "I think he's already written it. Isn't that right, Will?"
				},
				{
					"text": "Olivia quirks an impish smile and glances at me."
				},
				{
					"name": "Olivia",
					"text": "It looks like we'll have a love story on our hands."
				},
				{
					"text": "I snap my head back to her."
				},
				{
					"text": "She's smirking mischievously."
				},
				{
					"name": "Will",
					"text": "It can't be. How?! When?!"
				},
				{
					"name": "Olivia",
					"text": "You dropped it on the floor of your room. How could I not see it?"
				},
				{
					"name": "Will",
					"text": "No! That was a reject!"
				},
				{
					"name": "Olivia",
					"text": "Is that so? I didn't think it was that bad."
				},
				{
					"name": "Kiki",
					"text": "Huh? What was it about?"
				},
				{
					"name": "Olivia",
					"text": "It looked like the story of how a young bartender falls in love with a beautiful noblewoman."
				},
				{
					"name": "Kiki",
					"text": "Whoaaa..."
				},
				{
					"name": "Thomas",
					"text": "Isn't that a bit too obvious? Rein yourself in a little, lover boy."
				},
				{
					"name": "Will",
					"text": "That's what I'm trying to do! Wait, no! I'm telling you it's a reject!"
				},
				{
					"name": "Kiki",
					"text": "Huh? Really?"
				},
				{
					"name": "Thomas",
					"text": "Bah, who cares? It sounds easy to follow."
				},
				{
					"name": "Olivia",
					"text": "Hamlet has a lot of complex characterization, so I think a simple love story would be good."
				},
				{
					"name": "Olivia",
					"text": "Go with that story."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "Understood?"
				},
				{
					"name": "Will",
					"text": "I guess I can give it a shot."
				},
				{
					"text": "Olivia nods and turns to the troupe."
				},
				{
					"name": "Olivia",
					"text": "Everyone, our situation has changed considerably. I understand that this will be hard to accept for some of you."
				},
				{
					"name": "Olivia",
					"text": "But while it was Will's decision, I approved his judgment."
				},
				{
					"name": "Olivia",
					"text": "He helped me, and I don't regret it. That's the truth."
				},
				{
					"name": "Olivia",
					"text": "I am terribly sorry to tell you all after the fact like this."
				},
				{
					"name": "Kiki",
					"text": "..."
				},
				{
					"name": "Thomas",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "I'd like all of you to help us make this happen. I understand if you don't want to subject yourselves to these conditions, though. I leave the decision to you."
				},
				{
					"name": "Kiki",
					"text": "Decision, you say?"
				},
				{
					"name": "Thomas",
					"text": "Not like we have much else going on if we give up the ghost here."
				},
				{
					"name": "Kiki",
					"text": "Yeah, right!"
				},
				{
					"name": "Will",
					"text": "The fact that we lost our patron will become common knowledge soon enough."
				},
				{
					"name": "Will",
					"text": "You'll all be treated as vagrants. Are you okay with that?"
				},
				{
					"name": "Kiki",
					"text": "How is that any different from being our leader's slaves?"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Kiki",
					"text": "I mean, if it ever gets out that the leader is a woman who's acting on stage, we'll all be thrown behind bars all the same."
				},
				{
					"name": "Thomas",
					"text": "If there ever was something to be afraid of, it isn't what others say about us."
				},
				{
					"text": "Thomas says, tracing a straight line across his neck with his thumb."
				},
				{
					"name": "Olivia",
					"text": "Yes, you're right."
				},
				{
					"name": "Kiki",
					"text": "Yeah, but never mind that."
				},
				{
					"text": "Kiki and Thomas exchange glances and giggle."
				},
				{
					"name": "Kiki",
					"text": "You stole Spencer's fiancee! That's the best news ever!"
				},
				{
					"name": "Thomas",
					"text": "You put our whole career to shame, lad!"
				},
				{
					"name": "Kiki",
					"text": "I'm having the best time of my life, so I don't care if people want to call us vagrants."
				},
				{
					"name": "Thomas",
					"text": "It would actually make for a good excuse to pick up thievery again."
				},
				{
					"name": "Olivia",
					"text": "Don't be stupid! If anyone gets careless, it'll spell the end for the troupe. As long as we're here, you don't give up your pride as an actor."
				},
				{
					"name": "Kiki",
					"text": "Hahah!"
				},
				{
					"name": "Thomas",
					"text": "Now that's more like it. Stay strong, leader."
				},
				{
					"name": "Kiki",
					"text": "It's all fine. Let's do our best!"
				},
				{
					"name": "Kiki",
					"text": "Being chosen for the court performance without a patron would be a first in history!"
				},
				{
					"name": "Thomas",
					"text": "Vagrants entering the Royal Palace? Now, that would be damn well impressive!"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"text": "My eyes meet Olivia's."
				},
				{
					"text": "The tension we had been feeling all morning comes loose, and we laugh together."
				},
				{
					"name": "Will",
					"text": "Guess they're all a bunch of rejects. You did well bringing all these people together, eh?"
				},
				{
					"name": "Olivia",
					"text": "Don't talk as though you're not included. You're part of this too."
				},
				{
					"name": "Will",
					"text": "And you too."
				},
				{
					"name": "Olivia",
					"text": "I'm well aware."
				},
				{
					"text": "Olivia blows out a breath and ties up her long hair into a ponytail."
				},
				{
					"name": "Olivia",
					"text": "Get ready to rehearse! First, we're gonna improve on yesterday's performance! Then we're gonna start practicing the new play! Get your scripts!"
				},
				{
					"name": "Olivia",
					"text": "We have no time to lose! I don't want to see any tomfoolery here, understood?!"
				},
				{
					"name": "Kiki&Thomas",
					"text": "Aye, ma'am!"
				},
				{
					"text": "For our second performance, the theater is clearly more packed than yesterday."
				},
				{
					"text": "Just as we expected, everyone flooded the theater after hearing about Kiki."
				},
				{
					"text": "The more attention Kiki commands, the easier it'll be to hide Olivia's gender."
				},
				{
					"text": "If everyone's too focused on Kiki, we can hide the real woman of the group."
				},
				{
					"text": "And after that, the story is what will draw the attention of the audience."
				},
				{
					"text": "By putting it all out there, we can camouflage our biggest secret. It's our best and only shot."
				},
				{
					"text": "We increased the amount of food and drink in the theater so it doesn't sell out immediately like it did yesterday."
				},
				{
					"text": "Olivia bought the ale from our pub."
				},
				{
					"text": "It compensates for the fewer hours the pub stays open because of our new tight schedule."
				},
				{
					"text": "We have a full house once again."
				},
				{
					"text": "But as things stand now, this is the bare minimum we need to keep afloat."
				},
				{
					"text": "How long can we keep this going?"
				},
				{
					"text": "Everything depends on the answer to that question."
				},
				{
					"name": "Olivia",
					"text": "I wonder how many of the people that came yesterday are here today?"
				},
				{
					"name": "Olivia",
					"text": "Do you remember any of them, Will?"
				},
				{
					"name": "Will",
					"text": "It's not like I go around memorizing every single face I see."
				},
				{
					"name": "Kiki",
					"text": "Mmh, about thirty percent of them are repeaters, I'd say."
				},
				{
					"name": "Will",
					"text": "Really? How do you know?"
				},
				{
					"name": "Kiki",
					"text": "Everyone started chanting when I came on in the second act yesterday, remember?"
				},
				{
					"name": "Kiki",
					"text": "They were all staring directly at me and shouting 'We don't care if he's a guy!'"
				},
				{
					"name": "Olivia",
					"text": "I figured they would."
				},
				{
					"name": "Will",
					"text": "You did? Are you sure this is okay?"
				},
				{
					"name": "Kiki",
					"text": "And I think about thirty per cent of the audience today are chanting in time like yesterday. The rest are a little off tempo, so I suppose they must be new."
				},
				{
					"name": "Olivia",
					"text": "I see."
				},
				{
					"name": "Will",
					"text": "Let's assume the rate of regulars we get will be around thirty percent, then."
				},
				{
					"name": "Olivia",
					"text": "Did everyone manage to fit into the theater today?"
				},
				{
					"name": "Thomas",
					"text": "No, we had to turn away a fair amount of people."
				},
				{
					"name": "Olivia",
					"text": "What a waste."
				},
				{
					"name": "Will",
					"text": "There's a lot of space between the seats on the second and third floors, right? Can't we put more seats in there? The third floor looks especially empty even when it's full."
				},
				{
					"name": "Olivia",
					"text": "That's the area for nobles only. The price between first floor admission and third floor is completely different."
				},
				{
					"name": "Will",
					"text": "Yeah, but it's still too much space. If we earn ourselves a good reputation, those pompous nobles will come even if they have to sit a little closer to each other."
				},
				{
					"name": "Olivia",
					"text": "Yes, I suppose you have a point. They tend to be afraid of not being up to date with the latest trends."
				},
				{
					"name": "Will",
					"text": "Okay, then let's put the same amount of seats we have on the second floor and try to encourage more nobles to come."
				},
				{
					"name": "Will",
					"text": "And how about we also increase the amount of seats on the second floor and offer discounts to the people coming again so they can enter for a little cheaper?"
				},
				{
					"name": "Will",
					"text": "If we can expect thirty percent to come back, I think it wouldn't hurt to give them incentive and a new angle to watch the play from. That'll keep them hooked."
				},
				{
					"name": "Will",
					"text": "That way people have a reason to come again, and even discounted, the price to enter the second floor will be better for us than cramming them all into the first floor."
				},
				{
					"name": "Olivia",
					"text": "That might be a good idea, actually. Let's hand out fliers to the audience members on the first floor starting tomorrow."
				},
				{
					"name": "Olivia",
					"text": "We can write down the date on them, and they can use them to enter the second floor at a discount price from that day onwards. Can we make it happen by tomorrow?"
				},
				{
					"name": "Kiki",
					"text": "Let's get our drinking buddies to help!"
				},
				{
					"name": "Thomas",
					"text": "Yeah, it's only fair since they have to put up with us constantly complaining about rehearsals."
				},
				{
					"name": "Kiki",
					"text": "You didn't need to mention that."
				},
				{
					"name": "Olivia",
					"text": "Okay, I'll leave the design up to you. Why not draw Kiki's face on them?"
				},
				{
					"name": "Kiki",
					"text": "Nice idea!"
				},
				{
					"name": "Thomas",
					"text": "So, like this?"
				},
				{
					"text": "Thomas draws a little sketch of Kiki on his script."
				},
				{
					"name": "Olivia",
					"text": "That's really good!"
				},
				{
					"name": "Kiki",
					"text": "You captured my cuteness very well!"
				},
				{
					"name": "Will",
					"text": "Way to toot your own horn."
				},
				{
					"name": "Will",
					"text": "It is really good, though. You're quite skilled at drawing, Thomas."
				},
				{
					"name": "Thomas",
					"text": "I used to sell paintings a lifetime ago. I could even pass as a famous painter if the noble I was talking to was dumb enough."
				},
				{
					"name": "Kiki",
					"text": "Ahahahah! Now that brings back memories!"
				},
				{
					"name": "Olivia",
					"text": "It's incredible. Why, I want to make a collection out of these. Can you draw a different pose each day?"
				},
				{
					"name": "Thomas",
					"text": "Like so?"
				},
				{
					"name": "Olivia",
					"text": "Incredible!"
				},
				{
					"name": "Kiki",
					"text": "Oh, I look so adorable!"
				},
				{
					"name": "Will",
					"text": "Haven't we gone through this before?"
				},
				{
					"name": "Will",
					"text": "Anyway, it's pretty good!"
				},
				{
					"name": "Thomas",
					"text": "I used to sell paintings a lifetime ago."
				},
				{
					"name": "Olivia",
					"text": "And you even passed for a famous painter in front of dumb nobles, we know. I'll shut your mouth permanently if you keep repeating the same story over and over."
				},
				{
					"name": "Thomas",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "The praise was short-lived, huh?"
				},
				{
					"name": "Thomas",
					"text": "I'll get these ready in a flash as soon as I can gather up all my painting swindler buddies from back in the day. These doodles are easy enough."
				},
				{
					"name": "Kiki",
					"text": "They're so fast at drawing that you can barely see their quills!"
				},
				{
					"name": "Thomas",
					"text": "It's good motivation when it feels like you're drawing pennies into your pouch, hahah!"
				},
				{
					"name": "Olivia",
					"text": "I will pay you all from a portion of the ticket sales. Do make them see the advantages of earning a wage through normal means rather than putting their necks on the line selling forgeries."
				},
				{
					"name": "Olivia",
					"text": "That way we'll get the second floor packed, and they'll see more money."
				},
				{
					"name": "Thomas",
					"text": "I'm glad our mighty leader understands how the mind of a swindler works."
				},
				{
					"name": "Olivia",
					"text": "Don't underestimate me. You are not the only ones with experience in the field."
				},
				{
					"text": "Thomas and Kiki exchange glances."
				},
				{
					"text": "I can't help but smile at the scene."
				},
				{
					"name": "Olivia",
					"text": "You're writing the new play, right, Will?"
				},
				{
					"name": "Olivia",
					"text": "Let me help you. You didn't make much progress yesterday, did you?"
				},
				{
					"name": "Will",
					"text": "You were watching me?"
				},
				{
					"name": "Olivia",
					"text": "I was, all the way until morning."
				},
				{
					"name": "Kiki",
					"text": "You're writing together?"
				},
				{
					"name": "Thomas",
					"text": "Your very own love story?"
				},
				{
					"name": "Kiki&Thomas",
					"text": "How spicy!"
				},
				{
					"name": "Olivia",
					"text": "Why yes, I do wish it would be, but I've never met a denser man in my life. Talk about a late bloomer."
				},
				{
					"name": "Olivia",
					"text": "Can you believe he didn't even try to lay a hand on me over the whole night? I do feel like I understand how Hermia must have felt."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "Let's go, Will. We have only ten days until it's time for the new play."
				},
				{
					"name": "Will",
					"text": "Y-Yeah."
				},
				{
					"name": "Kiki",
					"text": "It's gonna happen, huh?"
				},
				{
					"name": "Thomas",
					"text": "They're getting no sleep."
				},
				{
					"name": "Kiki",
					"text": "Actually, I don't think it can NOT happen, from the looks of it."
				},
				{
					"name": "Thomas",
					"text": "Yeah, that's the kind of woman that just gets grumpier until she gets her way."
				},
				{
					"name": "Kiki",
					"text": "You don't seem like you'd be good at ad libbing, so I hope you've got some sappy lines ready!"
				},
				{
					"name": "Thomas",
					"text": "I bet you can talk the talk, but can you grope that arse?"
				},
				{
					"name": "Will",
					"text": "I-I've had enough of you two!"
				},
				{
					"name": "Will",
					"text": "Shut it already! I-I... Just shut up!"
				},
				{
					"name": "Will",
					"text": "You pair of dolts!"
				},
				{
					"name": "Kiki",
					"text": "Truly, what a waste of good looks."
				},
				{
					"name": "Thomas",
					"text": "There's a point where the naivete becomes a turn off, lad!"
				},
				{
					"name": "Kiki",
					"text": "Man up and get HER show on the road!"
				},
				{
					"name": "Thomas",
					"text": "Not even I'm a virgin, lad! You gotta get that taken care of!"
				},
				{
					"name": "Will",
					"text": "Ah, get off my back!"
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "You gotta be jesting."
				},
				{
					"text": "Even Thomas has more experience than me?"
				},
				{
					"text": "After getting back home, we open the pub for a short while."
				},
				{
					"text": "We told the regulars that we'd be reducing our business hours, so they all come in droves when we're finally open."
				},
				{
					"text": "After the short rush hour, we close the pub and go upstairs to write in my room."
				},
				{
					"name": "Olivia",
					"text": "What exactly are you stuck on?"
				},
				{
					"name": "Will",
					"text": "Up until now, I based all my stories off things people told me."
				},
				{
					"name": "Will",
					"text": "But this is all me."
				},
				{
					"name": "Will",
					"text": "Obviously, I'm the young bartender, and the noblewoman is you."
				},
				{
					"name": "Olivia",
					"text": "Oh, I didn't notice."
				},
				{
					"name": "Will",
					"text": "How funny. It's a little too close to home, so it's kind of hard to write about it."
				},
				{
					"name": "Olivia",
					"text": "I see, but I don't think you should do away with that personal quality. The only thing to touch the audience's hearts are the lines that come directly from your own."
				},
				{
					"name": "Olivia",
					"text": "You realized that while writing Hamlet, didn't you?"
				},
				{
					"name": "Will",
					"text": "Yeah."
				},
				{
					"name": "Olivia",
					"text": "If you get all shy because you feel the setting of the story overlaps too much with your real life, it'll only become noise for the audience."
				},
				{
					"name": "Olivia",
					"text": "So how about you change the setting to something you can look at a little more objectively?"
				},
				{
					"name": "Will",
					"text": "For example?"
				},
				{
					"name": "Olivia",
					"text": "What if there was an obstacle to their love?"
				},
				{
					"name": "Olivia",
					"text": "There are many things in the world of nobles other than social status that could do that."
				},
				{
					"name": "Olivia",
					"text": "Oftentimes, a woman's future husband is decided by her parents, or sometimes two noble houses are on bad terms."
				},
				{
					"name": "Will",
					"text": "Houses on bad terms?"
				},
				{
					"name": "Olivia",
					"text": "Yes, there are plenty of families with feuds between them."
				},
				{
					"name": "Will",
					"text": "I think I've heard of such a thing before..."
				},
				{
					"text": "Feuds between families."
				},
				{
					"text": "I follow the trail of my memory."
				},
				{
					"name": "Will",
					"text": "...in Italy."
				},
				{
					"name": "Olivia",
					"text": "Italy again? Another story from Rob?"
				},
				{
					"name": "Will",
					"text": "No, I read about it in a book. The title was, if I remember well..."
				},
				{
					"name": "Will",
					"text": "'The Tragical History of Romeus and Juliet.'"
				},
				{
					"name": "Olivia",
					"text": "Romeus and Juliet?"
				},
				{
					"name": "Will",
					"text": "Yes. The man was selling translations of Italian novels, and he told me that one story."
				},
				{
					"name": "Will",
					"text": "The story was..."
				},
				{
					"text": "It was set in a certain region in Italy."
				},
				{
					"text": "A story about two families with an age-old vendetta."
				},
				{
					"text": "The son of one family and the daughter of the other fall deeply in love and marry behind their parents' backs."
				},
				{
					"name": "Will",
					"text": "But in the end, they both die."
				},
				{
					"name": "Olivia",
					"text": "That's quite a simple tragic story, isn't it?"
				},
				{
					"name": "Olivia",
					"text": "But before they reach that tragic end, it is certainly a story about the love of two young dreamers."
				},
				{
					"name": "Olivia",
					"text": "I think it's good. How about you?"
				},
				{
					"name": "Will",
					"text": "Yeah, we only have ten days. We use this story as a base to build my own words upon."
				},
				{
					"text": "I raise my head."
				},
				{
					"text": "Olivia is looking down at me."
				},
				{
					"name": "Will",
					"text": "I'll write this story."
				},
				{
					"text": "She quirks a pleasant smile."
				},
				{
					"name": "Olivia",
					"text": "Good boy."
				},
				{
					"name": "Will",
					"text": "Can you read out this line for me?"
				},
				{
					"name": "Olivia",
					"text": "Sure, which one?"
				},
				{
					"text": "Romeus or Juliet?"
				},
				{
					"text": "After thinking for a moment, I look up at her."
				},
				{
					"name": "Will",
					"text": "Juliet's lines, thank you."
				},
				{
					"text": "Olivia nods and takes the manuscript from me."
				},
				{
					"name": "Olivia",
					"text": "So this is the scene where their love begins. I'm on the balcony right now, yes?"
				},
				{
					"name": "Will",
					"text": "And I'm below, looking up at you."
				},
				{
					"text": "Juliet is talking to herself, unaware of Romeus' presence."
				},
				{
					"text": "They have already begun to feel love for each other."
				},
				{
					"name": "Olivia",
					"text": "O Romeus, Romeus! Wherefore art thou, Romeus?"
				},
				{
					"name": "Olivia",
					"text": "What's in a name? That which we call a rose, by any other name would smell as sweet! So Romeus would, were he not Romeus call'd."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "Wait a moment, this is hard to say."
				},
				{
					"name": "Olivia",
					"text": "O Romeus, Romeus! Wherefore art thou, Romeus?"
				},
				{
					"text": "Olivia stops and sounds out the words."
				},
				{
					"name": "Olivia",
					"text": "The name is too long. We need something shorter if I'm to repeat it this much. Change it."
				},
				{
					"name": "Will",
					"text": "Really?"
				},
				{
					"name": "Olivia",
					"text": "Wouldn't 'Will' work just fine? O Will, Will! Wherefore art thou, Will?"
				},
				{
					"name": "Will",
					"text": "Are you jesting?"
				},
				{
					"name": "Olivia",
					"text": "Of course."
				},
				{
					"text": "Olivia frowns and furrows her eyebrows in annoyance."
				},
				{
					"name": "Olivia",
					"text": "Hurry up."
				},
				{
					"name": "Will",
					"text": "How about, uh, Romeo?"
				},
				{
					"name": "Olivia",
					"text": "Romeo... Romeo, Romeo! Wherefore art thou, Romeo?"
				},
				{
					"name": "Olivia",
					"text": "Yes, that's good. Let's go from the top again."
				},
				{
					"name": "Olivia",
					"text": "O Romeo, deny thy father and refuse thy name. If thou wilt not, be but sworn my love, and I'll no longer be a Capulet."
				},
				{
					"name": "Will",
					"text": "I take thee at thy word. Call me but love, and I'll be new baptized. Henceforth I will never be Romeo. By yonder blessed moon I swear."
				},
				{
					"name": "Olivia",
					"text": "O, swear not by the moon."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "Olivia answers with a line that isn't in the script."
				},
				{
					"name": "Olivia",
					"text": "Not by the moon, the inconstant moon. That monthly changes in her circled orb, lest that thy love prove likewise variable."
				},
				{
					"name": "Will",
					"text": "Olivia, that—"
				},
				{
					"name": "Will",
					"text": "...Juliet."
				},
				{
					"name": "Olivia",
					"text": "Although I joy in thee, I have no joy of this contract to-night. It is too rash, too unadvised, too sudden."
				},
				{
					"text": "The moonlight illuminates the room."
				},
				{
					"text": "Olivia's not reading from the script anymore."
				},
				{
					"text": "She turns her eyes to me, a mixture of anxiousness and longing swirling in them."
				},
				{
					"name": "Olivia",
					"text": "At our feet lie years of bloodshed and enmity. Thy love, like a flash in the darkest of nights..."
				},
				{
					"name": "Olivia",
					"text": "It is too like the lightning, which doth cease to be."
				},
				{
					"text": "Pure passion laces her gaze."
				},
				{
					"text": "Her rose eyes gleam with a mysterious, beautiful glow, and I find myself unable to tear myself from them."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"name": "Olivia",
					"text": "Do not swear at all, or, if thou wilt, swear by thy gracious self."
				},
				{
					"name": "Olivia",
					"text": "Swear by thyself, which is the god of my idolatry, and I'll believe thee."
				},
				{
					"name": "Olivia",
					"text": "Swear not by the moon, but by thyself."
				},
				{
					"name": "Olivia",
					"text": "Swear to me."
				},
				{
					"text": "Her eyes seem to glimmer."
				},
				{
					"text": "They shine with a pure brilliance, like a bright fire seen through a veil of water."
				},
				{
					"name": "Will",
					"text": "I swear."
				},
				{
					"name": "Will",
					"text": "By my heart's dear love, I swear. For it is my soul that calls upon thy name, and without it would certainly wilt."
				},
				{
					"text": "The script slips out of my hands."
				},
				{
					"text": "The words spring forth from the depths of my soul."
				},
				{
					"name": "Will",
					"text": "To live without thy love would be the same as death."
				},
				{
					"name": "Will",
					"text": "Certainly, I would rather sack this hateful anatomy of mine, were my world be one without your love."
				},
				{
					"name": "Will",
					"text": "Therefore..."
				},
				{
					"name": "Will",
					"text": "By my life, I swear eternal love to thee."
				},
				{
					"text": "Juliet..."
				},
				{
					"text": "No, Olivia looks into my eyes and smiles."
				},
				{
					"text": "The soft moonlight shines through the window, playing across her hair and lips."
				},
				{
					"name": "Olivia",
					"text": "Good night, good night, my Romeo. Parting is such a sweet sorrow, that I shall say good-night till it be morrow."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "The silence slowly melts away her sweet smile."
				},
				{
					"name": "Olivia",
					"text": "So, what now?"
				},
				{
					"name": "Will",
					"text": "Oh, uh, right."
				},
				{
					"text": "I look down at the script by my feet."
				},
				{
					"name": "Will",
					"text": "Their first..."
				},
				{
					"text": "Olivia nods slowly."
				},
				{
					"name": "Will",
					"text": "...kiss."
				},
				{
					"text": "A meaningful smile comes back to her face."
				},
				{
					"name": "Olivia",
					"text": "Don't cut corners. Keep going."
				},
				{
					"text": "Step by step, Olivia approaches me."
				},
				{
					"text": "She stops in front of me and looks up at me, her eyes flickering with that same gentle fire."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "Wordlessly, I draw her into my embrace."
				},
				{
					"text": "Her hips are slender, and her whole body feels supple and soft to the touch."
				},
				{
					"text": "Her eyes are right in front of me."
				},
				{
					"text": "They're moist with tears and full of earnest desire."
				},
				{
					"name": "Olivia",
					"text": "Is it Romeo about to kiss me?"
				},
				{
					"name": "Olivia",
					"text": "Or is it you, Will?"
				},
				{
					"text": "A sweet sigh escapes her lips and flutters across mine."
				},
				{
					"name": "Will",
					"text": "Are you Juliet? Or—"
				},
				{
					"name": "Olivia",
					"text": "I'm Olivia."
				},
				{
					"name": "Will",
					"text": "Then..."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "I'm Will."
				},
				{
					"name": "Olivia",
					"text": "..."
				},
				{
					"name": "Will",
					"text": "..."
				},
				{
					"text": "She gently cups my cheeks in her hands, and we kiss."
				},
				{
					"text": "The warmth and the texture of her lips on mine stuns me for a second."
				},
				{
					"text": "I pull her even closer to me."
				},
				{
					"text": "Olivia leans into me, accepting the embrace."
				},
				{
					"text": "Our bodies come together in the most intimate of ways."
				},
				{
					"text": "Her scent fills my lungs."
				},
				{
					"text": "My senses are overloaded by her sensations. All I can feel is love."
				},
				{
					"text": "Her faint sighs are loud in my ears."
				},
				{
					"text": "We share a deep, passionate kiss for what feels like a lifetime."
				},
				{
					"text": "When I try to pull back a little, Olivia slides her hand to the back of my head and pulls me in."
				},
				{
					"name": "Olivia",
					"text": "Don't stop."
				},
				{
					"text": "The tone that leaves her lips is something I've never heard before."
				},
				{
					"text": "From the small space between her lips, her saliva mingles with my own."
				},
				{
					"text": "Her taste spreads all across my tongue."
				},
				{
					"text": "Slowly, we part the kiss."
				},
				{
					"text": "Then, Olivia gently wraps her arms around my neck, her long sleeves riding up her arms."
				},
				{
					"name": "Olivia",
					"text": "Will..."
				},
				{
					"text": "Her eyes are alight with desire."
				},
				{
					"text": "And her fiery gaze is set upon me, licking at my very soul."
				},
				{
					"name": "Will",
					"text": "Olivia..."
				},
				{
					"name": "Olivia",
					"text": "It's not over yet, right?"
				},
				{
					"text": "I answer with a nod."
				},
				{
					"name": "Will",
					"text": "I don't know how good I may be at this, though."
				},
				{
					"name": "Olivia",
					"text": "So long as it's with you, I'm happy."
				},
				{
					"name": "Olivia",
					"text": "No matter how clumsy or inexperienced you are."
				},
				{
					"text": "Olivia snuggles up to me and whispers into my ear."
				},
				{
					"name": "Olivia",
					"text": "Make love to me. Just let it happen."
				},
				{
					"name": "Olivia",
					"text": "I'll allow you to be poor at it, just for tonight."
				},
				{
					"text": "After that, she pulls back a little."
				},
				{
					"text": "She looks up at me again, a sweet smile crossing her face."
				},
				{
					"text": "Under the moonlight, she undresses, stripping her clothes off one piece at a time."
				},
				{
					"text": "Strangely enough, I feel no tension."
				},
				{
					"text": "I take her in my arms and gently lay her down on the bed."
				},
				{
					"text": "Until dawn, Olivia and I explore and love each other like never before."
				}
			]
		},
		{}
	]
}