{
	"scenes": [
		{},
		{
			"texts": [
				{
					"name": "Kaito",
					"text": "I’m about to tell you the story of one girl."
				},
				{
					"name": "Kaito",
					"text": "A story I tell to every person that comes here."
				},
				{
					"text": "The briny breeze brushes against my cheek."
				},
				{
					"text": "In front of the small, seaside cabin."
				},
				{
					"text": "About 20 people gather every day on the wooden deck overlooking the horizon."
				},
				{
					"name": "Kaito",
					"text": "I hope that this story will remain in the memories of many people and be recalled again and again."
				},
				{
					"name": "Kaito",
					"text": "I continue to tell this story in the belief that it will one day lead to a miraculous moment."
				},
				{
					"text": "I slowly open the cover of the thick book in my hand."
				},
				{
					"text": "It never rains here."
				},
				{
					"text": "Pleasant sunlight envelops us every day."
				},
				{
					"text": "Every page of my book was uniformly tanned and tired from absorbing the moisture of the sea breeze."
				},
				{
					"name": "Kaito",
					"text": "We all have our own “individuality.”"
				},
				{
					"name": "Kaito",
					"text": "Its true nature is only collection of memories each of us makes throughout our lives."
				},
				{
					"text": "Next page."
				},
				{
					"text": "I remember every word of what is written here."
				},
				{
					"text": "Even so, I keep it close at hand because the same touch every day gives me a little peace of mind."
				},
				{
					"name": "Kaito",
					"text": "When it’s time to make a judgment, we use our past experiences as guidelines to lead us."
				},
				{
					"name": "Kaito",
					"text": "And those judgments lead to the actions we take. That’s why..."
				},
				{
					"name": "Kaito",
					"text": "Our past experiences—our memories inform our words and deeds."
				},
				{
					"name": "Kaito",
					"text": "We judge a person's character by looking at their behavior."
				},
				{
					"name": "Kaito",
					"text": "In other words, we indirectly recognize the accumulation of memories of the other person as individuality."
				},
				{
					"text": "I looked up."
				},
				{
					"text": "The eyes of the gathered people are directed at me."
				},
				{
					"text": "I closed my eyes."
				},
				{
					"text": "I always close my eyes before starting this story."
				},
				{
					"text": "I could hear the waves."
				},
				{
					"text": "I take a deep breath and take in the scent of the calm tides."
				},
				{
					"text": "And behind my closed eyes, a girl comes into view."
				},
				{
					"text": "She's here today too."
				},
				{
					"text": "She's always there, inside of me."
				},
				{
					"text": "I opened my eyes slowly."
				},
				{
					"name": "Kaito",
					"text": "But after all, we can only see the world the way we want to see it."
				},
				{
					"name": "Kaito",
					"text": "No matter how hard we try, we can't correct the distortion of our perception."
				},
				{
					"name": "Kaito",
					"text": "Is the world I see the same as the world you see—I can't even judge that."
				},
				{
					"name": "Kaito",
					"text": "Still, this world is formed from the accumulation of individual common recognition."
				},
				{
					"name": "Kaito",
					"text": "The very existence of this world is a miracle."
				},
				{
					"name": "Kaito",
					"text": "There were many hardships and long anguish to get here... and there were great sacrifices."
				},
				{
					"text": "I turn my face to a boy sitting in the front row."
				},
				{
					"name": "Kaito",
					"text": "You can see the sea right behind me, can you?"
				},
				{
					"text": "I say, looking straight into his eyes."
				},
				{
					"text": "The boy gives me a small, sheepish nod."
				},
				{
					"name": "Kaito",
					"text": "Do you think it's beautiful?"
				},
				{
					"text": "Again, he nods."
				},
				{
					"name": "Kaito",
					"text": "That clear blue sea that blurs in the horizon and melts into the sky. What wills those waves is the common ideals of everyone in this world."
				},
				{
					"name": "Kaito",
					"text": "The sea that everyone around the world dreams about... That is what you’re seeing right now. That’s why it’s so beautiful."
				},
				{
					"text": "The boys stares at me for a moment before nodding again."
				},
				{
					"name": "Kaito",
					"text": "I decided to define myself as someone who would continue to tell this story."
				},
				{
					"name": "Kaito",
					"text": "I want to tell you the story of the one that taught me what life is."
				},
				{
					"name": "Kaito",
					"text": "The one who taught me that I can decide for myself even while bound by other’s perception."
				},
				{
					"name": "Kaito",
					"text": "A girl."
				},
				{
					"name": "Kaito",
					"text": "Her name was Yonagi."
				},
				{
					"name": "Kaito",
					"text": "What I’m about to tell you is..."
				},
				{
					"name": "Kaito",
					"text": "...the story of the girl who dreamed the world."
				}
			]
		},
		{}
	]
}